zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/**
 * \file IfxGtm_reg.h
 * \brief
 * \version iLLD_1_21_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC39XB_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Gtm_Registers_Cfg Gtm address
 * \ingroup IfxSfr_Gtm_Registers
 * 
 * \defgroup IfxSfr_Gtm_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Gtm_Registers_Cfg
 *
 * \defgroup IfxSfr_Gtm_Registers_Cfg_Gtm 2-GTM
 * \ingroup IfxSfr_Gtm_Registers_Cfg
 *
 *
 */
#ifndef IFXGTM_REG_H
#define IFXGTM_REG_H 1
/******************************************************************************/
#include "IfxGtm_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Gtm_Registers_Cfg_BaseAddress
 * \{  */

/** \brief GTM object */
#define MODULE_GTM /*lint --e(923, 9078)*/ ((*(Ifx_GTM*)0xF0100000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Gtm_Registers_Cfg_Gtm
 * \{  */
/** \brief 19000, Mapped section of FIFO RAM */
#define GTM_PSM_FIFO0_MEMORY ((void*)0xF0119000u)
#define GTM_PSM_FIFO0_MEMORY_SIZE (0x1000u)
/** \brief 1D000, Mapped section of FIFO RAM */
#define GTM_PSM_FIFO1_MEMORY ((void*)0xF011D000u)
#define GTM_PSM_FIFO1_MEMORY_SIZE (0x1000u)
/** \brief 21000, Mapped section of FIFO RAM */
#define GTM_PSM_FIFO2_MEMORY ((void*)0xF0121000u)
#define GTM_PSM_FIFO2_MEMORY_SIZE (0x1000u)
/** \brief 2C000, RAM based TRIGGER data */
#define GTM_DPLL_RR2 ((void*)0xF012C000u)
#define GTM_DPLL_RR2_SIZE (0x4000u)
/** \brief 38000, Mapped section of embedded RAM 0 */
#define GTM_MCS0_MEM ((void*)0xF0138000u)
#define GTM_MCS0_MEM_SIZE (0x2000u)
/** \brief 3A000, Mapped section of embedded RAM 1 */
#define GTM_MCS0_MEM1 ((void*)0xF013A000u)
#define GTM_MCS0_MEM1_SIZE (0x1000u)
/** \brief 40000, Mapped section of embedded RAM 0 */
#define GTM_MCS1_MEM ((void*)0xF0140000u)
#define GTM_MCS1_MEM_SIZE (0x2000u)
/** \brief 42000, Mapped section of embedded RAM 1 */
#define GTM_MCS1_MEM1 ((void*)0xF0142000u)
#define GTM_MCS1_MEM1_SIZE (0x1000u)
/** \brief 48000, Mapped section of embedded RAM 0 */
#define GTM_MCS2_MEM ((void*)0xF0148000u)
#define GTM_MCS2_MEM_SIZE (0x2000u)
/** \brief 4A000, Mapped section of embedded RAM 1 */
#define GTM_MCS2_MEM1 ((void*)0xF014A000u)
#define GTM_MCS2_MEM1_SIZE (0x1000u)
/** \brief 50000, Mapped section of embedded RAM 0 */
#define GTM_MCS3_MEM ((void*)0xF0150000u)
#define GTM_MCS3_MEM_SIZE (0x2000u)
/** \brief 52000, Mapped section of embedded RAM 1 */
#define GTM_MCS3_MEM1 ((void*)0xF0152000u)
#define GTM_MCS3_MEM1_SIZE (0x1000u)
/** \brief 58000, Mapped section of embedded RAM 0 */
#define GTM_MCS4_MEM ((void*)0xF0158000u)
#define GTM_MCS4_MEM_SIZE (0x2000u)
/** \brief 5A000, Mapped section of embedded RAM 1 */
#define GTM_MCS4_MEM1 ((void*)0xF015A000u)
#define GTM_MCS4_MEM1_SIZE (0x1000u)
/** \brief 60000, Mapped section of embedded RAM 0 */
#define GTM_MCS5_MEM ((void*)0xF0160000u)
#define GTM_MCS5_MEM_SIZE (0x2000u)
/** \brief 62000, Mapped section of embedded RAM 1 */
#define GTM_MCS5_MEM1 ((void*)0xF0162000u)
#define GTM_MCS5_MEM1_SIZE (0x1000u)
/** \brief 68000, Mapped section of embedded RAM 0 */
#define GTM_MCS6_MEM ((void*)0xF0168000u)
#define GTM_MCS6_MEM_SIZE (0x2000u)
/** \brief 6A000, Mapped section of embedded RAM 1 */
#define GTM_MCS6_MEM1 ((void*)0xF016A000u)
#define GTM_MCS6_MEM1_SIZE (0x1000u)
/** \brief 70000, Mapped section of embedded RAM 0 */
#define GTM_MCS7_MEM ((void*)0xF0170000u)
#define GTM_MCS7_MEM_SIZE (0x2000u)
/** \brief 72000, Mapped section of embedded RAM 1 */
#define GTM_MCS7_MEM1 ((void*)0xF0172000u)
#define GTM_MCS7_MEM1_SIZE (0x1000u)
/** \brief 78000, Mapped section of embedded RAM 0 */
#define GTM_MCS8_MEM ((void*)0xF0178000u)
#define GTM_MCS8_MEM_SIZE (0x2000u)
/** \brief 7A000, Mapped section of embedded RAM 1 */
#define GTM_MCS8_MEM1 ((void*)0xF017A000u)
#define GTM_MCS8_MEM1_SIZE (0x1000u)
/** \brief 80000, Mapped section of embedded RAM 0 */
#define GTM_MCS9_MEM ((void*)0xF0180000u)
#define GTM_MCS9_MEM_SIZE (0x2000u)
/** \brief 82000, Mapped section of embedded RAM 1 */
#define GTM_MCS9_MEM1 ((void*)0xF0182000u)
#define GTM_MCS9_MEM1_SIZE (0x1000u)
/** \brief 0, GTM Version Control Register */
#define GTM_REV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_REV*)0xF0100000u)

/** \brief 4, GTM Global Reset Register */
#define GTM_RST /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_RST*)0xF0100004u)

/** \brief 8, GTM Global Control Register */
#define GTM_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CTRL*)0xF0100008u)

