zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 70, GTM External Capture Trigger Enable 5 */
#define GTM_EXT_CAP_EN5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_EXT_CAP_EN*)0xF0100070u)
/** Alias (User Manual Name) for GTM_EXT_CAP_EN5.
* To use register names with standard convension, please use GTM_EXT_CAP_EN5.
*/
#define GTM_EXT_CAP_EN_5 (GTM_EXT_CAP_EN5)

/** \brief 74, GTM External Capture Trigger Enable 6 */
#define GTM_EXT_CAP_EN6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_EXT_CAP_EN*)0xF0100074u)
/** Alias (User Manual Name) for GTM_EXT_CAP_EN6.
* To use register names with standard convension, please use GTM_EXT_CAP_EN6.
*/
#define GTM_EXT_CAP_EN_6 (GTM_EXT_CAP_EN6)

/** \brief 78, GTM External Capture Trigger Enable 7 */
#define GTM_EXT_CAP_EN7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_EXT_CAP_EN*)0xF0100078u)
/** Alias (User Manual Name) for GTM_EXT_CAP_EN7.
* To use register names with standard convension, please use GTM_EXT_CAP_EN7.
*/
#define GTM_EXT_CAP_EN_7 (GTM_EXT_CAP_EN7)

/** \brief 80, GTM TOM 0 Output Level */
#define GTM_OUT_TOM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_OUT_TOM*)0xF0100080u)
/** Alias (User Manual Name) for GTM_OUT_TOM0.
* To use register names with standard convension, please use GTM_OUT_TOM0.
*/
#define GTM_TOM0_OUT (GTM_OUT_TOM0)

/** \brief 84, GTM TOM 1 Output Level */
#define GTM_OUT_TOM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_OUT_TOM*)0xF0100084u)
/** Alias (User Manual Name) for GTM_OUT_TOM1.
* To use register names with standard convension, please use GTM_OUT_TOM1.
*/
#define GTM_TOM1_OUT (GTM_OUT_TOM1)

/** \brief 88, GTM TOM 2 Output Level */
#define GTM_OUT_TOM2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_OUT_TOM*)0xF0100088u)
/** Alias (User Manual Name) for GTM_OUT_TOM2.
* To use register names with standard convension, please use GTM_OUT_TOM2.
*/
#define GTM_TOM2_OUT (GTM_OUT_TOM2)

/** \brief 8C, GTM TOM 3 Output Level */
#define GTM_OUT_TOM3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_OUT_TOM*)0xF010008Cu)
/** Alias (User Manual Name) for GTM_OUT_TOM3.
* To use register names with standard convension, please use GTM_OUT_TOM3.
*/
#define GTM_TOM3_OUT (GTM_OUT_TOM3)

/** \brief 90, GTM TOM 4 Output Level */
#define GTM_OUT_TOM4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_OUT_TOM*)0xF0100090u)
/** Alias (User Manual Name) for GTM_OUT_TOM4.
* To use register names with standard convension, please use GTM_OUT_TOM4.
*/
#define GTM_TOM4_OUT (GTM_OUT_TOM4)

/** \brief 94, GTM TOM 5 Output Level */
#define GTM_OUT_TOM5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_OUT_TOM*)0xF0100094u)
/** Alias (User Manual Name) for GTM_OUT_TOM5.
* To use register names with standard convension, please use GTM_OUT_TOM5.
*/
#define GTM_TOM5_OUT (GTM_OUT_TOM5)

/** \brief 98, GTM ATOM 0 Output Level */
#define GTM_OUT_ATOM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_OUT_ATOM*)0xF0100098u)
/** Alias (User Manual Name) for GTM_OUT_ATOM0.
* To use register names with standard convension, please use GTM_OUT_ATOM0.
*/
#define GTM_ATOM0_OUT (GTM_OUT_ATOM0)

/** \brief 9C, GTM ATOM 2 Output Level */
#define GTM_OUT_ATOM2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_OUT_ATOM*)0xF010009Cu)
/** Alias (User Manual Name) for GTM_OUT_ATOM2.
* To use register names with standard convension, please use GTM_OUT_ATOM2.
*/
#define GTM_ATOM2_OUT (GTM_OUT_ATOM2)

/** \brief A0, GTM ATOM 4 Output Level */
#define GTM_OUT_ATOM4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_OUT_ATOM*)0xF01000A0u)
/** Alias (User Manual Name) for GTM_OUT_ATOM4.
* To use register names with standard convension, please use GTM_OUT_ATOM4.
*/
#define GTM_ATOM4_OUT (GTM_OUT_ATOM4)

/** \brief A4, GTM ATOM 6 Output Level */
#define GTM_OUT_ATOM6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_OUT_ATOM*)0xF01000A4u)
/** Alias (User Manual Name) for GTM_OUT_ATOM6.
* To use register names with standard convension, please use GTM_OUT_ATOM6.
*/
#define GTM_ATOM6_OUT (GTM_OUT_ATOM6)

/** \brief A8, GTM ATOM 8 Output Level */
#define GTM_OUT_ATOM8 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_OUT_ATOM*)0xF01000A8u)
/** Alias (User Manual Name) for GTM_OUT_ATOM8.
* To use register names with standard convension, please use GTM_OUT_ATOM8.
*/
#define GTM_ATOM8_OUT (GTM_OUT_ATOM8)

/** \brief AC, GTM ATOM 10 Output Level */
#define GTM_OUT_ATOM10 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_OUT_ATOM*)0xF01000ACu)
/** Alias (User Manual Name) for GTM_OUT_ATOM10.
* To use register names with standard convension, please use GTM_OUT_ATOM10.
*/
#define GTM_ATOM10_OUT (GTM_OUT_ATOM10)

/** \brief B0, GTM Cluster Clock Configuration */
#define GTM_CLS_CLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CLS_CLK_CFG*)0xF01000B0u)

/** \brief 100, TBU Global Channel Enable */
#define GTM_TBU_CHEN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TBU_CHEN*)0xF0100100u)

/** \brief 104, TBU Channel 0 Control Register */
#define GTM_TBU_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TBU_CH0_CTRL*)0xF0100104u)

/** \brief 108, TBU Channel 0 Base Register */
#define GTM_TBU_CH0_BASE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TBU_CH0_BASE*)0xF0100108u)

/** \brief 10C, TBU Channel 1 Control Register */
#define GTM_TBU_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TBU_CH1_CTRL*)0xF010010Cu)

/** \brief 110, TBU Channel 1 Base Register */
#define GTM_TBU_CH1_BASE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TBU_CH1_BASE*)0xF0100110u)

/** \brief 114, TBU Channel 2 Control Register */
#define GTM_TBU_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TBU_CH2_CTRL*)0xF0100114u)

/** \brief 118, TBU Channel 2 Base Register */
#define GTM_TBU_CH2_BASE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TBU_CH2_BASE*)0xF0100118u)

/** \brief 11C, TBU Channel 3 Control Register */
#define GTM_TBU_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TBU_CH3_CTRL*)0xF010011Cu)

/** \brief 120, TBU Channel 3 Base Register */
#define GTM_TBU_CH3_BASE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TBU_CH3_BASE*)0xF0100120u)

/** \brief 124, TBU Channel 3 Modulo Value Register */
#define GTM_TBU_CH3_BASE_MARK /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TBU_CH3_BASE_MARK*)0xF0100124u)

/** \brief 128, TBU Channel 3 Base Captured Register */
#define GTM_TBU_CH3_BASE_CAPTURE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TBU_CH3_BASE_CAPTURE*)0xF0100128u)

/** \brief 180, Monitor Status Register */
#define GTM_MON_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MON_STATUS*)0xF0100180u)

