zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 2AA8, TIM3 Channel 5 Extended Control Register */
#define GTM_TIM3_CH5_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0102AA8u)

/** \brief 2AAC, TIM3 Channel 5 Interrupt Notification Register */
#define GTM_TIM3_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0102AACu)

/** \brief 2AB0, TIM3 Channel 5 Interrupt Enable Register */
#define GTM_TIM3_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0102AB0u)

/** \brief 2AB4, TIM3 Channel 5 Force Interrupt Register */
#define GTM_TIM3_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0102AB4u)

/** \brief 2AB8, TIM3 Channel 5 Interrupt Mode Configuration Register */
#define GTM_TIM3_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0102AB8u)

/** \brief 2ABC, TIM3 Channel 5 Error Interrupt Enable Register */
#define GTM_TIM3_CH5_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF0102ABCu)

/** \brief 2B00, TIM3 Channel 6 General Purpose 0 Register */
#define GTM_TIM3_CH6_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0102B00u)

/** \brief 2B04, TIM3 Channel 6 General Purpose 1 Register */
#define GTM_TIM3_CH6_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0102B04u)

/** \brief 2B08, TIM3 Channel 6 SMU Counter Register */
#define GTM_TIM3_CH6_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0102B08u)

/** \brief 2B0C, TIM3 Channel 6 SMU Edge Counter Register */
#define GTM_TIM3_CH6_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF0102B0Cu)

/** \brief 2B10, TIM3 Channel 6 SMU Shadow Counter Register */
#define GTM_TIM3_CH6_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0102B10u)

/** \brief 2B14, TIM3 Channel 6 TDU Counter Register */
#define GTM_TIM3_CH6_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0102B14u)

/** \brief 2B18, TIM3 Channel 6 TDU Control Register */
#define GTM_TIM3_CH6_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0102B18u)

/** \brief 2B1C, TIM3 Channel 6 Filter Parameter 0 Register */
#define GTM_TIM3_CH6_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0102B1Cu)

/** \brief 2B20, TIM3 Channel 6 Filter Parameter 1 Register */
#define GTM_TIM3_CH6_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0102B20u)

/** \brief 2B24, TIM3 Channel 6 Control Register */
#define GTM_TIM3_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0102B24u)

/** \brief 2B28, TIM3 Channel 6 Extended Control Register */
#define GTM_TIM3_CH6_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0102B28u)

/** \brief 2B2C, TIM3 Channel 6 Interrupt Notification Register */
#define GTM_TIM3_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0102B2Cu)

/** \brief 2B30, TIM3 Channel 6 Interrupt Enable Register */
#define GTM_TIM3_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0102B30u)

/** \brief 2B34, TIM3 Channel 6 Force Interrupt Register */
#define GTM_TIM3_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0102B34u)

/** \brief 2B38, TIM3 Channel 6 Interrupt Mode Configuration Register */
#define GTM_TIM3_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0102B38u)

/** \brief 2B3C, TIM3 Channel 6 Error Interrupt Enable Register */
#define GTM_TIM3_CH6_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF0102B3Cu)

/** \brief 2B80, TIM3 Channel 7 General Purpose 0 Register */
#define GTM_TIM3_CH7_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0102B80u)

/** \brief 2B84, TIM3 Channel 7 General Purpose 1 Register */
#define GTM_TIM3_CH7_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0102B84u)

/** \brief 2B88, TIM3 Channel 7 SMU Counter Register */
#define GTM_TIM3_CH7_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0102B88u)

/** \brief 2B8C, TIM3 Channel 7 SMU Edge Counter Register */
#define GTM_TIM3_CH7_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF0102B8Cu)

/** \brief 2B90, TIM3 Channel 7 SMU Shadow Counter Register */
#define GTM_TIM3_CH7_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0102B90u)

/** \brief 2B94, TIM3 Channel 7 TDU Counter Register */
#define GTM_TIM3_CH7_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0102B94u)

/** \brief 2B98, TIM3 Channel 7 TDU Control Register */
#define GTM_TIM3_CH7_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0102B98u)

/** \brief 2B9C, TIM3 Channel 7 Filter Parameter 0 Register */
#define GTM_TIM3_CH7_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0102B9Cu)

/** \brief 2BA0, TIM3 Channel 7 Filter Parameter 1 Register */
#define GTM_TIM3_CH7_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0102BA0u)

/** \brief 2BA4, TIM3 Channel 7 Control Register */
#define GTM_TIM3_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0102BA4u)

/** \brief 2BA8, TIM3 Channel 7 Extended Control Register */
#define GTM_TIM3_CH7_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0102BA8u)

/** \brief 2BAC, TIM3 Channel 7 Interrupt Notification Register */
#define GTM_TIM3_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0102BACu)

/** \brief 2BB0, TIM3 Channel 7 Interrupt Enable Register */
#define GTM_TIM3_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0102BB0u)

/** \brief 2BB4, TIM3 Channel 7 Force Interrupt Register */
#define GTM_TIM3_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0102BB4u)

/** \brief 2BB8, TIM3 Channel 7 Interrupt Mode Configuration Register */
#define GTM_TIM3_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0102BB8u)

/** \brief 2BBC, TIM3 Channel 7 Error Interrupt Enable Register */
#define GTM_TIM3_CH7_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF0102BBCu)

/** \brief 3000, TIM4 Channel 0 General Purpose 0 Register */
#define GTM_TIM4_CH0_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103000u)

/** \brief 3004, TIM4 Channel 0 General Purpose 1 Register */
#define GTM_TIM4_CH0_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103004u)

