zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 3BB4, TIM5 Channel 7 Force Interrupt Register */
#define GTM_TIM5_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103BB4u)

/** \brief 3BB8, TIM5 Channel 7 Interrupt Mode Configuration Register */
#define GTM_TIM5_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103BB8u)

/** \brief 3BBC, TIM5 Channel 7 Error Interrupt Enable Register */
#define GTM_TIM5_CH7_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF0103BBCu)

/** \brief 4000, TIM6 Channel 0 General Purpose 0 Register */
#define GTM_TIM6_CH0_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104000u)

/** \brief 4004, TIM6 Channel 0 General Purpose 1 Register */
#define GTM_TIM6_CH0_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104004u)

/** \brief 4008, TIM6 Channel 0 SMU Counter Register */
#define GTM_TIM6_CH0_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104008u)

/** \brief 400C, TIM6 Channel 0 SMU Edge Counter Register */
#define GTM_TIM6_CH0_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010400Cu)

/** \brief 4010, TIM6 Channel 0 SMU Shadow Counter Register */
#define GTM_TIM6_CH0_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104010u)

/** \brief 4014, TIM6 Channel 0 TDU Counter Register */
#define GTM_TIM6_CH0_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104014u)

/** \brief 4018, TIM6 Channel 0 TDU Control Register */
#define GTM_TIM6_CH0_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104018u)

/** \brief 401C, TIM6 Channel 0 Filter Parameter 0 Register */
#define GTM_TIM6_CH0_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010401Cu)

/** \brief 4020, TIM6 Channel 0 Filter Parameter 1 Register */
#define GTM_TIM6_CH0_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0104020u)

/** \brief 4024, TIM6 Channel 0 Control Register */
#define GTM_TIM6_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0104024u)

/** \brief 4028, TIM6 Channel 0 Extended Control Register */
#define GTM_TIM6_CH0_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0104028u)

/** \brief 402C, TIM6 Channel 0 Interrupt Notification Register */
#define GTM_TIM6_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010402Cu)

/** \brief 4030, TIM6 Channel 0 Interrupt Enable Register */
#define GTM_TIM6_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0104030u)

/** \brief 4034, TIM6 Channel 0 Force Interrupt Register */
#define GTM_TIM6_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0104034u)

/** \brief 4038, TIM6 Channel 0 Interrupt Mode Configuration Register */
#define GTM_TIM6_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0104038u)

/** \brief 403C, TIM6 Channel 0 Error Interrupt Enable Register */
#define GTM_TIM6_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010403Cu)

/** \brief 4074, TIM6 Input Value Observation Register */
#define GTM_TIM6_INP_VAL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_INP_VAL*)0xF0104074u)

/** \brief 4078, TIM6 AUX IN Source Selection Register */
#define GTM_TIM6_IN_SRC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_IN_SRC*)0xF0104078u)

/** \brief 407C, TIM6 Global Software Reset Register */
#define GTM_TIM6_RST /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_RST*)0xF010407Cu)

/** \brief 4080, TIM6 Channel 1 General Purpose 0 Register */
#define GTM_TIM6_CH1_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104080u)

/** \brief 4084, TIM6 Channel 1 General Purpose 1 Register */
#define GTM_TIM6_CH1_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104084u)

/** \brief 4088, TIM6 Channel 1 SMU Counter Register */
#define GTM_TIM6_CH1_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104088u)

/** \brief 408C, TIM6 Channel 1 SMU Edge Counter Register */
#define GTM_TIM6_CH1_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010408Cu)

/** \brief 4090, TIM6 Channel 1 SMU Shadow Counter Register */
#define GTM_TIM6_CH1_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104090u)

/** \brief 4094, TIM6 Channel 1 TDU Counter Register */
#define GTM_TIM6_CH1_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104094u)

/** \brief 4098, TIM6 Channel 1 TDU Control Register */
#define GTM_TIM6_CH1_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104098u)

/** \brief 409C, TIM6 Channel 1 Filter Parameter 0 Register */
#define GTM_TIM6_CH1_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010409Cu)

/** \brief 40A0, TIM6 Channel 1 Filter Parameter 1 Register */
#define GTM_TIM6_CH1_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01040A0u)

/** \brief 40A4, TIM6 Channel 1 Control Register */
#define GTM_TIM6_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01040A4u)

/** \brief 40A8, TIM6 Channel 1 Extended Control Register */
#define GTM_TIM6_CH1_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01040A8u)

/** \brief 40AC, TIM6 Channel 1 Interrupt Notification Register */
#define GTM_TIM6_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01040ACu)

/** \brief 40B0, TIM6 Channel 1 Interrupt Enable Register */
#define GTM_TIM6_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01040B0u)

/** \brief 40B4, TIM6 Channel 1 Force Interrupt Register */
#define GTM_TIM6_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01040B4u)

/** \brief 40B8, TIM6 Channel 1 Interrupt Mode Configuration Register */
#define GTM_TIM6_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01040B8u)

/** \brief 40BC, TIM6 Channel 1 Error Interrupt Enable Register */
#define GTM_TIM6_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01040BCu)

/** \brief 4100, TIM6 Channel 2 General Purpose 0 Register */
#define GTM_TIM6_CH2_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104100u)

/** \brief 4104, TIM6 Channel 2 General Purpose 1 Register */
#define GTM_TIM6_CH2_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104104u)

/** \brief 4108, TIM6 Channel 2 SMU Counter Register */
#define GTM_TIM6_CH2_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104108u)

/** \brief 410C, TIM6 Channel 2 SMU Edge Counter Register */
#define GTM_TIM6_CH2_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010410Cu)

/** \brief 4110, TIM6 Channel 2 SMU Shadow Counter Register */
#define GTM_TIM6_CH2_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104110u)

/** \brief 4114, TIM6 Channel 2 TDU Counter Register */
#define GTM_TIM6_CH2_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104114u)

/** \brief 4118, TIM6 Channel 2 TDU Control Register */
#define GTM_TIM6_CH2_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104118u)

/** \brief 411C, TIM6 Channel 2 Filter Parameter 0 Register */
#define GTM_TIM6_CH2_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010411Cu)

/** \brief 4120, TIM6 Channel 2 Filter Parameter 1 Register */
#define GTM_TIM6_CH2_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0104120u)

/** \brief 4124, TIM6 Channel 2 Control Register */
#define GTM_TIM6_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0104124u)

/** \brief 4128, TIM6 Channel 2 Extended Control Register */
#define GTM_TIM6_CH2_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0104128u)

/** \brief 412C, TIM6 Channel 2 Interrupt Notification Register */
#define GTM_TIM6_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010412Cu)

/** \brief 4130, TIM6 Channel 2 Interrupt Enable Register */
#define GTM_TIM6_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0104130u)

/** \brief 4134, TIM6 Channel 2 Force Interrupt Register */
#define GTM_TIM6_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0104134u)

/** \brief 4138, TIM6 Channel 2 Interrupt Mode Configuration Register */
#define GTM_TIM6_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0104138u)

/** \brief 413C, TIM6 Channel 2 Error Interrupt Enable Register */
#define GTM_TIM6_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010413Cu)

/** \brief 4180, TIM6 Channel 3 General Purpose 0 Register */
#define GTM_TIM6_CH3_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104180u)

/** \brief 4184, TIM6 Channel 3 General Purpose 1 Register */
#define GTM_TIM6_CH3_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104184u)

