zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 4914, TIM7 Channel 2 TDU Counter Register */
#define GTM_TIM7_CH2_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104914u)

/** \brief 4918, TIM7 Channel 2 TDU Control Register */
#define GTM_TIM7_CH2_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104918u)

/** \brief 491C, TIM7 Channel 2 Filter Parameter 0 Register */
#define GTM_TIM7_CH2_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010491Cu)

/** \brief 4920, TIM7 Channel 2 Filter Parameter 1 Register */
#define GTM_TIM7_CH2_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0104920u)

/** \brief 4924, TIM7 Channel 2 Control Register */
#define GTM_TIM7_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0104924u)

/** \brief 4928, TIM7 Channel 2 Extended Control Register */
#define GTM_TIM7_CH2_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0104928u)

/** \brief 492C, TIM7 Channel 2 Interrupt Notification Register */
#define GTM_TIM7_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010492Cu)

/** \brief 4930, TIM7 Channel 2 Interrupt Enable Register */
#define GTM_TIM7_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0104930u)

/** \brief 4934, TIM7 Channel 2 Force Interrupt Register */
#define GTM_TIM7_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0104934u)

/** \brief 4938, TIM7 Channel 2 Interrupt Mode Configuration Register */
#define GTM_TIM7_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0104938u)

/** \brief 493C, TIM7 Channel 2 Error Interrupt Enable Register */
#define GTM_TIM7_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010493Cu)

/** \brief 4980, TIM7 Channel 3 General Purpose 0 Register */
#define GTM_TIM7_CH3_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104980u)

/** \brief 4984, TIM7 Channel 3 General Purpose 1 Register */
#define GTM_TIM7_CH3_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104984u)

/** \brief 4988, TIM7 Channel 3 SMU Counter Register */
#define GTM_TIM7_CH3_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104988u)

/** \brief 498C, TIM7 Channel 3 SMU Edge Counter Register */
#define GTM_TIM7_CH3_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010498Cu)

/** \brief 4990, TIM7 Channel 3 SMU Shadow Counter Register */
#define GTM_TIM7_CH3_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104990u)

/** \brief 4994, TIM7 Channel 3 TDU Counter Register */
#define GTM_TIM7_CH3_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104994u)

/** \brief 4998, TIM7 Channel 3 TDU Control Register */
#define GTM_TIM7_CH3_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104998u)

/** \brief 499C, TIM7 Channel 3 Filter Parameter 0 Register */
#define GTM_TIM7_CH3_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010499Cu)

/** \brief 49A0, TIM7 Channel 3 Filter Parameter 1 Register */
#define GTM_TIM7_CH3_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01049A0u)

/** \brief 49A4, TIM7 Channel 3 Control Register */
#define GTM_TIM7_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01049A4u)

/** \brief 49A8, TIM7 Channel 3 Extended Control Register */
#define GTM_TIM7_CH3_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01049A8u)

/** \brief 49AC, TIM7 Channel 3 Interrupt Notification Register */
#define GTM_TIM7_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01049ACu)

/** \brief 49B0, TIM7 Channel 3 Interrupt Enable Register */
#define GTM_TIM7_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01049B0u)

/** \brief 49B4, TIM7 Channel 3 Force Interrupt Register */
#define GTM_TIM7_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01049B4u)

/** \brief 49B8, TIM7 Channel 3 Interrupt Mode Configuration Register */
#define GTM_TIM7_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01049B8u)

/** \brief 49BC, TIM7 Channel 3 Error Interrupt Enable Register */
#define GTM_TIM7_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01049BCu)

/** \brief 4A00, TIM7 Channel 4 General Purpose 0 Register */
#define GTM_TIM7_CH4_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104A00u)

/** \brief 4A04, TIM7 Channel 4 General Purpose 1 Register */
#define GTM_TIM7_CH4_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104A04u)

/** \brief 4A08, TIM7 Channel 4 SMU Counter Register */
#define GTM_TIM7_CH4_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104A08u)

/** \brief 4A0C, TIM7 Channel 4 SMU Edge Counter Register */
#define GTM_TIM7_CH4_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF0104A0Cu)

/** \brief 4A10, TIM7 Channel 4 SMU Shadow Counter Register */
#define GTM_TIM7_CH4_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104A10u)

/** \brief 4A14, TIM7 Channel 4 TDU Counter Register */
#define GTM_TIM7_CH4_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104A14u)

/** \brief 4A18, TIM7 Channel 4 TDU Control Register */
#define GTM_TIM7_CH4_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104A18u)

/** \brief 4A1C, TIM7 Channel 4 Filter Parameter 0 Register */
#define GTM_TIM7_CH4_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0104A1Cu)

/** \brief 4A20, TIM7 Channel 4 Filter Parameter 1 Register */
#define GTM_TIM7_CH4_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0104A20u)

/** \brief 4A24, TIM7 Channel 4 Control Register */
#define GTM_TIM7_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0104A24u)

/** \brief 4A28, TIM7 Channel 4 Extended Control Register */
#define GTM_TIM7_CH4_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0104A28u)

/** \brief 4A2C, TIM7 Channel 4 Interrupt Notification Register */
#define GTM_TIM7_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0104A2Cu)

/** \brief 4A30, TIM7 Channel 4 Interrupt Enable Register */
#define GTM_TIM7_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0104A30u)

