zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 4A34, TIM7 Channel 4 Force Interrupt Register */
#define GTM_TIM7_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0104A34u)

/** \brief 4A38, TIM7 Channel 4 Interrupt Mode Configuration Register */
#define GTM_TIM7_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0104A38u)

/** \brief 4A3C, TIM7 Channel 4 Error Interrupt Enable Register */
#define GTM_TIM7_CH4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF0104A3Cu)

/** \brief 4A80, TIM7 Channel 5 General Purpose 0 Register */
#define GTM_TIM7_CH5_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104A80u)

/** \brief 4A84, TIM7 Channel 5 General Purpose 1 Register */
#define GTM_TIM7_CH5_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104A84u)

/** \brief 4A88, TIM7 Channel 5 SMU Counter Register */
#define GTM_TIM7_CH5_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104A88u)

/** \brief 4A8C, TIM7 Channel 5 SMU Edge Counter Register */
#define GTM_TIM7_CH5_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF0104A8Cu)

/** \brief 4A90, TIM7 Channel 5 SMU Shadow Counter Register */
#define GTM_TIM7_CH5_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104A90u)

/** \brief 4A94, TIM7 Channel 5 TDU Counter Register */
#define GTM_TIM7_CH5_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104A94u)

/** \brief 4A98, TIM7 Channel 5 TDU Control Register */
#define GTM_TIM7_CH5_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104A98u)

/** \brief 4A9C, TIM7 Channel 5 Filter Parameter 0 Register */
#define GTM_TIM7_CH5_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0104A9Cu)

/** \brief 4AA0, TIM7 Channel 5 Filter Parameter 1 Register */
#define GTM_TIM7_CH5_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0104AA0u)

/** \brief 4AA4, TIM7 Channel 5 Control Register */
#define GTM_TIM7_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0104AA4u)

/** \brief 4AA8, TIM7 Channel 5 Extended Control Register */
#define GTM_TIM7_CH5_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0104AA8u)

/** \brief 4AAC, TIM7 Channel 5 Interrupt Notification Register */
#define GTM_TIM7_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0104AACu)

/** \brief 4AB0, TIM7 Channel 5 Interrupt Enable Register */
#define GTM_TIM7_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0104AB0u)

/** \brief 4AB4, TIM7 Channel 5 Force Interrupt Register */
#define GTM_TIM7_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0104AB4u)

/** \brief 4AB8, TIM7 Channel 5 Interrupt Mode Configuration Register */
#define GTM_TIM7_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0104AB8u)

/** \brief 4ABC, TIM7 Channel 5 Error Interrupt Enable Register */
#define GTM_TIM7_CH5_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF0104ABCu)

/** \brief 4B00, TIM7 Channel 6 General Purpose 0 Register */
#define GTM_TIM7_CH6_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104B00u)

/** \brief 4B04, TIM7 Channel 6 General Purpose 1 Register */
#define GTM_TIM7_CH6_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104B04u)

/** \brief 4B08, TIM7 Channel 6 SMU Counter Register */
#define GTM_TIM7_CH6_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104B08u)

/** \brief 4B0C, TIM7 Channel 6 SMU Edge Counter Register */
#define GTM_TIM7_CH6_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF0104B0Cu)

/** \brief 4B10, TIM7 Channel 6 SMU Shadow Counter Register */
#define GTM_TIM7_CH6_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104B10u)

/** \brief 4B14, TIM7 Channel 6 TDU Counter Register */
#define GTM_TIM7_CH6_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104B14u)

/** \brief 4B18, TIM7 Channel 6 TDU Control Register */
#define GTM_TIM7_CH6_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104B18u)

/** \brief 4B1C, TIM7 Channel 6 Filter Parameter 0 Register */
#define GTM_TIM7_CH6_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0104B1Cu)

/** \brief 4B20, TIM7 Channel 6 Filter Parameter 1 Register */
#define GTM_TIM7_CH6_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0104B20u)

/** \brief 4B24, TIM7 Channel 6 Control Register */
#define GTM_TIM7_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0104B24u)

/** \brief 4B28, TIM7 Channel 6 Extended Control Register */
#define GTM_TIM7_CH6_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0104B28u)

/** \brief 4B2C, TIM7 Channel 6 Interrupt Notification Register */
#define GTM_TIM7_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0104B2Cu)

/** \brief 4B30, TIM7 Channel 6 Interrupt Enable Register */
#define GTM_TIM7_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0104B30u)

/** \brief 4B34, TIM7 Channel 6 Force Interrupt Register */
#define GTM_TIM7_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0104B34u)

/** \brief 4B38, TIM7 Channel 6 Interrupt Mode Configuration Register */
#define GTM_TIM7_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0104B38u)

/** \brief 4B3C, TIM7 Channel 6 Error Interrupt Enable Register */
#define GTM_TIM7_CH6_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF0104B3Cu)

/** \brief 4B80, TIM7 Channel 7 General Purpose 0 Register */
#define GTM_TIM7_CH7_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104B80u)

/** \brief 4B84, TIM7 Channel 7 General Purpose 1 Register */
#define GTM_TIM7_CH7_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104B84u)

/** \brief 4B88, TIM7 Channel 7 SMU Counter Register */
#define GTM_TIM7_CH7_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104B88u)

/** \brief 4B8C, TIM7 Channel 7 SMU Edge Counter Register */
#define GTM_TIM7_CH7_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF0104B8Cu)

/** \brief 4B90, TIM7 Channel 7 SMU Shadow Counter Register */
#define GTM_TIM7_CH7_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104B90u)

