zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 90DC, TOM2 Channel 3 Interrupt Notification Register */
#define GTM_TOM2_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF01090DCu)

/** \brief 90E0, TOM2 Channel 3 Interrupt Enable Register */
#define GTM_TOM2_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01090E0u)

/** \brief 90E4, TOM2 Channel 3 Force Interrupt Register */
#define GTM_TOM2_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01090E4u)

/** \brief 90E8, TOM2 Channel 3 Interrupt Mode Register */
#define GTM_TOM2_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01090E8u)

/** \brief 9100, TOM2 Channel 4 Control Register */
#define GTM_TOM2_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109100u)

/** \brief 9104, TOM2 Channel 4 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH4_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109104u)

/** \brief 9108, TOM2 Channel 4 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH4_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109108u)

/** \brief 910C, TOM2 Channel 4 CCU0 Compare Register */
#define GTM_TOM2_CH4_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010910Cu)

/** \brief 9110, TOM2 Channel 4 CCU1 Compare Register */
#define GTM_TOM2_CH4_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109110u)

/** \brief 9114, TOM2 Channel 4 CCU0 Counter Register */
#define GTM_TOM2_CH4_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109114u)

/** \brief 9118, TOM2 Channel 4 Status Register */
#define GTM_TOM2_CH4_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109118u)

/** \brief 911C, TOM2 Channel 4 Interrupt Notification Register */
#define GTM_TOM2_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010911Cu)

/** \brief 9120, TOM2 Channel 4 Interrupt Enable Register */
#define GTM_TOM2_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109120u)

/** \brief 9124, TOM2 Channel 4 Force Interrupt Register */
#define GTM_TOM2_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109124u)

/** \brief 9128, TOM2 Channel 4 Interrupt Mode Register */
#define GTM_TOM2_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109128u)

/** \brief 9140, TOM2 Channel 5 Control Register */
#define GTM_TOM2_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109140u)

/** \brief 9144, TOM2 Channel 5 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH5_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109144u)

/** \brief 9148, TOM2 Channel 5 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH5_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109148u)

/** \brief 914C, TOM2 Channel 5 CCU0 Compare Register */
#define GTM_TOM2_CH5_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010914Cu)

/** \brief 9150, TOM2 Channel 5 CCU1 Compare Register */
#define GTM_TOM2_CH5_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109150u)

/** \brief 9154, TOM2 Channel 5 CCU0 Counter Register */
#define GTM_TOM2_CH5_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109154u)

/** \brief 9158, TOM2 Channel 5 Status Register */
#define GTM_TOM2_CH5_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109158u)

/** \brief 915C, TOM2 Channel 5 Interrupt Notification Register */
#define GTM_TOM2_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010915Cu)

/** \brief 9160, TOM2 Channel 5 Interrupt Enable Register */
#define GTM_TOM2_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109160u)

/** \brief 9164, TOM2 Channel 5 Force Interrupt Register */
#define GTM_TOM2_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109164u)

/** \brief 9168, TOM2 Channel 5 Interrupt Mode Register */
#define GTM_TOM2_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109168u)

/** \brief 9180, TOM2 Channel 6 Control Register */
#define GTM_TOM2_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109180u)

/** \brief 9184, TOM2 Channel 6 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH6_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109184u)

/** \brief 9188, TOM2 Channel 6 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH6_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109188u)

/** \brief 918C, TOM2 Channel 6 CCU0 Compare Register */
#define GTM_TOM2_CH6_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010918Cu)

/** \brief 9190, TOM2 Channel 6 CCU1 Compare Register */
#define GTM_TOM2_CH6_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109190u)

/** \brief 9194, TOM2 Channel 6 CCU0 Counter Register */
#define GTM_TOM2_CH6_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109194u)

/** \brief 9198, TOM2 Channel 6 Status Register */
#define GTM_TOM2_CH6_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109198u)

/** \brief 919C, TOM2 Channel 6 Interrupt Notification Register */
#define GTM_TOM2_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010919Cu)

/** \brief 91A0, TOM2 Channel 6 Interrupt Enable Register */
#define GTM_TOM2_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01091A0u)

/** \brief 91A4, TOM2 Channel 6 Force Interrupt Register */
#define GTM_TOM2_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01091A4u)

/** \brief 91A8, TOM2 Channel 6 Interrupt Mode Register */
#define GTM_TOM2_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01091A8u)

/** \brief 91C0, TOM2 Channel 7 Control Register */
#define GTM_TOM2_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF01091C0u)

/** \brief 91C4, TOM2 Channel 7 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH7_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF01091C4u)

/** \brief 91C8, TOM2 Channel 7 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH7_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF01091C8u)

/** \brief 91CC, TOM2 Channel 7 CCU0 Compare Register */
#define GTM_TOM2_CH7_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF01091CCu)

