zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 9BCC, TOM3 Channel 15 CCU0 Compare Register */
#define GTM_TOM3_CH15_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109BCCu)

/** \brief 9BD0, TOM3 Channel 15 CCU1 Compare Register */
#define GTM_TOM3_CH15_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109BD0u)

/** \brief 9BD4, TOM3 Channel 15 CCU0 Counter Register */
#define GTM_TOM3_CH15_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109BD4u)

/** \brief 9BD8, TOM3 Channel 15 Status Register */
#define GTM_TOM3_CH15_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109BD8u)

/** \brief 9BDC, TOM3 Channel 15 Interrupt Notification Register */
#define GTM_TOM3_CH15_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109BDCu)

/** \brief 9BE0, TOM3 Channel 15 Interrupt Enable Register */
#define GTM_TOM3_CH15_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109BE0u)

/** \brief 9BE4, TOM3 Channel 15 Force Interrupt Register */
#define GTM_TOM3_CH15_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109BE4u)

/** \brief 9BE8, TOM3 Channel 15 Interrupt Mode Register */
#define GTM_TOM3_CH15_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109BE8u)

/** \brief A000, TOM4 Channel 0 Control Register */
#define GTM_TOM4_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A000u)

/** \brief A004, TOM4 Channel 0 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A004u)

/** \brief A008, TOM4 Channel 0 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A008u)

/** \brief A00C, TOM4 Channel 0 CCU0 Compare Register */
#define GTM_TOM4_CH0_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A00Cu)

/** \brief A010, TOM4 Channel 0 CCU1 Compare Register */
#define GTM_TOM4_CH0_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A010u)

/** \brief A014, TOM4 Channel 0 CCU0 Counter Register */
#define GTM_TOM4_CH0_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A014u)

/** \brief A018, TOM4 Channel 0 Status Register */
#define GTM_TOM4_CH0_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A018u)

/** \brief A01C, TOM4 Channel 0 Interrupt Notification Register */
#define GTM_TOM4_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A01Cu)

/** \brief A020, TOM4 Channel 0 Interrupt Enable Register */
#define GTM_TOM4_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A020u)

/** \brief A024, TOM4 Channel 0 Force Interrupt Register */
#define GTM_TOM4_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A024u)

/** \brief A028, TOM4 Channel 0 Interrupt Mode Register */
#define GTM_TOM4_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A028u)

/** \brief A030, TOM4 TGC0 Global Control Register */
#define GTM_TOM4_TGC0_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_GLB_CTRL*)0xF010A030u)

/** \brief A034, TOM4 TGC0 Action Time Base Register */
#define GTM_TOM4_TGC0_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ACT_TB*)0xF010A034u)

/** \brief A038, TOM4 TGC0 Force Update Control Register */
#define GTM_TOM4_TGC0_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_FUPD_CTRL*)0xF010A038u)

/** \brief A03C, TOM4 TGC0 Internal Trigger Control Register */
#define GTM_TOM4_TGC0_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_INT_TRIG*)0xF010A03Cu)

/** \brief A040, TOM4 Channel 1 Control Register */
#define GTM_TOM4_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A040u)

/** \brief A044, TOM4 Channel 1 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH1_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A044u)

/** \brief A048, TOM4 Channel 1 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH1_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A048u)

/** \brief A04C, TOM4 Channel 1 CCU0 Compare Register */
#define GTM_TOM4_CH1_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A04Cu)

/** \brief A050, TOM4 Channel 1 CCU1 Compare Register */
#define GTM_TOM4_CH1_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A050u)

/** \brief A054, TOM4 Channel 1 CCU0 Counter Register */
#define GTM_TOM4_CH1_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A054u)

/** \brief A058, TOM4 Channel 1 Status Register */
#define GTM_TOM4_CH1_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A058u)

/** \brief A05C, TOM4 Channel 1 Interrupt Notification Register */
#define GTM_TOM4_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A05Cu)

/** \brief A060, TOM4 Channel 1 Interrupt Enable Register */
#define GTM_TOM4_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A060u)

/** \brief A064, TOM4 Channel 1 Force Interrupt Register */
#define GTM_TOM4_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A064u)

/** \brief A068, TOM4 Channel 1 Interrupt Mode Register */
#define GTM_TOM4_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A068u)

/** \brief A070, TOM4 TGC0 Enable/Disable Control Register */
#define GTM_TOM4_TGC0_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_CTRL*)0xF010A070u)

/** \brief A074, TOM4 TGC0 Enable/Disable Status Register */
#define GTM_TOM4_TGC0_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_STAT*)0xF010A074u)

/** \brief A078, TOM4 TGC0 Output Enable Control Register */
#define GTM_TOM4_TGC0_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_CTRL*)0xF010A078u)

/** \brief A07C, TOM4 TGC0 Output Enable Status Register */
#define GTM_TOM4_TGC0_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_STAT*)0xF010A07Cu)

/** \brief A080, TOM4 Channel 2 Control Register */
#define GTM_TOM4_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A080u)

