zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief A8E0, TOM5 Channel 3 Interrupt Enable Register */
#define GTM_TOM5_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A8E0u)

/** \brief A8E4, TOM5 Channel 3 Force Interrupt Register */
#define GTM_TOM5_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A8E4u)

/** \brief A8E8, TOM5 Channel 3 Interrupt Mode Register */
#define GTM_TOM5_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A8E8u)

/** \brief A900, TOM5 Channel 4 Control Register */
#define GTM_TOM5_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A900u)

/** \brief A904, TOM5 Channel 4 CCU0 Compare Shadow Register */
#define GTM_TOM5_CH4_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A904u)

/** \brief A908, TOM5 Channel 4 CCU1 Compare Shadow Register */
#define GTM_TOM5_CH4_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A908u)

/** \brief A90C, TOM5 Channel 4 CCU0 Compare Register */
#define GTM_TOM5_CH4_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A90Cu)

/** \brief A910, TOM5 Channel 4 CCU1 Compare Register */
#define GTM_TOM5_CH4_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A910u)

/** \brief A914, TOM5 Channel 4 CCU0 Counter Register */
#define GTM_TOM5_CH4_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A914u)

/** \brief A918, TOM5 Channel 4 Status Register */
#define GTM_TOM5_CH4_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A918u)

/** \brief A91C, TOM5 Channel 4 Interrupt Notification Register */
#define GTM_TOM5_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A91Cu)

/** \brief A920, TOM5 Channel 4 Interrupt Enable Register */
#define GTM_TOM5_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A920u)

/** \brief A924, TOM5 Channel 4 Force Interrupt Register */
#define GTM_TOM5_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A924u)

/** \brief A928, TOM5 Channel 4 Interrupt Mode Register */
#define GTM_TOM5_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A928u)

/** \brief A940, TOM5 Channel 5 Control Register */
#define GTM_TOM5_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A940u)

/** \brief A944, TOM5 Channel 5 CCU0 Compare Shadow Register */
#define GTM_TOM5_CH5_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A944u)

/** \brief A948, TOM5 Channel 5 CCU1 Compare Shadow Register */
#define GTM_TOM5_CH5_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A948u)

/** \brief A94C, TOM5 Channel 5 CCU0 Compare Register */
#define GTM_TOM5_CH5_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A94Cu)

/** \brief A950, TOM5 Channel 5 CCU1 Compare Register */
#define GTM_TOM5_CH5_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A950u)

/** \brief A954, TOM5 Channel 5 CCU0 Counter Register */
#define GTM_TOM5_CH5_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A954u)

/** \brief A958, TOM5 Channel 5 Status Register */
#define GTM_TOM5_CH5_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A958u)

/** \brief A95C, TOM5 Channel 5 Interrupt Notification Register */
#define GTM_TOM5_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A95Cu)

/** \brief A960, TOM5 Channel 5 Interrupt Enable Register */
#define GTM_TOM5_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A960u)

/** \brief A964, TOM5 Channel 5 Force Interrupt Register */
#define GTM_TOM5_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A964u)

/** \brief A968, TOM5 Channel 5 Interrupt Mode Register */
#define GTM_TOM5_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A968u)

/** \brief A980, TOM5 Channel 6 Control Register */
#define GTM_TOM5_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A980u)

/** \brief A984, TOM5 Channel 6 CCU0 Compare Shadow Register */
#define GTM_TOM5_CH6_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A984u)

/** \brief A988, TOM5 Channel 6 CCU1 Compare Shadow Register */
#define GTM_TOM5_CH6_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A988u)

/** \brief A98C, TOM5 Channel 6 CCU0 Compare Register */
#define GTM_TOM5_CH6_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A98Cu)

/** \brief A990, TOM5 Channel 6 CCU1 Compare Register */
#define GTM_TOM5_CH6_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A990u)

/** \brief A994, TOM5 Channel 6 CCU0 Counter Register */
#define GTM_TOM5_CH6_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A994u)

/** \brief A998, TOM5 Channel 6 Status Register */
#define GTM_TOM5_CH6_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A998u)

/** \brief A99C, TOM5 Channel 6 Interrupt Notification Register */
#define GTM_TOM5_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A99Cu)

/** \brief A9A0, TOM5 Channel 6 Interrupt Enable Register */
#define GTM_TOM5_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A9A0u)

/** \brief A9A4, TOM5 Channel 6 Force Interrupt Register */
#define GTM_TOM5_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A9A4u)

/** \brief A9A8, TOM5 Channel 6 Interrupt Mode Register */
#define GTM_TOM5_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A9A8u)

/** \brief A9C0, TOM5 Channel 7 Control Register */
#define GTM_TOM5_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A9C0u)

/** \brief A9C4, TOM5 Channel 7 CCU0 Compare Shadow Register */
#define GTM_TOM5_CH7_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A9C4u)

/** \brief A9C8, TOM5 Channel 7 CCU1 Compare Shadow Register */
#define GTM_TOM5_CH7_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A9C8u)

/** \brief A9CC, TOM5 Channel 7 CCU0 Compare Register */
#define GTM_TOM5_CH7_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A9CCu)

/** \brief A9D0, TOM5 Channel 7 CCU1 Compare Register */
#define GTM_TOM5_CH7_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A9D0u)

