zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 1C410, FIFO1 Channel 0 Lower Watermark Register */
#define GTM_PSM1_FIFO_CH0_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF011C410u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_LOWER_WM.
*/
#define GTM_FIFO1_CH0_LOWER_WM (GTM_PSM1_FIFO_CH0_LOWER_WM)

/** \brief 1C414, FIFO1 Channel 0 Status Register */
#define GTM_PSM1_FIFO_CH0_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF011C414u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_STATUS.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_STATUS.
*/
#define GTM_FIFO1_CH0_STATUS (GTM_PSM1_FIFO_CH0_STATUS)

/** \brief 1C418, FIFO1 Channel 0 Fill Level Register */
#define GTM_PSM1_FIFO_CH0_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF011C418u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_FILL_LEVEL.
*/
#define GTM_FIFO1_CH0_FILL_LEVEL (GTM_PSM1_FIFO_CH0_FILL_LEVEL)

/** \brief 1C41C, FIFO1 Channel 0 Write Pointer Register */
#define GTM_PSM1_FIFO_CH0_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF011C41Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_WR_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_WR_PTR.
*/
#define GTM_FIFO1_CH0_WR_PTR (GTM_PSM1_FIFO_CH0_WR_PTR)

/** \brief 1C420, FIFO1 Channel 0 Read Pointer Register */
#define GTM_PSM1_FIFO_CH0_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF011C420u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_RD_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_RD_PTR.
*/
#define GTM_FIFO1_CH0_RD_PTR (GTM_PSM1_FIFO_CH0_RD_PTR)

/** \brief 1C424, FIFO1 Channel 0 Interrupt Notification Register */
#define GTM_PSM1_FIFO_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF011C424u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_IRQ_NOTIFY.
*/
#define GTM_FIFO1_CH0_IRQ_NOTIFY (GTM_PSM1_FIFO_CH0_IRQ_NOTIFY)

/** \brief 1C428, FIFO1 Channel 0 Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF011C428u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_IRQ_EN.
*/
#define GTM_FIFO1_CH0_IRQ_EN (GTM_PSM1_FIFO_CH0_IRQ_EN)

/** \brief 1C42C, FIFO1 Channel 0 Force Interrupt Register */
#define GTM_PSM1_FIFO_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF011C42Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_IRQ_FORCINT.
*/
#define GTM_FIFO1_CH0_IRQ_FORCINT (GTM_PSM1_FIFO_CH0_IRQ_FORCINT)

/** \brief 1C430, FIFO1 Channel 0 Interrupt Mode Control Register */
#define GTM_PSM1_FIFO_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF011C430u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_IRQ_MODE.
*/
#define GTM_FIFO1_CH0_IRQ_MODE (GTM_PSM1_FIFO_CH0_IRQ_MODE)

/** \brief 1C434, FIFO1 Channel 0 Error Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF011C434u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH0_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH0_EIRQ_EN.
*/
#define GTM_FIFO1_CH0_EIRQ_EN (GTM_PSM1_FIFO_CH0_EIRQ_EN)

/** \brief 1C440, FIFO1 Channel 1 Control Register */
#define GTM_PSM1_FIFO_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF011C440u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_CTRL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_CTRL.
*/
#define GTM_FIFO1_CH1_CTRL (GTM_PSM1_FIFO_CH1_CTRL)

/** \brief 1C444, FIFO1 Channel 1 End Address Register */
#define GTM_PSM1_FIFO_CH1_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF011C444u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_END_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_END_ADDR.
*/
#define GTM_FIFO1_CH1_END_ADDR (GTM_PSM1_FIFO_CH1_END_ADDR)

/** \brief 1C448, FIFO1 Channel 1 Start Address Register */
#define GTM_PSM1_FIFO_CH1_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF011C448u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_START_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_START_ADDR.
*/
#define GTM_FIFO1_CH1_START_ADDR (GTM_PSM1_FIFO_CH1_START_ADDR)

/** \brief 1C44C, FIFO1 Channel 1 Upper Watermark Register */
#define GTM_PSM1_FIFO_CH1_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF011C44Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_UPPER_WM.
*/
#define GTM_FIFO1_CH1_UPPER_WM (GTM_PSM1_FIFO_CH1_UPPER_WM)

/** \brief 1C450, FIFO1 Channel 1 Lower Watermark Register */
#define GTM_PSM1_FIFO_CH1_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF011C450u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_LOWER_WM.
*/
#define GTM_FIFO1_CH1_LOWER_WM (GTM_PSM1_FIFO_CH1_LOWER_WM)

/** \brief 1C454, FIFO1 Channel 1 Status Register */
#define GTM_PSM1_FIFO_CH1_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF011C454u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_STATUS.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_STATUS.
*/
#define GTM_FIFO1_CH1_STATUS (GTM_PSM1_FIFO_CH1_STATUS)

/** \brief 1C458, FIFO1 Channel 1 Fill Level Register */
#define GTM_PSM1_FIFO_CH1_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF011C458u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_FILL_LEVEL.
*/
#define GTM_FIFO1_CH1_FILL_LEVEL (GTM_PSM1_FIFO_CH1_FILL_LEVEL)

/** \brief 1C45C, FIFO1 Channel 1 Write Pointer Register */
#define GTM_PSM1_FIFO_CH1_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF011C45Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_WR_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_WR_PTR.
*/
#define GTM_FIFO1_CH1_WR_PTR (GTM_PSM1_FIFO_CH1_WR_PTR)

/** \brief 1C460, FIFO1 Channel 1 Read Pointer Register */
#define GTM_PSM1_FIFO_CH1_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF011C460u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH1_RD_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH1_RD_PTR.
*/
#define GTM_FIFO1_CH1_RD_PTR (GTM_PSM1_FIFO_CH1_RD_PTR)

