zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 1C5C8, FIFO1 Channel 7 Start Address Register */
#define GTM_PSM1_FIFO_CH7_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF011C5C8u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_START_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_START_ADDR.
*/
#define GTM_FIFO1_CH7_START_ADDR (GTM_PSM1_FIFO_CH7_START_ADDR)

/** \brief 1C5CC, FIFO1 Channel 7 Upper Watermark Register */
#define GTM_PSM1_FIFO_CH7_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF011C5CCu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_UPPER_WM.
*/
#define GTM_FIFO1_CH7_UPPER_WM (GTM_PSM1_FIFO_CH7_UPPER_WM)

/** \brief 1C5D0, FIFO1 Channel 7 Lower Watermark Register */
#define GTM_PSM1_FIFO_CH7_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF011C5D0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_LOWER_WM.
*/
#define GTM_FIFO1_CH7_LOWER_WM (GTM_PSM1_FIFO_CH7_LOWER_WM)

/** \brief 1C5D4, FIFO1 Channel 7 Status Register */
#define GTM_PSM1_FIFO_CH7_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF011C5D4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_STATUS.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_STATUS.
*/
#define GTM_FIFO1_CH7_STATUS (GTM_PSM1_FIFO_CH7_STATUS)

/** \brief 1C5D8, FIFO1 Channel 7 Fill Level Register */
#define GTM_PSM1_FIFO_CH7_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF011C5D8u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_FILL_LEVEL.
*/
#define GTM_FIFO1_CH7_FILL_LEVEL (GTM_PSM1_FIFO_CH7_FILL_LEVEL)

/** \brief 1C5DC, FIFO1 Channel 7 Write Pointer Register */
#define GTM_PSM1_FIFO_CH7_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF011C5DCu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_WR_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_WR_PTR.
*/
#define GTM_FIFO1_CH7_WR_PTR (GTM_PSM1_FIFO_CH7_WR_PTR)

/** \brief 1C5E0, FIFO1 Channel 7 Read Pointer Register */
#define GTM_PSM1_FIFO_CH7_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF011C5E0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_RD_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_RD_PTR.
*/
#define GTM_FIFO1_CH7_RD_PTR (GTM_PSM1_FIFO_CH7_RD_PTR)

/** \brief 1C5E4, FIFO1 Channel 7 Interrupt Notification Register */
#define GTM_PSM1_FIFO_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF011C5E4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_IRQ_NOTIFY.
*/
#define GTM_FIFO1_CH7_IRQ_NOTIFY (GTM_PSM1_FIFO_CH7_IRQ_NOTIFY)

/** \brief 1C5E8, FIFO1 Channel 7 Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF011C5E8u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_IRQ_EN.
*/
#define GTM_FIFO1_CH7_IRQ_EN (GTM_PSM1_FIFO_CH7_IRQ_EN)

/** \brief 1C5EC, FIFO1 Channel 7 Force Interrupt Register */
#define GTM_PSM1_FIFO_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF011C5ECu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_IRQ_FORCINT.
*/
#define GTM_FIFO1_CH7_IRQ_FORCINT (GTM_PSM1_FIFO_CH7_IRQ_FORCINT)

/** \brief 1C5F0, FIFO1 Channel 7 Interrupt Mode Control Register */
#define GTM_PSM1_FIFO_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF011C5F0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_IRQ_MODE.
*/
#define GTM_FIFO1_CH7_IRQ_MODE (GTM_PSM1_FIFO_CH7_IRQ_MODE)

/** \brief 1C5F4, FIFO1 Channel 7 Error Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH7_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF011C5F4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_EIRQ_EN.
*/
#define GTM_FIFO1_CH7_EIRQ_EN (GTM_PSM1_FIFO_CH7_EIRQ_EN)

/** \brief 20000, F2A2 Stream 0 Read Address Register */
#define GTM_PSM2_F2A_RD_CH0_ARU_RD_FIFO /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO*)0xF0120000u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_RD_CH0_ARU_RD_FIFO.
* To use register names with standard convension, please use GTM_PSM2_F2A_RD_CH0_ARU_RD_FIFO.
*/
#define GTM_F2A2_CH0_ARU_RD_FIFO (GTM_PSM2_F2A_RD_CH0_ARU_RD_FIFO)

/** \brief 20004, F2A2 Stream 1 Read Address Register */
#define GTM_PSM2_F2A_RD_CH1_ARU_RD_FIFO /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO*)0xF0120004u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_RD_CH1_ARU_RD_FIFO.
* To use register names with standard convension, please use GTM_PSM2_F2A_RD_CH1_ARU_RD_FIFO.
*/
#define GTM_F2A2_CH1_ARU_RD_FIFO (GTM_PSM2_F2A_RD_CH1_ARU_RD_FIFO)

/** \brief 20008, F2A2 Stream 2 Read Address Register */
#define GTM_PSM2_F2A_RD_CH2_ARU_RD_FIFO /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO*)0xF0120008u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_RD_CH2_ARU_RD_FIFO.
* To use register names with standard convension, please use GTM_PSM2_F2A_RD_CH2_ARU_RD_FIFO.
*/
#define GTM_F2A2_CH2_ARU_RD_FIFO (GTM_PSM2_F2A_RD_CH2_ARU_RD_FIFO)

/** \brief 2000C, F2A2 Stream 3 Read Address Register */
#define GTM_PSM2_F2A_RD_CH3_ARU_RD_FIFO /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO*)0xF012000Cu)
/** Alias (User Manual Name) for GTM_PSM2_F2A_RD_CH3_ARU_RD_FIFO.
* To use register names with standard convension, please use GTM_PSM2_F2A_RD_CH3_ARU_RD_FIFO.
*/
#define GTM_F2A2_CH3_ARU_RD_FIFO (GTM_PSM2_F2A_RD_CH3_ARU_RD_FIFO)

