zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 200B0, AFD 2 FIFO 3 Buffer Access Register */
#define GTM_PSM2_AFD_CH3_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF01200B0u)
/** Alias (User Manual Name) for GTM_PSM2_AFD_CH3_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM2_AFD_CH3_BUF_ACC.
*/
#define GTM_AFD2_CH3_BUF_ACC (GTM_PSM2_AFD_CH3_BUF_ACC)

/** \brief 200C0, AFD 2 FIFO 4 Buffer Access Register */
#define GTM_PSM2_AFD_CH4_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF01200C0u)
/** Alias (User Manual Name) for GTM_PSM2_AFD_CH4_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM2_AFD_CH4_BUF_ACC.
*/
#define GTM_AFD2_CH4_BUF_ACC (GTM_PSM2_AFD_CH4_BUF_ACC)

/** \brief 200D0, AFD 2 FIFO 5 Buffer Access Register */
#define GTM_PSM2_AFD_CH5_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF01200D0u)
/** Alias (User Manual Name) for GTM_PSM2_AFD_CH5_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM2_AFD_CH5_BUF_ACC.
*/
#define GTM_AFD2_CH5_BUF_ACC (GTM_PSM2_AFD_CH5_BUF_ACC)

/** \brief 200E0, AFD 2 FIFO 6 Buffer Access Register */
#define GTM_PSM2_AFD_CH6_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF01200E0u)
/** Alias (User Manual Name) for GTM_PSM2_AFD_CH6_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM2_AFD_CH6_BUF_ACC.
*/
#define GTM_AFD2_CH6_BUF_ACC (GTM_PSM2_AFD_CH6_BUF_ACC)

/** \brief 200F0, AFD 2 FIFO 7 Buffer Access Register */
#define GTM_PSM2_AFD_CH7_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF01200F0u)
/** Alias (User Manual Name) for GTM_PSM2_AFD_CH7_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM2_AFD_CH7_BUF_ACC.
*/
#define GTM_AFD2_CH7_BUF_ACC (GTM_PSM2_AFD_CH7_BUF_ACC)

/** \brief 20400, FIFO2 Channel 0 Control Register */
#define GTM_PSM2_FIFO_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF0120400u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_CTRL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_CTRL.
*/
#define GTM_FIFO2_CH0_CTRL (GTM_PSM2_FIFO_CH0_CTRL)

/** \brief 20404, FIFO2 Channel 0 End Address Register */
#define GTM_PSM2_FIFO_CH0_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF0120404u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_END_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_END_ADDR.
*/
#define GTM_FIFO2_CH0_END_ADDR (GTM_PSM2_FIFO_CH0_END_ADDR)

/** \brief 20408, FIFO2 Channel 0 Start Address Register */
#define GTM_PSM2_FIFO_CH0_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF0120408u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_START_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_START_ADDR.
*/
#define GTM_FIFO2_CH0_START_ADDR (GTM_PSM2_FIFO_CH0_START_ADDR)

/** \brief 2040C, FIFO2 Channel 0 Upper Watermark Register */
#define GTM_PSM2_FIFO_CH0_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF012040Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_UPPER_WM.
*/
#define GTM_FIFO2_CH0_UPPER_WM (GTM_PSM2_FIFO_CH0_UPPER_WM)

/** \brief 20410, FIFO2 Channel 0 Lower Watermark Register */
#define GTM_PSM2_FIFO_CH0_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF0120410u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_LOWER_WM.
*/
#define GTM_FIFO2_CH0_LOWER_WM (GTM_PSM2_FIFO_CH0_LOWER_WM)

/** \brief 20414, FIFO2 Channel 0 Status Register */
#define GTM_PSM2_FIFO_CH0_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF0120414u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_STATUS.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_STATUS.
*/
#define GTM_FIFO2_CH0_STATUS (GTM_PSM2_FIFO_CH0_STATUS)

/** \brief 20418, FIFO2 Channel 0 Fill Level Register */
#define GTM_PSM2_FIFO_CH0_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF0120418u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_FILL_LEVEL.
*/
#define GTM_FIFO2_CH0_FILL_LEVEL (GTM_PSM2_FIFO_CH0_FILL_LEVEL)

/** \brief 2041C, FIFO2 Channel 0 Write Pointer Register */
#define GTM_PSM2_FIFO_CH0_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF012041Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_WR_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_WR_PTR.
*/
#define GTM_FIFO2_CH0_WR_PTR (GTM_PSM2_FIFO_CH0_WR_PTR)

/** \brief 20420, FIFO2 Channel 0 Read Pointer Register */
#define GTM_PSM2_FIFO_CH0_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF0120420u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_RD_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_RD_PTR.
*/
#define GTM_FIFO2_CH0_RD_PTR (GTM_PSM2_FIFO_CH0_RD_PTR)

/** \brief 20424, FIFO2 Channel 0 Interrupt Notification Register */
#define GTM_PSM2_FIFO_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF0120424u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_IRQ_NOTIFY.
*/
#define GTM_FIFO2_CH0_IRQ_NOTIFY (GTM_PSM2_FIFO_CH0_IRQ_NOTIFY)

/** \brief 20428, FIFO2 Channel 0 Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF0120428u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_IRQ_EN.
*/
#define GTM_FIFO2_CH0_IRQ_EN (GTM_PSM2_FIFO_CH0_IRQ_EN)

