zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 2042C, FIFO2 Channel 0 Force Interrupt Register */
#define GTM_PSM2_FIFO_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF012042Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_IRQ_FORCINT.
*/
#define GTM_FIFO2_CH0_IRQ_FORCINT (GTM_PSM2_FIFO_CH0_IRQ_FORCINT)

/** \brief 20430, FIFO2 Channel 0 Interrupt Mode Control Register */
#define GTM_PSM2_FIFO_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF0120430u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_IRQ_MODE.
*/
#define GTM_FIFO2_CH0_IRQ_MODE (GTM_PSM2_FIFO_CH0_IRQ_MODE)

/** \brief 20434, FIFO2 Channel 0 Error Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF0120434u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH0_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH0_EIRQ_EN.
*/
#define GTM_FIFO2_CH0_EIRQ_EN (GTM_PSM2_FIFO_CH0_EIRQ_EN)

/** \brief 20440, FIFO2 Channel 1 Control Register */
#define GTM_PSM2_FIFO_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF0120440u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_CTRL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_CTRL.
*/
#define GTM_FIFO2_CH1_CTRL (GTM_PSM2_FIFO_CH1_CTRL)

/** \brief 20444, FIFO2 Channel 1 End Address Register */
#define GTM_PSM2_FIFO_CH1_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF0120444u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_END_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_END_ADDR.
*/
#define GTM_FIFO2_CH1_END_ADDR (GTM_PSM2_FIFO_CH1_END_ADDR)

/** \brief 20448, FIFO2 Channel 1 Start Address Register */
#define GTM_PSM2_FIFO_CH1_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF0120448u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_START_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_START_ADDR.
*/
#define GTM_FIFO2_CH1_START_ADDR (GTM_PSM2_FIFO_CH1_START_ADDR)

/** \brief 2044C, FIFO2 Channel 1 Upper Watermark Register */
#define GTM_PSM2_FIFO_CH1_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF012044Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_UPPER_WM.
*/
#define GTM_FIFO2_CH1_UPPER_WM (GTM_PSM2_FIFO_CH1_UPPER_WM)

/** \brief 20450, FIFO2 Channel 1 Lower Watermark Register */
#define GTM_PSM2_FIFO_CH1_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF0120450u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_LOWER_WM.
*/
#define GTM_FIFO2_CH1_LOWER_WM (GTM_PSM2_FIFO_CH1_LOWER_WM)

/** \brief 20454, FIFO2 Channel 1 Status Register */
#define GTM_PSM2_FIFO_CH1_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF0120454u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_STATUS.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_STATUS.
*/
#define GTM_FIFO2_CH1_STATUS (GTM_PSM2_FIFO_CH1_STATUS)

/** \brief 20458, FIFO2 Channel 1 Fill Level Register */
#define GTM_PSM2_FIFO_CH1_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF0120458u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_FILL_LEVEL.
*/
#define GTM_FIFO2_CH1_FILL_LEVEL (GTM_PSM2_FIFO_CH1_FILL_LEVEL)

/** \brief 2045C, FIFO2 Channel 1 Write Pointer Register */
#define GTM_PSM2_FIFO_CH1_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF012045Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_WR_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_WR_PTR.
*/
#define GTM_FIFO2_CH1_WR_PTR (GTM_PSM2_FIFO_CH1_WR_PTR)

/** \brief 20460, FIFO2 Channel 1 Read Pointer Register */
#define GTM_PSM2_FIFO_CH1_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF0120460u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_RD_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_RD_PTR.
*/
#define GTM_FIFO2_CH1_RD_PTR (GTM_PSM2_FIFO_CH1_RD_PTR)

/** \brief 20464, FIFO2 Channel 1 Interrupt Notification Register */
#define GTM_PSM2_FIFO_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF0120464u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_IRQ_NOTIFY.
*/
#define GTM_FIFO2_CH1_IRQ_NOTIFY (GTM_PSM2_FIFO_CH1_IRQ_NOTIFY)

/** \brief 20468, FIFO2 Channel 1 Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF0120468u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_IRQ_EN.
*/
#define GTM_FIFO2_CH1_IRQ_EN (GTM_PSM2_FIFO_CH1_IRQ_EN)

/** \brief 2046C, FIFO2 Channel 1 Force Interrupt Register */
#define GTM_PSM2_FIFO_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF012046Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_IRQ_FORCINT.
*/
#define GTM_FIFO2_CH1_IRQ_FORCINT (GTM_PSM2_FIFO_CH1_IRQ_FORCINT)

/** \brief 20470, FIFO2 Channel 1 Interrupt Mode Control Register */
#define GTM_PSM2_FIFO_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF0120470u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_IRQ_MODE.
*/
#define GTM_FIFO2_CH1_IRQ_MODE (GTM_PSM2_FIFO_CH1_IRQ_MODE)

/** \brief 20474, FIFO2 Channel 1 Error Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF0120474u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH1_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH1_EIRQ_EN.
*/
#define GTM_FIFO2_CH1_EIRQ_EN (GTM_PSM2_FIFO_CH1_EIRQ_EN)

/** \brief 20480, FIFO2 Channel 2 Control Register */
#define GTM_PSM2_FIFO_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF0120480u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_CTRL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_CTRL.
*/
#define GTM_FIFO2_CH2_CTRL (GTM_PSM2_FIFO_CH2_CTRL)

