zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 20530, FIFO2 Channel 4 Interrupt Mode Control Register */
#define GTM_PSM2_FIFO_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF0120530u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_IRQ_MODE.
*/
#define GTM_FIFO2_CH4_IRQ_MODE (GTM_PSM2_FIFO_CH4_IRQ_MODE)

/** \brief 20534, FIFO2 Channel 4 Error Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF0120534u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_EIRQ_EN.
*/
#define GTM_FIFO2_CH4_EIRQ_EN (GTM_PSM2_FIFO_CH4_EIRQ_EN)

/** \brief 20540, FIFO2 Channel 5 Control Register */
#define GTM_PSM2_FIFO_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF0120540u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_CTRL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_CTRL.
*/
#define GTM_FIFO2_CH5_CTRL (GTM_PSM2_FIFO_CH5_CTRL)

/** \brief 20544, FIFO2 Channel 5 End Address Register */
#define GTM_PSM2_FIFO_CH5_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF0120544u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_END_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_END_ADDR.
*/
#define GTM_FIFO2_CH5_END_ADDR (GTM_PSM2_FIFO_CH5_END_ADDR)

/** \brief 20548, FIFO2 Channel 5 Start Address Register */
#define GTM_PSM2_FIFO_CH5_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF0120548u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_START_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_START_ADDR.
*/
#define GTM_FIFO2_CH5_START_ADDR (GTM_PSM2_FIFO_CH5_START_ADDR)

/** \brief 2054C, FIFO2 Channel 5 Upper Watermark Register */
#define GTM_PSM2_FIFO_CH5_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF012054Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_UPPER_WM.
*/
#define GTM_FIFO2_CH5_UPPER_WM (GTM_PSM2_FIFO_CH5_UPPER_WM)

/** \brief 20550, FIFO2 Channel 5 Lower Watermark Register */
#define GTM_PSM2_FIFO_CH5_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF0120550u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_LOWER_WM.
*/
#define GTM_FIFO2_CH5_LOWER_WM (GTM_PSM2_FIFO_CH5_LOWER_WM)

/** \brief 20554, FIFO2 Channel 5 Status Register */
#define GTM_PSM2_FIFO_CH5_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF0120554u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_STATUS.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_STATUS.
*/
#define GTM_FIFO2_CH5_STATUS (GTM_PSM2_FIFO_CH5_STATUS)

/** \brief 20558, FIFO2 Channel 5 Fill Level Register */
#define GTM_PSM2_FIFO_CH5_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF0120558u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_FILL_LEVEL.
*/
#define GTM_FIFO2_CH5_FILL_LEVEL (GTM_PSM2_FIFO_CH5_FILL_LEVEL)

/** \brief 2055C, FIFO2 Channel 5 Write Pointer Register */
#define GTM_PSM2_FIFO_CH5_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF012055Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_WR_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_WR_PTR.
*/
#define GTM_FIFO2_CH5_WR_PTR (GTM_PSM2_FIFO_CH5_WR_PTR)

/** \brief 20560, FIFO2 Channel 5 Read Pointer Register */
#define GTM_PSM2_FIFO_CH5_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF0120560u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_RD_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_RD_PTR.
*/
#define GTM_FIFO2_CH5_RD_PTR (GTM_PSM2_FIFO_CH5_RD_PTR)

/** \brief 20564, FIFO2 Channel 5 Interrupt Notification Register */
#define GTM_PSM2_FIFO_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF0120564u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_IRQ_NOTIFY.
*/
#define GTM_FIFO2_CH5_IRQ_NOTIFY (GTM_PSM2_FIFO_CH5_IRQ_NOTIFY)

/** \brief 20568, FIFO2 Channel 5 Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF0120568u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_IRQ_EN.
*/
#define GTM_FIFO2_CH5_IRQ_EN (GTM_PSM2_FIFO_CH5_IRQ_EN)

/** \brief 2056C, FIFO2 Channel 5 Force Interrupt Register */
#define GTM_PSM2_FIFO_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF012056Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_IRQ_FORCINT.
*/
#define GTM_FIFO2_CH5_IRQ_FORCINT (GTM_PSM2_FIFO_CH5_IRQ_FORCINT)

/** \brief 20570, FIFO2 Channel 5 Interrupt Mode Control Register */
#define GTM_PSM2_FIFO_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF0120570u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_IRQ_MODE.
*/
#define GTM_FIFO2_CH5_IRQ_MODE (GTM_PSM2_FIFO_CH5_IRQ_MODE)

/** \brief 20574, FIFO2 Channel 5 Error Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH5_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF0120574u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH5_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH5_EIRQ_EN.
*/
#define GTM_FIFO2_CH5_EIRQ_EN (GTM_PSM2_FIFO_CH5_EIRQ_EN)

/** \brief 20580, FIFO2 Channel 6 Control Register */
#define GTM_PSM2_FIFO_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF0120580u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_CTRL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_CTRL.
*/
#define GTM_FIFO2_CH6_CTRL (GTM_PSM2_FIFO_CH6_CTRL)

/** \brief 20584, FIFO2 Channel 6 End Address Register */
#define GTM_PSM2_FIFO_CH6_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF0120584u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_END_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_END_ADDR.
*/
#define GTM_FIFO2_CH6_END_ADDR (GTM_PSM2_FIFO_CH6_END_ADDR)

/** \brief 20588, FIFO2 Channel 6 Start Address Register */
#define GTM_PSM2_FIFO_CH6_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF0120588u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_START_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_START_ADDR.
*/
#define GTM_FIFO2_CH6_START_ADDR (GTM_PSM2_FIFO_CH6_START_ADDR)

/** \brief 2058C, FIFO2 Channel 6 Upper Watermark Register */
#define GTM_PSM2_FIFO_CH6_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF012058Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_UPPER_WM.
*/
#define GTM_FIFO2_CH6_UPPER_WM (GTM_PSM2_FIFO_CH6_UPPER_WM)

/** \brief 20590, FIFO2 Channel 6 Lower Watermark Register */
#define GTM_PSM2_FIFO_CH6_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF0120590u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_LOWER_WM.
*/
#define GTM_FIFO2_CH6_LOWER_WM (GTM_PSM2_FIFO_CH6_LOWER_WM)

/** \brief 20594, FIFO2 Channel 6 Status Register */
#define GTM_PSM2_FIFO_CH6_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF0120594u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_STATUS.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_STATUS.
*/
#define GTM_FIFO2_CH6_STATUS (GTM_PSM2_FIFO_CH6_STATUS)

/** \brief 20598, FIFO2 Channel 6 Fill Level Register */
#define GTM_PSM2_FIFO_CH6_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF0120598u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_FILL_LEVEL.
*/
#define GTM_FIFO2_CH6_FILL_LEVEL (GTM_PSM2_FIFO_CH6_FILL_LEVEL)

/** \brief 2059C, FIFO2 Channel 6 Write Pointer Register */
#define GTM_PSM2_FIFO_CH6_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF012059Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_WR_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_WR_PTR.
*/
#define GTM_FIFO2_CH6_WR_PTR (GTM_PSM2_FIFO_CH6_WR_PTR)

/** \brief 205A0, FIFO2 Channel 6 Read Pointer Register */
#define GTM_PSM2_FIFO_CH6_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF01205A0u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_RD_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_RD_PTR.
*/
#define GTM_FIFO2_CH6_RD_PTR (GTM_PSM2_FIFO_CH6_RD_PTR)

