zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 9FD4C, TIM3 Input Select Register */
#define GTM_TIMINSEL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIMINSEL*)0xF019FD4Cu)
/** Alias (User Manual Name) for GTM_TIMINSEL3.
* To use register names with standard convension, please use GTM_TIMINSEL3.
*/
#define GTM_TIM3INSEL (GTM_TIMINSEL3)

/** \brief 9FD50, TIM4 Input Select Register */
#define GTM_TIMINSEL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIMINSEL*)0xF019FD50u)
/** Alias (User Manual Name) for GTM_TIMINSEL4.
* To use register names with standard convension, please use GTM_TIMINSEL4.
*/
#define GTM_TIM4INSEL (GTM_TIMINSEL4)

/** \brief 9FD54, TIM5 Input Select Register */
#define GTM_TIMINSEL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIMINSEL*)0xF019FD54u)
/** Alias (User Manual Name) for GTM_TIMINSEL5.
* To use register names with standard convension, please use GTM_TIMINSEL5.
*/
#define GTM_TIM5INSEL (GTM_TIMINSEL5)

/** \brief 9FD58, TIM6 Input Select Register */
#define GTM_TIMINSEL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIMINSEL*)0xF019FD58u)
/** Alias (User Manual Name) for GTM_TIMINSEL6.
* To use register names with standard convension, please use GTM_TIMINSEL6.
*/
#define GTM_TIM6INSEL (GTM_TIMINSEL6)

/** \brief 9FD5C, TIM7 Input Select Register */
#define GTM_TIMINSEL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIMINSEL*)0xF019FD5Cu)
/** Alias (User Manual Name) for GTM_TIMINSEL7.
* To use register names with standard convension, please use GTM_TIMINSEL7.
*/
#define GTM_TIM7INSEL (GTM_TIMINSEL7)

/** \brief 9FD60, Timer Output Select Register */
#define GTM_TOUTSEL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD60u)

/** \brief 9FD64, Timer Output Select Register */
#define GTM_TOUTSEL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD64u)

/** \brief 9FD68, Timer Output Select Register */
#define GTM_TOUTSEL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD68u)

/** \brief 9FD6C, Timer Output Select Register */
#define GTM_TOUTSEL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD6Cu)

/** \brief 9FD70, Timer Output Select Register */
#define GTM_TOUTSEL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD70u)

/** \brief 9FD74, Timer Output Select Register */
#define GTM_TOUTSEL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD74u)

/** \brief 9FD78, Timer Output Select Register */
#define GTM_TOUTSEL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD78u)

/** \brief 9FD7C, Timer Output Select Register */
#define GTM_TOUTSEL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD7Cu)

/** \brief 9FD80, Timer Output Select Register */
#define GTM_TOUTSEL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD80u)

/** \brief 9FD84, Timer Output Select Register */
#define GTM_TOUTSEL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD84u)

/** \brief 9FD88, Timer Output Select Register */
#define GTM_TOUTSEL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD88u)

/** \brief 9FD8C, Timer Output Select Register */
#define GTM_TOUTSEL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD8Cu)

/** \brief 9FD90, Timer Output Select Register */
#define GTM_TOUTSEL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD90u)

/** \brief 9FD94, Timer Output Select Register */
#define GTM_TOUTSEL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD94u)

/** \brief 9FD98, Timer Output Select Register */
#define GTM_TOUTSEL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD98u)

/** \brief 9FD9C, Timer Output Select Register */
#define GTM_TOUTSEL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FD9Cu)

/** \brief 9FDA0, Timer Output Select Register */
#define GTM_TOUTSEL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDA0u)

/** \brief 9FDA4, Timer Output Select Register */
#define GTM_TOUTSEL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDA4u)

/** \brief 9FDA8, Timer Output Select Register */
#define GTM_TOUTSEL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDA8u)

/** \brief 9FDAC, Timer Output Select Register */
#define GTM_TOUTSEL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDACu)

/** \brief 9FDB0, Timer Output Select Register */
#define GTM_TOUTSEL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDB0u)

/** \brief 9FDB4, Timer Output Select Register */
#define GTM_TOUTSEL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDB4u)

/** \brief 9FDB8, Timer Output Select Register */
#define GTM_TOUTSEL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDB8u)

/** \brief 9FDBC, Timer Output Select Register */
#define GTM_TOUTSEL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDBCu)

/** \brief 9FDC0, Timer Output Select Register */
#define GTM_TOUTSEL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDC0u)

/** \brief 9FDC4, Timer Output Select Register */
#define GTM_TOUTSEL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDC4u)

/** \brief 9FDC8, Timer Output Select Register */
#define GTM_TOUTSEL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDC8u)

/** \brief 9FDCC, Timer Output Select Register */
#define GTM_TOUTSEL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDCCu)

/** \brief 9FDD0, Timer Output Select Register */
#define GTM_TOUTSEL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDD0u)

/** \brief 9FDD4, Timer Output Select Register */
#define GTM_TOUTSEL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDD4u)

/** \brief 9FDD8, Timer Output Select Register */
#define GTM_TOUTSEL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDD8u)

/** \brief 9FDDC, Timer Output Select Register */
#define GTM_TOUTSEL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDDCu)

/** \brief 9FDE0, Timer Output Select Register */
#define GTM_TOUTSEL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDE0u)

/** \brief 9FDE4, Timer Output Select Register */
#define GTM_TOUTSEL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOUTSEL*)0xF019FDE4u)

/** \brief 9FE00, DSADC Input Select i Register */
#define GTM_DSADCINSEL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_DSADCINSEL*)0xF019FE00u)

/** \brief 9FE04, DSADC Input Select i Register */
#define GTM_DSADCINSEL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_DSADCINSEL*)0xF019FE04u)

