zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief 9FF5C, MSC Set 5 Control 3 Register */
#define GTM_MSC_SET5_CON3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON3*)0xF019FF5Cu)
/** Alias (User Manual Name) for GTM_MSC_SET5_CON3.
* To use register names with standard convension, please use GTM_MSC_SET5_CON3.
*/
#define GTM_MSCSET5CON3 (GTM_MSC_SET5_CON3)

/** \brief 9FF60, MSC Set 6 Control 0 Register */
#define GTM_MSC_SET6_CON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON0*)0xF019FF60u)
/** Alias (User Manual Name) for GTM_MSC_SET6_CON0.
* To use register names with standard convension, please use GTM_MSC_SET6_CON0.
*/
#define GTM_MSCSET6CON0 (GTM_MSC_SET6_CON0)

/** \brief 9FF64, MSC Set 6 Control 1 Register */
#define GTM_MSC_SET6_CON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON1*)0xF019FF64u)
/** Alias (User Manual Name) for GTM_MSC_SET6_CON1.
* To use register names with standard convension, please use GTM_MSC_SET6_CON1.
*/
#define GTM_MSCSET6CON1 (GTM_MSC_SET6_CON1)

/** \brief 9FF68, MSC Set 6 Control 2 Register */
#define GTM_MSC_SET6_CON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON2*)0xF019FF68u)
/** Alias (User Manual Name) for GTM_MSC_SET6_CON2.
* To use register names with standard convension, please use GTM_MSC_SET6_CON2.
*/
#define GTM_MSCSET6CON2 (GTM_MSC_SET6_CON2)

/** \brief 9FF6C, MSC Set 6 Control 3 Register */
#define GTM_MSC_SET6_CON3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON3*)0xF019FF6Cu)
/** Alias (User Manual Name) for GTM_MSC_SET6_CON3.
* To use register names with standard convension, please use GTM_MSC_SET6_CON3.
*/
#define GTM_MSCSET6CON3 (GTM_MSC_SET6_CON3)

/** \brief 9FF70, MSC Set 7 Control 0 Register */
#define GTM_MSC_SET7_CON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON0*)0xF019FF70u)
/** Alias (User Manual Name) for GTM_MSC_SET7_CON0.
* To use register names with standard convension, please use GTM_MSC_SET7_CON0.
*/
#define GTM_MSCSET7CON0 (GTM_MSC_SET7_CON0)

/** \brief 9FF74, MSC Set 7 Control 1 Register */
#define GTM_MSC_SET7_CON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON1*)0xF019FF74u)
/** Alias (User Manual Name) for GTM_MSC_SET7_CON1.
* To use register names with standard convension, please use GTM_MSC_SET7_CON1.
*/
#define GTM_MSCSET7CON1 (GTM_MSC_SET7_CON1)

/** \brief 9FF78, MSC Set 7 Control 2 Register */
#define GTM_MSC_SET7_CON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON2*)0xF019FF78u)
/** Alias (User Manual Name) for GTM_MSC_SET7_CON2.
* To use register names with standard convension, please use GTM_MSC_SET7_CON2.
*/
#define GTM_MSCSET7CON2 (GTM_MSC_SET7_CON2)

/** \brief 9FF7C, MSC Set 7 Control 3 Register */
#define GTM_MSC_SET7_CON3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON3*)0xF019FF7Cu)
/** Alias (User Manual Name) for GTM_MSC_SET7_CON3.
* To use register names with standard convension, please use GTM_MSC_SET7_CON3.
*/
#define GTM_MSCSET7CON3 (GTM_MSC_SET7_CON3)

/** \brief 9FF80, MSC Set 8 Control 0 Register */
#define GTM_MSC_SET8_CON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON0*)0xF019FF80u)
/** Alias (User Manual Name) for GTM_MSC_SET8_CON0.
* To use register names with standard convension, please use GTM_MSC_SET8_CON0.
*/
#define GTM_MSCSET8CON0 (GTM_MSC_SET8_CON0)

/** \brief 9FF84, MSC Set 8 Control 1 Register */
#define GTM_MSC_SET8_CON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON1*)0xF019FF84u)
/** Alias (User Manual Name) for GTM_MSC_SET8_CON1.
* To use register names with standard convension, please use GTM_MSC_SET8_CON1.
*/
#define GTM_MSCSET8CON1 (GTM_MSC_SET8_CON1)

/** \brief 9FF88, MSC Set 8 Control 2 Register */
#define GTM_MSC_SET8_CON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON2*)0xF019FF88u)
/** Alias (User Manual Name) for GTM_MSC_SET8_CON2.
* To use register names with standard convension, please use GTM_MSC_SET8_CON2.
*/
#define GTM_MSCSET8CON2 (GTM_MSC_SET8_CON2)

/** \brief 9FF8C, MSC Set 8 Control 3 Register */
#define GTM_MSC_SET8_CON3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_SET_CON3*)0xF019FF8Cu)
/** Alias (User Manual Name) for GTM_MSC_SET8_CON3.
* To use register names with standard convension, please use GTM_MSC_SET8_CON3.
*/
#define GTM_MSCSET8CON3 (GTM_MSC_SET8_CON3)

/** \brief 9FF90, MSC0 Input Low Control Register */
#define GTM_MSC_MSCQ0_INLCON /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_MSCQ_INLCON*)0xF019FF90u)
/** Alias (User Manual Name) for GTM_MSC_MSCQ0_INLCON.
* To use register names with standard convension, please use GTM_MSC_MSCQ0_INLCON.
*/
#define GTM_MSC0INLCON (GTM_MSC_MSCQ0_INLCON)

/** \brief 9FF94, MSC0 Input High Control Register */
#define GTM_MSC_MSCQ0_INHCON /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_MSCQ_INHCON*)0xF019FF94u)
/** Alias (User Manual Name) for GTM_MSC_MSCQ0_INHCON.
* To use register names with standard convension, please use GTM_MSC_MSCQ0_INHCON.
*/
#define GTM_MSC0INHCON (GTM_MSC_MSCQ0_INHCON)

/** \brief 9FF98, MSC0 Input Low Extended Control Register */
#define GTM_MSC_MSCQ0_INLEXTCON /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_MSCQ_INLEXTCON*)0xF019FF98u)
/** Alias (User Manual Name) for GTM_MSC_MSCQ0_INLEXTCON.
* To use register names with standard convension, please use GTM_MSC_MSCQ0_INLEXTCON.
*/
#define GTM_MSC0INLEXTCON (GTM_MSC_MSCQ0_INLEXTCON)

/** \brief 9FF9C, MSC1 Input Low Control Register */
#define GTM_MSC_MSCQ1_INLCON /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_MSCQ_INLCON*)0xF019FF9Cu)
/** Alias (User Manual Name) for GTM_MSC_MSCQ1_INLCON.
* To use register names with standard convension, please use GTM_MSC_MSCQ1_INLCON.
*/
#define GTM_MSC1INLCON (GTM_MSC_MSCQ1_INLCON)

/** \brief 9FFA0, MSC1 Input High Control Register */
#define GTM_MSC_MSCQ1_INHCON /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_MSCQ_INHCON*)0xF019FFA0u)
/** Alias (User Manual Name) for GTM_MSC_MSCQ1_INHCON.
* To use register names with standard convension, please use GTM_MSC_MSCQ1_INHCON.
*/
#define GTM_MSC1INHCON (GTM_MSC_MSCQ1_INHCON)

/** \brief 9FFA4, MSC1 Input Low Extended Control Register */
#define GTM_MSC_MSCQ1_INLEXTCON /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MSC_MSCQ_INLEXTCON*)0xF019FFA4u)
/** Alias (User Manual Name) for GTM_MSC_MSCQ1_INLEXTCON.
* To use register names with standard convension, please use GTM_MSC_MSCQ1_INLEXTCON.
*/
#define GTM_MSC1INLEXTCON (GTM_MSC_MSCQ1_INLEXTCON)

