zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief E2C14, CCM6 Address Range Protector 2 Protection Register */
#define GTM_CCM6_ARP2_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C14u)

/** \brief E2C18, CCM6 Address Range Protector 3 Control Register */
#define GTM_CCM6_ARP3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C18u)

/** \brief E2C1C, CCM6 Address Range Protector 3 Protection Register */
#define GTM_CCM6_ARP3_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C1Cu)

/** \brief E2C20, CCM6 Address Range Protector 4 Control Register */
#define GTM_CCM6_ARP4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C20u)

/** \brief E2C24, CCM6 Address Range Protector 4 Protection Register */
#define GTM_CCM6_ARP4_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C24u)

/** \brief E2C28, CCM6 Address Range Protector 5 Control Register */
#define GTM_CCM6_ARP5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C28u)

/** \brief E2C2C, CCM6 Address Range Protector 5 Protection Register */
#define GTM_CCM6_ARP5_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C2Cu)

/** \brief E2C30, CCM6 Address Range Protector 6 Control Register */
#define GTM_CCM6_ARP6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C30u)

/** \brief E2C34, CCM6 Address Range Protector 6 Protection Register */
#define GTM_CCM6_ARP6_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C34u)

/** \brief E2C38, CCM6 Address Range Protector 7 Control Register */
#define GTM_CCM6_ARP7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C38u)

/** \brief E2C3C, CCM6 Address Range Protector 7 Protection Register */
#define GTM_CCM6_ARP7_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C3Cu)

/** \brief E2C40, CCM6 Address Range Protector 8 Control Register */
#define GTM_CCM6_ARP8_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C40u)

/** \brief E2C44, CCM6 Address Range Protector 8 Protection Register */
#define GTM_CCM6_ARP8_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C44u)

/** \brief E2C48, CCM6 Address Range Protector 9 Control Register */
#define GTM_CCM6_ARP9_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2C48u)

/** \brief E2C4C, CCM6 Address Range Protector 9 Protection Register */
#define GTM_CCM6_ARP9_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2C4Cu)

/** \brief E2DD8, CCM6 MCS Bus Master Status Register */
#define GTM_CCM6_AEIM_STA /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA*)0xF01E2DD8u)

/** \brief E2DDC, CCM6 Hardware Configuration Register */
#define GTM_CCM6_HW_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_HW_CONF*)0xF01E2DDCu)

/** \brief E2DE0, CCM6 TIM Module AUX_IN Source Selection Register */
#define GTM_CCM6_TIM_AUX_IN_SRC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC*)0xF01E2DE0u)

/** \brief E2DE4, CCM6 External Capture Trigger Enable Register */
#define GTM_CCM6_EXT_CAP_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN*)0xF01E2DE4u)

/** \brief E2DEC, CCM6 ATOM Output Level Register */
#define GTM_CCM6_ATOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT*)0xF01E2DECu)

/** \brief E2DF0, CCM6 CMU Clock Configuration Register */
#define GTM_CCM6_CMU_CLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG*)0xF01E2DF0u)

/** \brief E2DF4, CCM6 CMU Fixed Clock Configuration Register */
#define GTM_CCM6_CMU_FXCLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG*)0xF01E2DF4u)

/** \brief E2DF8, CCM6 Configuration Register */
#define GTM_CCM6_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CFG*)0xF01E2DF8u)

/** \brief E2DFC, CCM6 Protection Register */
#define GTM_CCM6_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_PROT*)0xF01E2DFCu)

/** \brief E2E00, CCM7 Address Range Protector 0 Control Register */
#define GTM_CCM7_ARP0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2E00u)

/** \brief E2E04, CCM7 Address Range Protector 0 Protection Register */
#define GTM_CCM7_ARP0_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2E04u)

/** \brief E2E08, CCM7 Address Range Protector 1 Control Register */
#define GTM_CCM7_ARP1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2E08u)

/** \brief E2E0C, CCM7 Address Range Protector 1 Protection Register */
#define GTM_CCM7_ARP1_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2E0Cu)

/** \brief E2E10, CCM7 Address Range Protector 2 Control Register */
#define GTM_CCM7_ARP2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2E10u)

/** \brief E2E14, CCM7 Address Range Protector 2 Protection Register */
#define GTM_CCM7_ARP2_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2E14u)

/** \brief E2E18, CCM7 Address Range Protector 3 Control Register */
#define GTM_CCM7_ARP3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2E18u)

/** \brief E2E1C, CCM7 Address Range Protector 3 Protection Register */
#define GTM_CCM7_ARP3_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2E1Cu)

/** \brief E2E20, CCM7 Address Range Protector 4 Control Register */
#define GTM_CCM7_ARP4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2E20u)

/** \brief E2E24, CCM7 Address Range Protector 4 Protection Register */
#define GTM_CCM7_ARP4_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2E24u)

/** \brief E2E28, CCM7 Address Range Protector 5 Control Register */
#define GTM_CCM7_ARP5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2E28u)

/** \brief E2E2C, CCM7 Address Range Protector 5 Protection Register */
#define GTM_CCM7_ARP5_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2E2Cu)

/** \brief E2E30, CCM7 Address Range Protector 6 Control Register */
#define GTM_CCM7_ARP6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2E30u)

/** \brief E2E34, CCM7 Address Range Protector 6 Protection Register */
#define GTM_CCM7_ARP6_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2E34u)

