zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief E2E38, CCM7 Address Range Protector 7 Control Register */
#define GTM_CCM7_ARP7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2E38u)

/** \brief E2E3C, CCM7 Address Range Protector 7 Protection Register */
#define GTM_CCM7_ARP7_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2E3Cu)

/** \brief E2E40, CCM7 Address Range Protector 8 Control Register */
#define GTM_CCM7_ARP8_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2E40u)

/** \brief E2E44, CCM7 Address Range Protector 8 Protection Register */
#define GTM_CCM7_ARP8_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2E44u)

/** \brief E2E48, CCM7 Address Range Protector 9 Control Register */
#define GTM_CCM7_ARP9_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E2E48u)

/** \brief E2E4C, CCM7 Address Range Protector 9 Protection Register */
#define GTM_CCM7_ARP9_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E2E4Cu)

/** \brief E2FD8, CCM7 MCS Bus Master Status Register */
#define GTM_CCM7_AEIM_STA /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA*)0xF01E2FD8u)

/** \brief E2FDC, CCM7 Hardware Configuration Register */
#define GTM_CCM7_HW_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_HW_CONF*)0xF01E2FDCu)

/** \brief E2FE0, CCM7 TIM Module AUX_IN Source Selection Register */
#define GTM_CCM7_TIM_AUX_IN_SRC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC*)0xF01E2FE0u)

/** \brief E2FE4, CCM7 External Capture Trigger Enable Register */
#define GTM_CCM7_EXT_CAP_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN*)0xF01E2FE4u)

/** \brief E2FEC, CCM7 ATOM Output Level Register */
#define GTM_CCM7_ATOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT*)0xF01E2FECu)

/** \brief E2FF0, CCM7 CMU Clock Configuration Register */
#define GTM_CCM7_CMU_CLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG*)0xF01E2FF0u)

/** \brief E2FF4, CCM7 CMU Fixed Clock Configuration Register */
#define GTM_CCM7_CMU_FXCLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG*)0xF01E2FF4u)

/** \brief E2FF8, CCM7 Configuration Register */
#define GTM_CCM7_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CFG*)0xF01E2FF8u)

/** \brief E2FFC, CCM7 Protection Register */
#define GTM_CCM7_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_PROT*)0xF01E2FFCu)

/** \brief E3000, CCM8 Address Range Protector 0 Control Register */
#define GTM_CCM8_ARP0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3000u)

/** \brief E3004, CCM8 Address Range Protector 0 Protection Register */
#define GTM_CCM8_ARP0_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E3004u)

/** \brief E3008, CCM8 Address Range Protector 1 Control Register */
#define GTM_CCM8_ARP1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3008u)

/** \brief E300C, CCM8 Address Range Protector 1 Protection Register */
#define GTM_CCM8_ARP1_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E300Cu)

/** \brief E3010, CCM8 Address Range Protector 2 Control Register */
#define GTM_CCM8_ARP2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3010u)

/** \brief E3014, CCM8 Address Range Protector 2 Protection Register */
#define GTM_CCM8_ARP2_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E3014u)

/** \brief E3018, CCM8 Address Range Protector 3 Control Register */
#define GTM_CCM8_ARP3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3018u)

/** \brief E301C, CCM8 Address Range Protector 3 Protection Register */
#define GTM_CCM8_ARP3_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E301Cu)

/** \brief E3020, CCM8 Address Range Protector 4 Control Register */
#define GTM_CCM8_ARP4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3020u)

/** \brief E3024, CCM8 Address Range Protector 4 Protection Register */
#define GTM_CCM8_ARP4_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E3024u)

/** \brief E3028, CCM8 Address Range Protector 5 Control Register */
#define GTM_CCM8_ARP5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3028u)

/** \brief E302C, CCM8 Address Range Protector 5 Protection Register */
#define GTM_CCM8_ARP5_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E302Cu)

/** \brief E3030, CCM8 Address Range Protector 6 Control Register */
#define GTM_CCM8_ARP6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3030u)

/** \brief E3034, CCM8 Address Range Protector 6 Protection Register */
#define GTM_CCM8_ARP6_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E3034u)

/** \brief E3038, CCM8 Address Range Protector 7 Control Register */
#define GTM_CCM8_ARP7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3038u)

/** \brief E303C, CCM8 Address Range Protector 7 Protection Register */
#define GTM_CCM8_ARP7_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E303Cu)

/** \brief E3040, CCM8 Address Range Protector 8 Control Register */
#define GTM_CCM8_ARP8_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3040u)

/** \brief E3044, CCM8 Address Range Protector 8 Protection Register */
#define GTM_CCM8_ARP8_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E3044u)

/** \brief E3048, CCM8 Address Range Protector 9 Control Register */
#define GTM_CCM8_ARP9_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3048u)

/** \brief E304C, CCM8 Address Range Protector 9 Protection Register */
#define GTM_CCM8_ARP9_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E304Cu)

/** \brief E31D8, CCM8 MCS Bus Master Status Register */
#define GTM_CCM8_AEIM_STA /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA*)0xF01E31D8u)

/** \brief E31DC, CCM8 Hardware Configuration Register */
#define GTM_CCM8_HW_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_HW_CONF*)0xF01E31DCu)

/** \brief E31EC, CCM8 ATOM Output Level Register */
#define GTM_CCM8_ATOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT*)0xF01E31ECu)

