zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief EB094, ATOM6 Channel 1 CCU1 Compare Register */
#define GTM_ATOM6_CH1_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EB094u)

/** \brief EB098, ATOM6 Channel 1 CCU0 Counter Register */
#define GTM_ATOM6_CH1_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EB098u)

/** \brief EB09C, ATOM6 Channel 1 Status Register */
#define GTM_ATOM6_CH1_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EB09Cu)

/** \brief EB0A0, ATOM6 Channel 1 Interrupt Notification Register */
#define GTM_ATOM6_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EB0A0u)

/** \brief EB0A4, ATOM6 Channel 1 Interrupt Enable Register */
#define GTM_ATOM6_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EB0A4u)

/** \brief EB0A8, ATOM6 Channel 1 Software Interrupt Generation Register */
#define GTM_ATOM6_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EB0A8u)

/** \brief EB0AC, ATOM6 Channel 1 Interrupt Mode Configuration Register */
#define GTM_ATOM6_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EB0ACu)

/** \brief EB100, ATOM6 Channel 2 ARU read address Register */
#define GTM_ATOM6_CH2_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EB100u)

/** \brief EB104, ATOM6 Channel 2 Control Register */
#define GTM_ATOM6_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EB104u)

/** \brief EB104, ATOM6 Channel 2 Control Register in SOMB Mode */
#define GTM_ATOM6_CH2_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EB104u)

/** \brief EB104, ATOM6 Channel 2 Control Register in SOMC Mode */
#define GTM_ATOM6_CH2_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EB104u)

/** \brief EB104, ATOM6 Channel 2 Control Register in SOMI Mode */
#define GTM_ATOM6_CH2_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EB104u)

/** \brief EB104, ATOM6 Channel 2 Control Register in SOMP Mode */
#define GTM_ATOM6_CH2_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EB104u)

/** \brief EB104, ATOM6 Channel 2 Control Register in SOMS Mode */
#define GTM_ATOM6_CH2_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EB104u)

/** \brief EB108, ATOM6 Channel 2 CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH2_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EB108u)

/** \brief EB10C, ATOM6 Channel 2 CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH2_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EB10Cu)

/** \brief EB110, ATOM6 Channel 2 CCU0 Compare Register */
#define GTM_ATOM6_CH2_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EB110u)

/** \brief EB114, ATOM6 Channel 2 CCU1 Compare Register */
#define GTM_ATOM6_CH2_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EB114u)

/** \brief EB118, ATOM6 Channel 2 CCU0 Counter Register */
#define GTM_ATOM6_CH2_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EB118u)

/** \brief EB11C, ATOM6 Channel 2 Status Register */
#define GTM_ATOM6_CH2_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EB11Cu)

/** \brief EB120, ATOM6 Channel 2 Interrupt Notification Register */
#define GTM_ATOM6_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EB120u)

/** \brief EB124, ATOM6 Channel 2 Interrupt Enable Register */
#define GTM_ATOM6_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EB124u)

/** \brief EB128, ATOM6 Channel 2 Software Interrupt Generation Register */
#define GTM_ATOM6_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EB128u)

/** \brief EB12C, ATOM6 Channel 2 Interrupt Mode Configuration Register */
#define GTM_ATOM6_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EB12Cu)

/** \brief EB180, ATOM6 Channel 3 ARU read address Register */
#define GTM_ATOM6_CH3_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EB180u)

/** \brief EB184, ATOM6 Channel 3 Control Register */
#define GTM_ATOM6_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EB184u)

/** \brief EB184, ATOM6 Channel 3 Control Register in SOMB Mode */
#define GTM_ATOM6_CH3_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EB184u)

/** \brief EB184, ATOM6 Channel 3 Control Register in SOMC Mode */
#define GTM_ATOM6_CH3_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EB184u)

/** \brief EB184, ATOM6 Channel 3 Control Register in SOMI Mode */
#define GTM_ATOM6_CH3_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EB184u)

/** \brief EB184, ATOM6 Channel 3 Control Register in SOMP Mode */
#define GTM_ATOM6_CH3_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EB184u)

/** \brief EB184, ATOM6 Channel 3 Control Register in SOMS Mode */
#define GTM_ATOM6_CH3_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EB184u)

/** \brief EB188, ATOM6 Channel 3 CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH3_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EB188u)

/** \brief EB18C, ATOM6 Channel 3 CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH3_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EB18Cu)

/** \brief EB190, ATOM6 Channel 3 CCU0 Compare Register */
#define GTM_ATOM6_CH3_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EB190u)

/** \brief EB194, ATOM6 Channel 3 CCU1 Compare Register */
#define GTM_ATOM6_CH3_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EB194u)

/** \brief EB198, ATOM6 Channel 3 CCU0 Counter Register */
#define GTM_ATOM6_CH3_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EB198u)

/** \brief EB19C, ATOM6 Channel 3 Status Register */
#define GTM_ATOM6_CH3_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EB19Cu)

