zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief EB8A8, ATOM7 Channel 1 Software Interrupt Generation Register */
#define GTM_ATOM7_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EB8A8u)

/** \brief EB8AC, ATOM7 Channel 1 Interrupt Mode Configuration Register */
#define GTM_ATOM7_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EB8ACu)

/** \brief EB900, ATOM7 Channel 2 ARU read address Register */
#define GTM_ATOM7_CH2_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EB900u)

/** \brief EB904, ATOM7 Channel 2 Control Register */
#define GTM_ATOM7_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EB904u)

/** \brief EB904, ATOM7 Channel 2 Control Register in SOMB Mode */
#define GTM_ATOM7_CH2_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EB904u)

/** \brief EB904, ATOM7 Channel 2 Control Register in SOMC Mode */
#define GTM_ATOM7_CH2_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EB904u)

/** \brief EB904, ATOM7 Channel 2 Control Register in SOMI Mode */
#define GTM_ATOM7_CH2_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EB904u)

/** \brief EB904, ATOM7 Channel 2 Control Register in SOMP Mode */
#define GTM_ATOM7_CH2_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EB904u)

/** \brief EB904, ATOM7 Channel 2 Control Register in SOMS Mode */
#define GTM_ATOM7_CH2_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EB904u)

/** \brief EB908, ATOM7 Channel 2 CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH2_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EB908u)

/** \brief EB90C, ATOM7 Channel 2 CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH2_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EB90Cu)

/** \brief EB910, ATOM7 Channel 2 CCU0 Compare Register */
#define GTM_ATOM7_CH2_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EB910u)

/** \brief EB914, ATOM7 Channel 2 CCU1 Compare Register */
#define GTM_ATOM7_CH2_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EB914u)

/** \brief EB918, ATOM7 Channel 2 CCU0 Counter Register */
#define GTM_ATOM7_CH2_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EB918u)

/** \brief EB91C, ATOM7 Channel 2 Status Register */
#define GTM_ATOM7_CH2_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EB91Cu)

/** \brief EB920, ATOM7 Channel 2 Interrupt Notification Register */
#define GTM_ATOM7_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EB920u)

/** \brief EB924, ATOM7 Channel 2 Interrupt Enable Register */
#define GTM_ATOM7_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EB924u)

/** \brief EB928, ATOM7 Channel 2 Software Interrupt Generation Register */
#define GTM_ATOM7_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EB928u)

/** \brief EB92C, ATOM7 Channel 2 Interrupt Mode Configuration Register */
#define GTM_ATOM7_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EB92Cu)

/** \brief EB980, ATOM7 Channel 3 ARU read address Register */
#define GTM_ATOM7_CH3_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EB980u)

/** \brief EB984, ATOM7 Channel 3 Control Register */
#define GTM_ATOM7_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EB984u)

/** \brief EB984, ATOM7 Channel 3 Control Register in SOMB Mode */
#define GTM_ATOM7_CH3_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EB984u)

/** \brief EB984, ATOM7 Channel 3 Control Register in SOMC Mode */
#define GTM_ATOM7_CH3_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EB984u)

/** \brief EB984, ATOM7 Channel 3 Control Register in SOMI Mode */
#define GTM_ATOM7_CH3_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EB984u)

/** \brief EB984, ATOM7 Channel 3 Control Register in SOMP Mode */
#define GTM_ATOM7_CH3_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EB984u)

/** \brief EB984, ATOM7 Channel 3 Control Register in SOMS Mode */
#define GTM_ATOM7_CH3_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EB984u)

/** \brief EB988, ATOM7 Channel 3 CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH3_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EB988u)

/** \brief EB98C, ATOM7 Channel 3 CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH3_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EB98Cu)

/** \brief EB990, ATOM7 Channel 3 CCU0 Compare Register */
#define GTM_ATOM7_CH3_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EB990u)

/** \brief EB994, ATOM7 Channel 3 CCU1 Compare Register */
#define GTM_ATOM7_CH3_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EB994u)

/** \brief EB998, ATOM7 Channel 3 CCU0 Counter Register */
#define GTM_ATOM7_CH3_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EB998u)

/** \brief EB99C, ATOM7 Channel 3 Status Register */
#define GTM_ATOM7_CH3_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EB99Cu)

/** \brief EB9A0, ATOM7 Channel 3 Interrupt Notification Register */
#define GTM_ATOM7_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EB9A0u)

/** \brief EB9A4, ATOM7 Channel 3 Interrupt Enable Register */
#define GTM_ATOM7_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EB9A4u)

/** \brief EB9A8, ATOM7 Channel 3 Software Interrupt Generation Register */
#define GTM_ATOM7_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EB9A8u)

/** \brief EB9AC, ATOM7 Channel 3 Interrupt Mode Configuration Register */
#define GTM_ATOM7_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EB9ACu)

/** \brief EBA00, ATOM7 Channel 4 ARU read address Register */
#define GTM_ATOM7_CH4_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EBA00u)

