zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief EBB04, ATOM7 Channel 6 Control Register in SOMS Mode */
#define GTM_ATOM7_CH6_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EBB04u)

/** \brief EBB08, ATOM7 Channel 6 CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH6_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EBB08u)

/** \brief EBB0C, ATOM7 Channel 6 CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH6_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EBB0Cu)

/** \brief EBB10, ATOM7 Channel 6 CCU0 Compare Register */
#define GTM_ATOM7_CH6_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EBB10u)

/** \brief EBB14, ATOM7 Channel 6 CCU1 Compare Register */
#define GTM_ATOM7_CH6_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EBB14u)

/** \brief EBB18, ATOM7 Channel 6 CCU0 Counter Register */
#define GTM_ATOM7_CH6_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EBB18u)

/** \brief EBB1C, ATOM7 Channel 6 Status Register */
#define GTM_ATOM7_CH6_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EBB1Cu)

/** \brief EBB20, ATOM7 Channel 6 Interrupt Notification Register */
#define GTM_ATOM7_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EBB20u)

/** \brief EBB24, ATOM7 Channel 6 Interrupt Enable Register */
#define GTM_ATOM7_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EBB24u)

/** \brief EBB28, ATOM7 Channel 6 Software Interrupt Generation Register */
#define GTM_ATOM7_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EBB28u)

/** \brief EBB2C, ATOM7 Channel 6 Interrupt Mode Configuration Register */
#define GTM_ATOM7_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EBB2Cu)

/** \brief EBB80, ATOM7 Channel 7 ARU read address Register */
#define GTM_ATOM7_CH7_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EBB80u)

/** \brief EBB84, ATOM7 Channel 7 Control Register */
#define GTM_ATOM7_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EBB84u)

/** \brief EBB84, ATOM7 Channel 7 Control Register in SOMB Mode */
#define GTM_ATOM7_CH7_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EBB84u)

/** \brief EBB84, ATOM7 Channel 7 Control Register in SOMC Mode */
#define GTM_ATOM7_CH7_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EBB84u)

/** \brief EBB84, ATOM7 Channel 7 Control Register in SOMI Mode */
#define GTM_ATOM7_CH7_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EBB84u)

/** \brief EBB84, ATOM7 Channel 7 Control Register in SOMP Mode */
#define GTM_ATOM7_CH7_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EBB84u)

/** \brief EBB84, ATOM7 Channel 7 Control Register in SOMS Mode */
#define GTM_ATOM7_CH7_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EBB84u)

/** \brief EBB88, ATOM7 Channel 7 CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH7_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EBB88u)

/** \brief EBB8C, ATOM7 Channel 7 CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH7_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EBB8Cu)

/** \brief EBB90, ATOM7 Channel 7 CCU0 Compare Register */
#define GTM_ATOM7_CH7_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EBB90u)

/** \brief EBB94, ATOM7 Channel 7 CCU1 Compare Register */
#define GTM_ATOM7_CH7_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EBB94u)

/** \brief EBB98, ATOM7 Channel 7 CCU0 Counter Register */
#define GTM_ATOM7_CH7_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EBB98u)

/** \brief EBB9C, ATOM7 Channel 7 Status Register */
#define GTM_ATOM7_CH7_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EBB9Cu)

/** \brief EBBA0, ATOM7 Channel 7 Interrupt Notification Register */
#define GTM_ATOM7_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EBBA0u)

/** \brief EBBA4, ATOM7 Channel 7 Interrupt Enable Register */
#define GTM_ATOM7_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EBBA4u)

/** \brief EBBA8, ATOM7 Channel 7 Software Interrupt Generation Register */
#define GTM_ATOM7_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EBBA8u)

/** \brief EBBAC, ATOM7 Channel 7 Interrupt Mode Configuration Register */
#define GTM_ATOM7_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EBBACu)

/** \brief EC000, ATOM8 Channel 0 ARU read address Register */
#define GTM_ATOM8_CH0_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EC000u)

/** \brief EC004, ATOM8 Channel 0 Control Register */
#define GTM_ATOM8_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EC004u)

/** \brief EC004, ATOM8 Channel 0 Control Register in SOMB Mode */
#define GTM_ATOM8_CH0_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EC004u)

/** \brief EC004, ATOM8 Channel 0 Control Register in SOMC Mode */
#define GTM_ATOM8_CH0_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EC004u)

/** \brief EC004, ATOM8 Channel 0 Control Register in SOMI Mode */
#define GTM_ATOM8_CH0_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EC004u)

/** \brief EC004, ATOM8 Channel 0 Control Register in SOMP Mode */
#define GTM_ATOM8_CH0_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EC004u)

/** \brief EC004, ATOM8 Channel 0 Control Register in SOMS Mode */
#define GTM_ATOM8_CH0_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EC004u)

/** \brief EC008, ATOM8 Channel 0 CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EC008u)

/** \brief EC00C, ATOM8 Channel 0 CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EC00Cu)

