zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief EC104, ATOM8 Channel 2 Control Register in SOMS Mode */
#define GTM_ATOM8_CH2_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EC104u)

/** \brief EC108, ATOM8 Channel 2 CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH2_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EC108u)

/** \brief EC10C, ATOM8 Channel 2 CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH2_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EC10Cu)

/** \brief EC110, ATOM8 Channel 2 CCU0 Compare Register */
#define GTM_ATOM8_CH2_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EC110u)

/** \brief EC114, ATOM8 Channel 2 CCU1 Compare Register */
#define GTM_ATOM8_CH2_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EC114u)

/** \brief EC118, ATOM8 Channel 2 CCU0 Counter Register */
#define GTM_ATOM8_CH2_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EC118u)

/** \brief EC11C, ATOM8 Channel 2 Status Register */
#define GTM_ATOM8_CH2_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EC11Cu)

/** \brief EC120, ATOM8 Channel 2 Interrupt Notification Register */
#define GTM_ATOM8_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EC120u)

/** \brief EC124, ATOM8 Channel 2 Interrupt Enable Register */
#define GTM_ATOM8_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EC124u)

/** \brief EC128, ATOM8 Channel 2 Software Interrupt Generation Register */
#define GTM_ATOM8_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EC128u)

/** \brief EC12C, ATOM8 Channel 2 Interrupt Mode Configuration Register */
#define GTM_ATOM8_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EC12Cu)

/** \brief EC180, ATOM8 Channel 3 ARU read address Register */
#define GTM_ATOM8_CH3_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EC180u)

/** \brief EC184, ATOM8 Channel 3 Control Register */
#define GTM_ATOM8_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EC184u)

/** \brief EC184, ATOM8 Channel 3 Control Register in SOMB Mode */
#define GTM_ATOM8_CH3_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EC184u)

/** \brief EC184, ATOM8 Channel 3 Control Register in SOMC Mode */
#define GTM_ATOM8_CH3_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EC184u)

/** \brief EC184, ATOM8 Channel 3 Control Register in SOMI Mode */
#define GTM_ATOM8_CH3_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EC184u)

/** \brief EC184, ATOM8 Channel 3 Control Register in SOMP Mode */
#define GTM_ATOM8_CH3_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EC184u)

/** \brief EC184, ATOM8 Channel 3 Control Register in SOMS Mode */
#define GTM_ATOM8_CH3_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EC184u)

/** \brief EC188, ATOM8 Channel 3 CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH3_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EC188u)

/** \brief EC18C, ATOM8 Channel 3 CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH3_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EC18Cu)

/** \brief EC190, ATOM8 Channel 3 CCU0 Compare Register */
#define GTM_ATOM8_CH3_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EC190u)

/** \brief EC194, ATOM8 Channel 3 CCU1 Compare Register */
#define GTM_ATOM8_CH3_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EC194u)

/** \brief EC198, ATOM8 Channel 3 CCU0 Counter Register */
#define GTM_ATOM8_CH3_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EC198u)

/** \brief EC19C, ATOM8 Channel 3 Status Register */
#define GTM_ATOM8_CH3_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EC19Cu)

/** \brief EC1A0, ATOM8 Channel 3 Interrupt Notification Register */
#define GTM_ATOM8_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EC1A0u)

/** \brief EC1A4, ATOM8 Channel 3 Interrupt Enable Register */
#define GTM_ATOM8_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EC1A4u)

/** \brief EC1A8, ATOM8 Channel 3 Software Interrupt Generation Register */
#define GTM_ATOM8_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EC1A8u)

/** \brief EC1AC, ATOM8 Channel 3 Interrupt Mode Configuration Register */
#define GTM_ATOM8_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EC1ACu)

/** \brief EC200, ATOM8 Channel 4 ARU read address Register */
#define GTM_ATOM8_CH4_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EC200u)

/** \brief EC204, ATOM8 Channel 4 Control Register */
#define GTM_ATOM8_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EC204u)

/** \brief EC204, ATOM8 Channel 4 Control Register in SOMB Mode */
#define GTM_ATOM8_CH4_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EC204u)

/** \brief EC204, ATOM8 Channel 4 Control Register in SOMC Mode */
#define GTM_ATOM8_CH4_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EC204u)

/** \brief EC204, ATOM8 Channel 4 Control Register in SOMI Mode */
#define GTM_ATOM8_CH4_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EC204u)

/** \brief EC204, ATOM8 Channel 4 Control Register in SOMP Mode */
#define GTM_ATOM8_CH4_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EC204u)

/** \brief EC204, ATOM8 Channel 4 Control Register in SOMS Mode */
#define GTM_ATOM8_CH4_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EC204u)

/** \brief EC208, ATOM8 Channel 4 CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH4_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EC208u)

/** \brief EC20C, ATOM8 Channel 4 CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH4_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EC20Cu)

/** \brief EC210, ATOM8 Channel 4 CCU0 Compare Register */
#define GTM_ATOM8_CH4_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EC210u)

