zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief EC32C, ATOM8 Channel 6 Interrupt Mode Configuration Register */
#define GTM_ATOM8_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EC32Cu)

/** \brief EC380, ATOM8 Channel 7 ARU read address Register */
#define GTM_ATOM8_CH7_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EC380u)

/** \brief EC384, ATOM8 Channel 7 Control Register */
#define GTM_ATOM8_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EC384u)

/** \brief EC384, ATOM8 Channel 7 Control Register in SOMB Mode */
#define GTM_ATOM8_CH7_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EC384u)

/** \brief EC384, ATOM8 Channel 7 Control Register in SOMC Mode */
#define GTM_ATOM8_CH7_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EC384u)

/** \brief EC384, ATOM8 Channel 7 Control Register in SOMI Mode */
#define GTM_ATOM8_CH7_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EC384u)

/** \brief EC384, ATOM8 Channel 7 Control Register in SOMP Mode */
#define GTM_ATOM8_CH7_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EC384u)

/** \brief EC384, ATOM8 Channel 7 Control Register in SOMS Mode */
#define GTM_ATOM8_CH7_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EC384u)

/** \brief EC388, ATOM8 Channel 7 CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH7_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EC388u)

/** \brief EC38C, ATOM8 Channel 7 CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH7_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EC38Cu)

/** \brief EC390, ATOM8 Channel 7 CCU0 Compare Register */
#define GTM_ATOM8_CH7_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EC390u)

/** \brief EC394, ATOM8 Channel 7 CCU1 Compare Register */
#define GTM_ATOM8_CH7_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EC394u)

/** \brief EC398, ATOM8 Channel 7 CCU0 Counter Register */
#define GTM_ATOM8_CH7_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EC398u)

/** \brief EC39C, ATOM8 Channel 7 Status Register */
#define GTM_ATOM8_CH7_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EC39Cu)

/** \brief EC3A0, ATOM8 Channel 7 Interrupt Notification Register */
#define GTM_ATOM8_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EC3A0u)

/** \brief EC3A4, ATOM8 Channel 7 Interrupt Enable Register */
#define GTM_ATOM8_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EC3A4u)

/** \brief EC3A8, ATOM8 Channel 7 Software Interrupt Generation Register */
#define GTM_ATOM8_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EC3A8u)

/** \brief EC3AC, ATOM8 Channel 7 Interrupt Mode Configuration Register */
#define GTM_ATOM8_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EC3ACu)

/** \brief EC800, ATOM9 Channel 0 ARU read address Register */
#define GTM_ATOM9_CH0_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EC800u)

/** \brief EC804, ATOM9 Channel 0 Control Register */
#define GTM_ATOM9_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EC804u)

/** \brief EC804, ATOM9 Channel 0 Control Register in SOMB Mode */
#define GTM_ATOM9_CH0_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EC804u)

/** \brief EC804, ATOM9 Channel 0 Control Register in SOMC Mode */
#define GTM_ATOM9_CH0_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EC804u)

/** \brief EC804, ATOM9 Channel 0 Control Register in SOMI Mode */
#define GTM_ATOM9_CH0_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EC804u)

/** \brief EC804, ATOM9 Channel 0 Control Register in SOMP Mode */
#define GTM_ATOM9_CH0_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EC804u)

/** \brief EC804, ATOM9 Channel 0 Control Register in SOMS Mode */
#define GTM_ATOM9_CH0_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EC804u)

/** \brief EC808, ATOM9 Channel 0 CCU0 Compare Shadow Register */
#define GTM_ATOM9_CH0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EC808u)

/** \brief EC80C, ATOM9 Channel 0 CCU1 Compare Shadow Register */
#define GTM_ATOM9_CH0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EC80Cu)

/** \brief EC810, ATOM9 Channel 0 CCU0 Compare Register */
#define GTM_ATOM9_CH0_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EC810u)

/** \brief EC814, ATOM9 Channel 0 CCU1 Compare Register */
#define GTM_ATOM9_CH0_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EC814u)

/** \brief EC818, ATOM9 Channel 0 CCU0 Counter Register */
#define GTM_ATOM9_CH0_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EC818u)

/** \brief EC81C, ATOM9 Channel 0 Status Register */
#define GTM_ATOM9_CH0_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EC81Cu)

/** \brief EC820, ATOM9 Channel 0 Interrupt Notification Register */
#define GTM_ATOM9_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EC820u)

/** \brief EC824, ATOM9 Channel 0 Interrupt Enable Register */
#define GTM_ATOM9_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EC824u)

/** \brief EC828, ATOM9 Channel 0 Software Interrupt Generation Register */
#define GTM_ATOM9_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EC828u)

/** \brief EC82C, ATOM9 Channel 0 Interrupt Mode Configuration Register */
#define GTM_ATOM9_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EC82Cu)

/** \brief EC840, ATOM9 AGC Global Control Register */
#define GTM_ATOM9_AGC_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF01EC840u)

/** \brief EC844, ATOM9 AGC Enable/Disable Control Register */
#define GTM_ATOM9_AGC_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF01EC844u)

