zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief EC848, ATOM9 AGC Enable/Disable Status Register */
#define GTM_ATOM9_AGC_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF01EC848u)

/** \brief EC84C, ATOM9 AGC Action Time Base Register */
#define GTM_ATOM9_AGC_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF01EC84Cu)

/** \brief EC850, ATOM9 AGC Output Enable Control Register */
#define GTM_ATOM9_AGC_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF01EC850u)

/** \brief EC854, ATOM9 AGC Output Enable Status Register */
#define GTM_ATOM9_AGC_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF01EC854u)

/** \brief EC858, ATOM9 AGC Force Update Control Register */
#define GTM_ATOM9_AGC_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF01EC858u)

/** \brief EC85C, ATOM9 AGC Internal Trigger Control Register */
#define GTM_ATOM9_AGC_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF01EC85Cu)

/** \brief EC880, ATOM9 Channel 1 ARU read address Register */
#define GTM_ATOM9_CH1_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EC880u)

/** \brief EC884, ATOM9 Channel 1 Control Register */
#define GTM_ATOM9_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EC884u)

/** \brief EC884, ATOM9 Channel 1 Control Register in SOMB Mode */
#define GTM_ATOM9_CH1_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EC884u)

/** \brief EC884, ATOM9 Channel 1 Control Register in SOMC Mode */
#define GTM_ATOM9_CH1_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EC884u)

/** \brief EC884, ATOM9 Channel 1 Control Register in SOMI Mode */
#define GTM_ATOM9_CH1_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EC884u)

/** \brief EC884, ATOM9 Channel 1 Control Register in SOMP Mode */
#define GTM_ATOM9_CH1_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EC884u)

/** \brief EC884, ATOM9 Channel 1 Control Register in SOMS Mode */
#define GTM_ATOM9_CH1_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EC884u)

/** \brief EC888, ATOM9 Channel 1 CCU0 Compare Shadow Register */
#define GTM_ATOM9_CH1_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EC888u)

/** \brief EC88C, ATOM9 Channel 1 CCU1 Compare Shadow Register */
#define GTM_ATOM9_CH1_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EC88Cu)

/** \brief EC890, ATOM9 Channel 1 CCU0 Compare Register */
#define GTM_ATOM9_CH1_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EC890u)

/** \brief EC894, ATOM9 Channel 1 CCU1 Compare Register */
#define GTM_ATOM9_CH1_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EC894u)

/** \brief EC898, ATOM9 Channel 1 CCU0 Counter Register */
#define GTM_ATOM9_CH1_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EC898u)

/** \brief EC89C, ATOM9 Channel 1 Status Register */
#define GTM_ATOM9_CH1_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EC89Cu)

/** \brief EC8A0, ATOM9 Channel 1 Interrupt Notification Register */
#define GTM_ATOM9_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EC8A0u)

/** \brief EC8A4, ATOM9 Channel 1 Interrupt Enable Register */
#define GTM_ATOM9_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EC8A4u)

/** \brief EC8A8, ATOM9 Channel 1 Software Interrupt Generation Register */
#define GTM_ATOM9_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EC8A8u)

/** \brief EC8AC, ATOM9 Channel 1 Interrupt Mode Configuration Register */
#define GTM_ATOM9_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EC8ACu)

/** \brief EC900, ATOM9 Channel 2 ARU read address Register */
#define GTM_ATOM9_CH2_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EC900u)

/** \brief EC904, ATOM9 Channel 2 Control Register */
#define GTM_ATOM9_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EC904u)

/** \brief EC904, ATOM9 Channel 2 Control Register in SOMB Mode */
#define GTM_ATOM9_CH2_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EC904u)

/** \brief EC904, ATOM9 Channel 2 Control Register in SOMC Mode */
#define GTM_ATOM9_CH2_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EC904u)

/** \brief EC904, ATOM9 Channel 2 Control Register in SOMI Mode */
#define GTM_ATOM9_CH2_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EC904u)

/** \brief EC904, ATOM9 Channel 2 Control Register in SOMP Mode */
#define GTM_ATOM9_CH2_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EC904u)

/** \brief EC904, ATOM9 Channel 2 Control Register in SOMS Mode */
#define GTM_ATOM9_CH2_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EC904u)

/** \brief EC908, ATOM9 Channel 2 CCU0 Compare Shadow Register */
#define GTM_ATOM9_CH2_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EC908u)

/** \brief EC90C, ATOM9 Channel 2 CCU1 Compare Shadow Register */
#define GTM_ATOM9_CH2_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EC90Cu)

/** \brief EC910, ATOM9 Channel 2 CCU0 Compare Register */
#define GTM_ATOM9_CH2_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EC910u)

/** \brief EC914, ATOM9 Channel 2 CCU1 Compare Register */
#define GTM_ATOM9_CH2_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EC914u)

/** \brief EC918, ATOM9 Channel 2 CCU0 Counter Register */
#define GTM_ATOM9_CH2_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EC918u)

/** \brief EC91C, ATOM9 Channel 2 Status Register */
#define GTM_ATOM9_CH2_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EC91Cu)

/** \brief EC920, ATOM9 Channel 2 Interrupt Notification Register */
#define GTM_ATOM9_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EC920u)

/** \brief EC924, ATOM9 Channel 2 Interrupt Enable Register */
#define GTM_ATOM9_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EC924u)

/** \brief EC928, ATOM9 Channel 2 Software Interrupt Generation Register */
#define GTM_ATOM9_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EC928u)

/** \brief EC92C, ATOM9 Channel 2 Interrupt Mode Configuration Register */
#define GTM_ATOM9_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EC92Cu)

