zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief EC980, ATOM9 Channel 3 ARU read address Register */
#define GTM_ATOM9_CH3_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EC980u)

/** \brief EC984, ATOM9 Channel 3 Control Register */
#define GTM_ATOM9_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EC984u)

/** \brief EC984, ATOM9 Channel 3 Control Register in SOMB Mode */
#define GTM_ATOM9_CH3_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EC984u)

/** \brief EC984, ATOM9 Channel 3 Control Register in SOMC Mode */
#define GTM_ATOM9_CH3_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EC984u)

/** \brief EC984, ATOM9 Channel 3 Control Register in SOMI Mode */
#define GTM_ATOM9_CH3_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EC984u)

/** \brief EC984, ATOM9 Channel 3 Control Register in SOMP Mode */
#define GTM_ATOM9_CH3_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EC984u)

/** \brief EC984, ATOM9 Channel 3 Control Register in SOMS Mode */
#define GTM_ATOM9_CH3_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EC984u)

/** \brief EC988, ATOM9 Channel 3 CCU0 Compare Shadow Register */
#define GTM_ATOM9_CH3_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EC988u)

/** \brief EC98C, ATOM9 Channel 3 CCU1 Compare Shadow Register */
#define GTM_ATOM9_CH3_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EC98Cu)

/** \brief EC990, ATOM9 Channel 3 CCU0 Compare Register */
#define GTM_ATOM9_CH3_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EC990u)

/** \brief EC994, ATOM9 Channel 3 CCU1 Compare Register */
#define GTM_ATOM9_CH3_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EC994u)

/** \brief EC998, ATOM9 Channel 3 CCU0 Counter Register */
#define GTM_ATOM9_CH3_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EC998u)

/** \brief EC99C, ATOM9 Channel 3 Status Register */
#define GTM_ATOM9_CH3_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EC99Cu)

/** \brief EC9A0, ATOM9 Channel 3 Interrupt Notification Register */
#define GTM_ATOM9_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EC9A0u)

/** \brief EC9A4, ATOM9 Channel 3 Interrupt Enable Register */
#define GTM_ATOM9_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EC9A4u)

/** \brief EC9A8, ATOM9 Channel 3 Software Interrupt Generation Register */
#define GTM_ATOM9_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EC9A8u)

/** \brief EC9AC, ATOM9 Channel 3 Interrupt Mode Configuration Register */
#define GTM_ATOM9_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EC9ACu)

/** \brief ECA00, ATOM9 Channel 4 ARU read address Register */
#define GTM_ATOM9_CH4_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ECA00u)

/** \brief ECA04, ATOM9 Channel 4 Control Register */
#define GTM_ATOM9_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ECA04u)

/** \brief ECA04, ATOM9 Channel 4 Control Register in SOMB Mode */
#define GTM_ATOM9_CH4_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ECA04u)

/** \brief ECA04, ATOM9 Channel 4 Control Register in SOMC Mode */
#define GTM_ATOM9_CH4_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ECA04u)

/** \brief ECA04, ATOM9 Channel 4 Control Register in SOMI Mode */
#define GTM_ATOM9_CH4_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ECA04u)

/** \brief ECA04, ATOM9 Channel 4 Control Register in SOMP Mode */
#define GTM_ATOM9_CH4_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ECA04u)

/** \brief ECA04, ATOM9 Channel 4 Control Register in SOMS Mode */
#define GTM_ATOM9_CH4_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ECA04u)

/** \brief ECA08, ATOM9 Channel 4 CCU0 Compare Shadow Register */
#define GTM_ATOM9_CH4_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ECA08u)

/** \brief ECA0C, ATOM9 Channel 4 CCU1 Compare Shadow Register */
#define GTM_ATOM9_CH4_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ECA0Cu)

/** \brief ECA10, ATOM9 Channel 4 CCU0 Compare Register */
#define GTM_ATOM9_CH4_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ECA10u)

/** \brief ECA14, ATOM9 Channel 4 CCU1 Compare Register */
#define GTM_ATOM9_CH4_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ECA14u)

/** \brief ECA18, ATOM9 Channel 4 CCU0 Counter Register */
#define GTM_ATOM9_CH4_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ECA18u)

/** \brief ECA1C, ATOM9 Channel 4 Status Register */
#define GTM_ATOM9_CH4_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ECA1Cu)

/** \brief ECA20, ATOM9 Channel 4 Interrupt Notification Register */
#define GTM_ATOM9_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ECA20u)

/** \brief ECA24, ATOM9 Channel 4 Interrupt Enable Register */
#define GTM_ATOM9_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ECA24u)

/** \brief ECA28, ATOM9 Channel 4 Software Interrupt Generation Register */
#define GTM_ATOM9_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ECA28u)

/** \brief ECA2C, ATOM9 Channel 4 Interrupt Mode Configuration Register */
#define GTM_ATOM9_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ECA2Cu)

/** \brief ECA80, ATOM9 Channel 5 ARU read address Register */
#define GTM_ATOM9_CH5_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ECA80u)

/** \brief ECA84, ATOM9 Channel 5 Control Register */
#define GTM_ATOM9_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ECA84u)

/** \brief ECA84, ATOM9 Channel 5 Control Register in SOMB Mode */
#define GTM_ATOM9_CH5_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ECA84u)

/** \brief ECA84, ATOM9 Channel 5 Control Register in SOMC Mode */
#define GTM_ATOM9_CH5_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ECA84u)

/** \brief ECA84, ATOM9 Channel 5 Control Register in SOMI Mode */
#define GTM_ATOM9_CH5_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ECA84u)

/** \brief ECA84, ATOM9 Channel 5 Control Register in SOMP Mode */
#define GTM_ATOM9_CH5_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ECA84u)

