zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief ECA84, ATOM9 Channel 5 Control Register in SOMS Mode */
#define GTM_ATOM9_CH5_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ECA84u)

/** \brief ECA88, ATOM9 Channel 5 CCU0 Compare Shadow Register */
#define GTM_ATOM9_CH5_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ECA88u)

/** \brief ECA8C, ATOM9 Channel 5 CCU1 Compare Shadow Register */
#define GTM_ATOM9_CH5_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ECA8Cu)

/** \brief ECA90, ATOM9 Channel 5 CCU0 Compare Register */
#define GTM_ATOM9_CH5_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ECA90u)

/** \brief ECA94, ATOM9 Channel 5 CCU1 Compare Register */
#define GTM_ATOM9_CH5_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ECA94u)

/** \brief ECA98, ATOM9 Channel 5 CCU0 Counter Register */
#define GTM_ATOM9_CH5_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ECA98u)

/** \brief ECA9C, ATOM9 Channel 5 Status Register */
#define GTM_ATOM9_CH5_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ECA9Cu)

/** \brief ECAA0, ATOM9 Channel 5 Interrupt Notification Register */
#define GTM_ATOM9_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ECAA0u)

/** \brief ECAA4, ATOM9 Channel 5 Interrupt Enable Register */
#define GTM_ATOM9_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ECAA4u)

/** \brief ECAA8, ATOM9 Channel 5 Software Interrupt Generation Register */
#define GTM_ATOM9_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ECAA8u)

/** \brief ECAAC, ATOM9 Channel 5 Interrupt Mode Configuration Register */
#define GTM_ATOM9_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ECAACu)

/** \brief ECB00, ATOM9 Channel 6 ARU read address Register */
#define GTM_ATOM9_CH6_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ECB00u)

/** \brief ECB04, ATOM9 Channel 6 Control Register */
#define GTM_ATOM9_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ECB04u)

/** \brief ECB04, ATOM9 Channel 6 Control Register in SOMB Mode */
#define GTM_ATOM9_CH6_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ECB04u)

/** \brief ECB04, ATOM9 Channel 6 Control Register in SOMC Mode */
#define GTM_ATOM9_CH6_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ECB04u)

/** \brief ECB04, ATOM9 Channel 6 Control Register in SOMI Mode */
#define GTM_ATOM9_CH6_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ECB04u)

/** \brief ECB04, ATOM9 Channel 6 Control Register in SOMP Mode */
#define GTM_ATOM9_CH6_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ECB04u)

/** \brief ECB04, ATOM9 Channel 6 Control Register in SOMS Mode */
#define GTM_ATOM9_CH6_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ECB04u)

/** \brief ECB08, ATOM9 Channel 6 CCU0 Compare Shadow Register */
#define GTM_ATOM9_CH6_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ECB08u)

/** \brief ECB0C, ATOM9 Channel 6 CCU1 Compare Shadow Register */
#define GTM_ATOM9_CH6_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ECB0Cu)

/** \brief ECB10, ATOM9 Channel 6 CCU0 Compare Register */
#define GTM_ATOM9_CH6_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ECB10u)

/** \brief ECB14, ATOM9 Channel 6 CCU1 Compare Register */
#define GTM_ATOM9_CH6_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ECB14u)

/** \brief ECB18, ATOM9 Channel 6 CCU0 Counter Register */
#define GTM_ATOM9_CH6_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ECB18u)

/** \brief ECB1C, ATOM9 Channel 6 Status Register */
#define GTM_ATOM9_CH6_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ECB1Cu)

/** \brief ECB20, ATOM9 Channel 6 Interrupt Notification Register */
#define GTM_ATOM9_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ECB20u)

/** \brief ECB24, ATOM9 Channel 6 Interrupt Enable Register */
#define GTM_ATOM9_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ECB24u)

/** \brief ECB28, ATOM9 Channel 6 Software Interrupt Generation Register */
#define GTM_ATOM9_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ECB28u)

/** \brief ECB2C, ATOM9 Channel 6 Interrupt Mode Configuration Register */
#define GTM_ATOM9_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ECB2Cu)

/** \brief ECB80, ATOM9 Channel 7 ARU read address Register */
#define GTM_ATOM9_CH7_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ECB80u)

/** \brief ECB84, ATOM9 Channel 7 Control Register */
#define GTM_ATOM9_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ECB84u)

/** \brief ECB84, ATOM9 Channel 7 Control Register in SOMB Mode */
#define GTM_ATOM9_CH7_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ECB84u)

/** \brief ECB84, ATOM9 Channel 7 Control Register in SOMC Mode */
#define GTM_ATOM9_CH7_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ECB84u)

/** \brief ECB84, ATOM9 Channel 7 Control Register in SOMI Mode */
#define GTM_ATOM9_CH7_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ECB84u)

/** \brief ECB84, ATOM9 Channel 7 Control Register in SOMP Mode */
#define GTM_ATOM9_CH7_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ECB84u)

/** \brief ECB84, ATOM9 Channel 7 Control Register in SOMS Mode */
#define GTM_ATOM9_CH7_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ECB84u)

/** \brief ECB88, ATOM9 Channel 7 CCU0 Compare Shadow Register */
#define GTM_ATOM9_CH7_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ECB88u)

/** \brief ECB8C, ATOM9 Channel 7 CCU1 Compare Shadow Register */
#define GTM_ATOM9_CH7_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ECB8Cu)

/** \brief ECB90, ATOM9 Channel 7 CCU0 Compare Register */
#define GTM_ATOM9_CH7_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ECB90u)

/** \brief ECB94, ATOM9 Channel 7 CCU1 Compare Register */
#define GTM_ATOM9_CH7_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ECB94u)

/** \brief ECB98, ATOM9 Channel 7 CCU0 Counter Register */
#define GTM_ATOM9_CH7_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ECB98u)

/** \brief ECB9C, ATOM9 Channel 7 Status Register */
#define GTM_ATOM9_CH7_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ECB9Cu)

/** \brief ECBA0, ATOM9 Channel 7 Interrupt Notification Register */
#define GTM_ATOM9_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ECBA0u)

/** \brief ECBA4, ATOM9 Channel 7 Interrupt Enable Register */
#define GTM_ATOM9_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ECBA4u)

/** \brief ECBA8, ATOM9 Channel 7 Software Interrupt Generation Register */
#define GTM_ATOM9_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ECBA8u)

/** \brief ECBAC, ATOM9 Channel 7 Interrupt Mode Configuration Register */
#define GTM_ATOM9_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ECBACu)

/** \brief ED000, ATOM10 Channel 0 ARU read address Register */
#define GTM_ATOM10_CH0_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ED000u)

/** \brief ED004, ATOM10 Channel 0 Control Register */
#define GTM_ATOM10_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ED004u)

