zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief ED104, ATOM10 Channel 2 Control Register in SOMS Mode */
#define GTM_ATOM10_CH2_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ED104u)

/** \brief ED108, ATOM10 Channel 2 CCU0 Compare Shadow Register */
#define GTM_ATOM10_CH2_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ED108u)

/** \brief ED10C, ATOM10 Channel 2 CCU1 Compare Shadow Register */
#define GTM_ATOM10_CH2_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ED10Cu)

/** \brief ED110, ATOM10 Channel 2 CCU0 Compare Register */
#define GTM_ATOM10_CH2_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ED110u)

/** \brief ED114, ATOM10 Channel 2 CCU1 Compare Register */
#define GTM_ATOM10_CH2_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ED114u)

/** \brief ED118, ATOM10 Channel 2 CCU0 Counter Register */
#define GTM_ATOM10_CH2_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ED118u)

/** \brief ED11C, ATOM10 Channel 2 Status Register */
#define GTM_ATOM10_CH2_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ED11Cu)

/** \brief ED120, ATOM10 Channel 2 Interrupt Notification Register */
#define GTM_ATOM10_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ED120u)

/** \brief ED124, ATOM10 Channel 2 Interrupt Enable Register */
#define GTM_ATOM10_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ED124u)

/** \brief ED128, ATOM10 Channel 2 Software Interrupt Generation Register */
#define GTM_ATOM10_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ED128u)

/** \brief ED12C, ATOM10 Channel 2 Interrupt Mode Configuration Register */
#define GTM_ATOM10_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ED12Cu)

/** \brief ED180, ATOM10 Channel 3 ARU read address Register */
#define GTM_ATOM10_CH3_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ED180u)

/** \brief ED184, ATOM10 Channel 3 Control Register */
#define GTM_ATOM10_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ED184u)

/** \brief ED184, ATOM10 Channel 3 Control Register in SOMB Mode */
#define GTM_ATOM10_CH3_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ED184u)

/** \brief ED184, ATOM10 Channel 3 Control Register in SOMC Mode */
#define GTM_ATOM10_CH3_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ED184u)

/** \brief ED184, ATOM10 Channel 3 Control Register in SOMI Mode */
#define GTM_ATOM10_CH3_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ED184u)

/** \brief ED184, ATOM10 Channel 3 Control Register in SOMP Mode */
#define GTM_ATOM10_CH3_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ED184u)

/** \brief ED184, ATOM10 Channel 3 Control Register in SOMS Mode */
#define GTM_ATOM10_CH3_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ED184u)

/** \brief ED188, ATOM10 Channel 3 CCU0 Compare Shadow Register */
#define GTM_ATOM10_CH3_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ED188u)

/** \brief ED18C, ATOM10 Channel 3 CCU1 Compare Shadow Register */
#define GTM_ATOM10_CH3_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ED18Cu)

/** \brief ED190, ATOM10 Channel 3 CCU0 Compare Register */
#define GTM_ATOM10_CH3_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ED190u)

/** \brief ED194, ATOM10 Channel 3 CCU1 Compare Register */
#define GTM_ATOM10_CH3_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ED194u)

/** \brief ED198, ATOM10 Channel 3 CCU0 Counter Register */
#define GTM_ATOM10_CH3_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ED198u)

/** \brief ED19C, ATOM10 Channel 3 Status Register */
#define GTM_ATOM10_CH3_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ED19Cu)

/** \brief ED1A0, ATOM10 Channel 3 Interrupt Notification Register */
#define GTM_ATOM10_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ED1A0u)

/** \brief ED1A4, ATOM10 Channel 3 Interrupt Enable Register */
#define GTM_ATOM10_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ED1A4u)

/** \brief ED1A8, ATOM10 Channel 3 Software Interrupt Generation Register */
#define GTM_ATOM10_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ED1A8u)

/** \brief ED1AC, ATOM10 Channel 3 Interrupt Mode Configuration Register */
#define GTM_ATOM10_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ED1ACu)

/** \brief ED200, ATOM10 Channel 4 ARU read address Register */
#define GTM_ATOM10_CH4_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ED200u)

/** \brief ED204, ATOM10 Channel 4 Control Register */
#define GTM_ATOM10_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ED204u)

/** \brief ED204, ATOM10 Channel 4 Control Register in SOMB Mode */
#define GTM_ATOM10_CH4_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ED204u)

/** \brief ED204, ATOM10 Channel 4 Control Register in SOMC Mode */
#define GTM_ATOM10_CH4_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ED204u)

/** \brief ED204, ATOM10 Channel 4 Control Register in SOMI Mode */
#define GTM_ATOM10_CH4_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ED204u)

/** \brief ED204, ATOM10 Channel 4 Control Register in SOMP Mode */
#define GTM_ATOM10_CH4_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ED204u)

/** \brief ED204, ATOM10 Channel 4 Control Register in SOMS Mode */
#define GTM_ATOM10_CH4_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ED204u)

/** \brief ED208, ATOM10 Channel 4 CCU0 Compare Shadow Register */
#define GTM_ATOM10_CH4_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ED208u)

