zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief ED82C, ATOM11 Channel 0 Interrupt Mode Configuration Register */
#define GTM_ATOM11_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ED82Cu)

/** \brief ED840, ATOM11 AGC Global Control Register */
#define GTM_ATOM11_AGC_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF01ED840u)

/** \brief ED844, ATOM11 AGC Enable/Disable Control Register */
#define GTM_ATOM11_AGC_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF01ED844u)

/** \brief ED848, ATOM11 AGC Enable/Disable Status Register */
#define GTM_ATOM11_AGC_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF01ED848u)

/** \brief ED84C, ATOM11 AGC Action Time Base Register */
#define GTM_ATOM11_AGC_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF01ED84Cu)

/** \brief ED850, ATOM11 AGC Output Enable Control Register */
#define GTM_ATOM11_AGC_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF01ED850u)

/** \brief ED854, ATOM11 AGC Output Enable Status Register */
#define GTM_ATOM11_AGC_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF01ED854u)

/** \brief ED858, ATOM11 AGC Force Update Control Register */
#define GTM_ATOM11_AGC_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF01ED858u)

/** \brief ED85C, ATOM11 AGC Internal Trigger Control Register */
#define GTM_ATOM11_AGC_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF01ED85Cu)

/** \brief ED880, ATOM11 Channel 1 ARU read address Register */
#define GTM_ATOM11_CH1_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ED880u)

/** \brief ED884, ATOM11 Channel 1 Control Register */
#define GTM_ATOM11_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ED884u)

/** \brief ED884, ATOM11 Channel 1 Control Register in SOMB Mode */
#define GTM_ATOM11_CH1_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ED884u)

/** \brief ED884, ATOM11 Channel 1 Control Register in SOMC Mode */
#define GTM_ATOM11_CH1_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ED884u)

/** \brief ED884, ATOM11 Channel 1 Control Register in SOMI Mode */
#define GTM_ATOM11_CH1_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ED884u)

/** \brief ED884, ATOM11 Channel 1 Control Register in SOMP Mode */
#define GTM_ATOM11_CH1_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ED884u)

/** \brief ED884, ATOM11 Channel 1 Control Register in SOMS Mode */
#define GTM_ATOM11_CH1_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ED884u)

/** \brief ED888, ATOM11 Channel 1 CCU0 Compare Shadow Register */
#define GTM_ATOM11_CH1_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ED888u)

/** \brief ED88C, ATOM11 Channel 1 CCU1 Compare Shadow Register */
#define GTM_ATOM11_CH1_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ED88Cu)

/** \brief ED890, ATOM11 Channel 1 CCU0 Compare Register */
#define GTM_ATOM11_CH1_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ED890u)

/** \brief ED894, ATOM11 Channel 1 CCU1 Compare Register */
#define GTM_ATOM11_CH1_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ED894u)

/** \brief ED898, ATOM11 Channel 1 CCU0 Counter Register */
#define GTM_ATOM11_CH1_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ED898u)

/** \brief ED89C, ATOM11 Channel 1 Status Register */
#define GTM_ATOM11_CH1_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ED89Cu)

/** \brief ED8A0, ATOM11 Channel 1 Interrupt Notification Register */
#define GTM_ATOM11_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ED8A0u)

/** \brief ED8A4, ATOM11 Channel 1 Interrupt Enable Register */
#define GTM_ATOM11_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ED8A4u)

/** \brief ED8A8, ATOM11 Channel 1 Software Interrupt Generation Register */
#define GTM_ATOM11_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ED8A8u)

/** \brief ED8AC, ATOM11 Channel 1 Interrupt Mode Configuration Register */
#define GTM_ATOM11_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ED8ACu)

/** \brief ED900, ATOM11 Channel 2 ARU read address Register */
#define GTM_ATOM11_CH2_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ED900u)

/** \brief ED904, ATOM11 Channel 2 Control Register */
#define GTM_ATOM11_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ED904u)

/** \brief ED904, ATOM11 Channel 2 Control Register in SOMB Mode */
#define GTM_ATOM11_CH2_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ED904u)

/** \brief ED904, ATOM11 Channel 2 Control Register in SOMC Mode */
#define GTM_ATOM11_CH2_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ED904u)

/** \brief ED904, ATOM11 Channel 2 Control Register in SOMI Mode */
#define GTM_ATOM11_CH2_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ED904u)

/** \brief ED904, ATOM11 Channel 2 Control Register in SOMP Mode */
#define GTM_ATOM11_CH2_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ED904u)

/** \brief ED904, ATOM11 Channel 2 Control Register in SOMS Mode */
#define GTM_ATOM11_CH2_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ED904u)

/** \brief ED908, ATOM11 Channel 2 CCU0 Compare Shadow Register */
#define GTM_ATOM11_CH2_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ED908u)

/** \brief ED90C, ATOM11 Channel 2 CCU1 Compare Shadow Register */
#define GTM_ATOM11_CH2_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ED90Cu)

/** \brief ED910, ATOM11 Channel 2 CCU0 Compare Register */
#define GTM_ATOM11_CH2_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ED910u)

/** \brief ED914, ATOM11 Channel 2 CCU1 Compare Register */
#define GTM_ATOM11_CH2_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ED914u)

/** \brief ED918, ATOM11 Channel 2 CCU0 Counter Register */
#define GTM_ATOM11_CH2_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ED918u)

/** \brief ED91C, ATOM11 Channel 2 Status Register */
#define GTM_ATOM11_CH2_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ED91Cu)

/** \brief ED920, ATOM11 Channel 2 Interrupt Notification Register */
#define GTM_ATOM11_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ED920u)

/** \brief ED924, ATOM11 Channel 2 Interrupt Enable Register */
#define GTM_ATOM11_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ED924u)

