zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief F31BC, MCS3 Channel 3 Memory High Byte Register */
#define GTM_MCS3_CH3_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F31BCu)

/** \brief F31C0, MCS3 Channel 3 Program Counter Register */
#define GTM_MCS3_CH3_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F31C0u)

/** \brief F31C4, MCS3 Channel 3 Interrupt Notification Register */
#define GTM_MCS3_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F31C4u)

/** \brief F31C8, MCS3 Channel 3 Interrupt Enable Register */
#define GTM_MCS3_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F31C8u)

/** \brief F31CC, MCS3 Channel 3 Force Interrupt Register */
#define GTM_MCS3_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F31CCu)

/** \brief F31D0, MCS3 Channel 3 Interrupt Mode Configuration Register */
#define GTM_MCS3_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F31D0u)

/** \brief F31D4, MCS3 Channel 3 Error Interrupt Enable Register */
#define GTM_MCS3_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F31D4u)

/** \brief F3200, MCS3 Channel 4 General Purpose Register 0 */
#define GTM_MCS3_CH4_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3200u)

/** \brief F3204, MCS3 Channel 4 General Purpose Register 1 */
#define GTM_MCS3_CH4_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3204u)

/** \brief F3208, MCS3 Channel 4 General Purpose Register 2 */
#define GTM_MCS3_CH4_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3208u)

/** \brief F320C, MCS3 Channel 4 General Purpose Register 3 */
#define GTM_MCS3_CH4_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F320Cu)

/** \brief F3210, MCS3 Channel 4 General Purpose Register 4 */
#define GTM_MCS3_CH4_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3210u)

/** \brief F3214, MCS3 Channel 4 General Purpose Register 5 */
#define GTM_MCS3_CH4_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3214u)

/** \brief F3218, MCS3 Channel 4 General Purpose Register 6 */
#define GTM_MCS3_CH4_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3218u)

/** \brief F321C, MCS3 Channel 4 General Purpose Register 7 */
#define GTM_MCS3_CH4_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F321Cu)

/** \brief F3220, MCS3 Channel 4 Control Register */
#define GTM_MCS3_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F3220u)

/** \brief F3224, MCS3 Channel 4 ARU Control Bit Register */
#define GTM_MCS3_CH4_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F3224u)

/** \brief F323C, MCS3 Channel 4 Memory High Byte Register */
#define GTM_MCS3_CH4_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F323Cu)

/** \brief F3240, MCS3 Channel 4 Program Counter Register */
#define GTM_MCS3_CH4_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F3240u)

/** \brief F3244, MCS3 Channel 4 Interrupt Notification Register */
#define GTM_MCS3_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F3244u)

/** \brief F3248, MCS3 Channel 4 Interrupt Enable Register */
#define GTM_MCS3_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F3248u)

/** \brief F324C, MCS3 Channel 4 Force Interrupt Register */
#define GTM_MCS3_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F324Cu)

/** \brief F3250, MCS3 Channel 4 Interrupt Mode Configuration Register */
#define GTM_MCS3_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F3250u)

/** \brief F3254, MCS3 Channel 4 Error Interrupt Enable Register */
#define GTM_MCS3_CH4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F3254u)

/** \brief F3280, MCS3 Channel 5 General Purpose Register 0 */
#define GTM_MCS3_CH5_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3280u)

/** \brief F3284, MCS3 Channel 5 General Purpose Register 1 */
#define GTM_MCS3_CH5_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3284u)

/** \brief F3288, MCS3 Channel 5 General Purpose Register 2 */
#define GTM_MCS3_CH5_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3288u)

/** \brief F328C, MCS3 Channel 5 General Purpose Register 3 */
#define GTM_MCS3_CH5_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F328Cu)

/** \brief F3290, MCS3 Channel 5 General Purpose Register 4 */
#define GTM_MCS3_CH5_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3290u)

/** \brief F3294, MCS3 Channel 5 General Purpose Register 5 */
#define GTM_MCS3_CH5_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3294u)

/** \brief F3298, MCS3 Channel 5 General Purpose Register 6 */
#define GTM_MCS3_CH5_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3298u)

/** \brief F329C, MCS3 Channel 5 General Purpose Register 7 */
#define GTM_MCS3_CH5_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F329Cu)

/** \brief F32A0, MCS3 Channel 5 Control Register */
#define GTM_MCS3_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F32A0u)

/** \brief F32A4, MCS3 Channel 5 ARU Control Bit Register */
#define GTM_MCS3_CH5_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F32A4u)

/** \brief F32BC, MCS3 Channel 5 Memory High Byte Register */
#define GTM_MCS3_CH5_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F32BCu)

/** \brief F32C0, MCS3 Channel 5 Program Counter Register */
#define GTM_MCS3_CH5_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F32C0u)

/** \brief F32C4, MCS3 Channel 5 Interrupt Notification Register */
#define GTM_MCS3_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F32C4u)

/** \brief F32C8, MCS3 Channel 5 Interrupt Enable Register */
#define GTM_MCS3_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F32C8u)

/** \brief F32CC, MCS3 Channel 5 Force Interrupt Register */
#define GTM_MCS3_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F32CCu)

