zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief F4388, MCS4 Channel 7 General Purpose Register 2 */
#define GTM_MCS4_CH7_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4388u)

/** \brief F438C, MCS4 Channel 7 General Purpose Register 3 */
#define GTM_MCS4_CH7_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F438Cu)

/** \brief F4390, MCS4 Channel 7 General Purpose Register 4 */
#define GTM_MCS4_CH7_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4390u)

/** \brief F4394, MCS4 Channel 7 General Purpose Register 5 */
#define GTM_MCS4_CH7_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4394u)

/** \brief F4398, MCS4 Channel 7 General Purpose Register 6 */
#define GTM_MCS4_CH7_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4398u)

/** \brief F439C, MCS4 Channel 7 General Purpose Register 7 */
#define GTM_MCS4_CH7_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F439Cu)

/** \brief F43A0, MCS4 Channel 7 Control Register */
#define GTM_MCS4_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F43A0u)

/** \brief F43A4, MCS4 Channel 7 ARU Control Bit Register */
#define GTM_MCS4_CH7_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F43A4u)

/** \brief F43BC, MCS4 Channel 7 Memory High Byte Register */
#define GTM_MCS4_CH7_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F43BCu)

/** \brief F43C0, MCS4 Channel 7 Program Counter Register */
#define GTM_MCS4_CH7_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F43C0u)

/** \brief F43C4, MCS4 Channel 7 Interrupt Notification Register */
#define GTM_MCS4_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F43C4u)

/** \brief F43C8, MCS4 Channel 7 Interrupt Enable Register */
#define GTM_MCS4_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F43C8u)

/** \brief F43CC, MCS4 Channel 7 Force Interrupt Register */
#define GTM_MCS4_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F43CCu)

/** \brief F43D0, MCS4 Channel 7 Interrupt Mode Configuration Register */
#define GTM_MCS4_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F43D0u)

/** \brief F43D4, MCS4 Channel 7 Error Interrupt Enable Register */
#define GTM_MCS4_CH7_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F43D4u)

/** \brief F5000, MCS5 Channel 0 General Purpose Register 0 */
#define GTM_MCS5_CH0_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5000u)

/** \brief F5004, MCS5 Channel 0 General Purpose Register 1 */
#define GTM_MCS5_CH0_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5004u)

/** \brief F5008, MCS5 Channel 0 General Purpose Register 2 */
#define GTM_MCS5_CH0_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5008u)

/** \brief F500C, MCS5 Channel 0 General Purpose Register 3 */
#define GTM_MCS5_CH0_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F500Cu)

/** \brief F5010, MCS5 Channel 0 General Purpose Register 4 */
#define GTM_MCS5_CH0_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5010u)

/** \brief F5014, MCS5 Channel 0 General Purpose Register 5 */
#define GTM_MCS5_CH0_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5014u)

/** \brief F5018, MCS5 Channel 0 General Purpose Register 6 */
#define GTM_MCS5_CH0_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5018u)

/** \brief F501C, MCS5 Channel 0 General Purpose Register 7 */
#define GTM_MCS5_CH0_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F501Cu)

/** \brief F5020, MCS5 Channel 0 Control Register */
#define GTM_MCS5_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F5020u)

/** \brief F5024, MCS5 Channel 0 ARU Control Bit Register */
#define GTM_MCS5_CH0_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F5024u)

/** \brief F5028, MCS5 Clear Trigger Control Register */
#define GTM_MCS5_CH0_CTRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRG*)0xF01F5028u)
/** Alias (User Manual Name) for GTM_MCS5_CH0_CTRG.
* To use register names with standard convension, please use GTM_MCS5_CH0_CTRG.
*/
#define GTM_MCS5_CTRG (GTM_MCS5_CH0_CTRG)

/** \brief F502C, MCS5 Set Trigger Control Register */
#define GTM_MCS5_CH0_STRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_STRG*)0xF01F502Cu)
/** Alias (User Manual Name) for GTM_MCS5_CH0_STRG.
* To use register names with standard convension, please use GTM_MCS5_CH0_STRG.
*/
#define GTM_MCS5_STRG (GTM_MCS5_CH0_STRG)

/** \brief F503C, MCS5 Channel 0 Memory High Byte Register */
#define GTM_MCS5_CH0_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F503Cu)

/** \brief F5040, MCS5 Channel 0 Program Counter Register */
#define GTM_MCS5_CH0_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F5040u)

/** \brief F5044, MCS5 Channel 0 Interrupt Notification Register */
#define GTM_MCS5_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F5044u)

/** \brief F5048, MCS5 Channel 0 Interrupt Enable Register */
#define GTM_MCS5_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F5048u)

/** \brief F504C, MCS5 Channel 0 Force Interrupt Register */
#define GTM_MCS5_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F504Cu)

/** \brief F5050, MCS5 Channel 0 Interrupt Mode Configuration Register */
#define GTM_MCS5_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F5050u)

/** \brief F5054, MCS5 Channel 0 Error Interrupt Enable Register */
#define GTM_MCS5_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F5054u)

/** \brief F5060, MCS5 Write Protection Register */
#define GTM_MCS5_REG_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_REG_PROT*)0xF01F5060u)

/** \brief F5064, MCS5 Control and Status Register */
#define GTM_MCS5_CTRL_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT*)0xF01F5064u)

/** \brief F5068, MCS5 Reset Register */
#define GTM_MCS5_RESET /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_RESET*)0xF01F5068u)

/** \brief F506C, MCS5 Cancel ARU Transfer Instruction Register */
#define GTM_MCS5_CAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CAT*)0xF01F506Cu)

