zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief F5070, MCS5 Cancel WURM Instruction Register */
#define GTM_MCS5_CWT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CWT*)0xF01F5070u)

/** \brief F507C, MCS5 error register */
#define GTM_MCS5_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_ERR*)0xF01F507Cu)

/** \brief F5080, MCS5 Channel 1 General Purpose Register 0 */
#define GTM_MCS5_CH1_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5080u)

/** \brief F5084, MCS5 Channel 1 General Purpose Register 1 */
#define GTM_MCS5_CH1_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5084u)

/** \brief F5088, MCS5 Channel 1 General Purpose Register 2 */
#define GTM_MCS5_CH1_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5088u)

/** \brief F508C, MCS5 Channel 1 General Purpose Register 3 */
#define GTM_MCS5_CH1_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F508Cu)

/** \brief F5090, MCS5 Channel 1 General Purpose Register 4 */
#define GTM_MCS5_CH1_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5090u)

/** \brief F5094, MCS5 Channel 1 General Purpose Register 5 */
#define GTM_MCS5_CH1_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5094u)

/** \brief F5098, MCS5 Channel 1 General Purpose Register 6 */
#define GTM_MCS5_CH1_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5098u)

/** \brief F509C, MCS5 Channel 1 General Purpose Register 7 */
#define GTM_MCS5_CH1_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F509Cu)

/** \brief F50A0, MCS5 Channel 1 Control Register */
#define GTM_MCS5_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F50A0u)

/** \brief F50A4, MCS5 Channel 1 ARU Control Bit Register */
#define GTM_MCS5_CH1_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F50A4u)

/** \brief F50BC, MCS5 Channel 1 Memory High Byte Register */
#define GTM_MCS5_CH1_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F50BCu)

/** \brief F50C0, MCS5 Channel 1 Program Counter Register */
#define GTM_MCS5_CH1_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F50C0u)

/** \brief F50C4, MCS5 Channel 1 Interrupt Notification Register */
#define GTM_MCS5_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F50C4u)

/** \brief F50C8, MCS5 Channel 1 Interrupt Enable Register */
#define GTM_MCS5_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F50C8u)

/** \brief F50CC, MCS5 Channel 1 Force Interrupt Register */
#define GTM_MCS5_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F50CCu)

/** \brief F50D0, MCS5 Channel 1 Interrupt Mode Configuration Register */
#define GTM_MCS5_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F50D0u)

/** \brief F50D4, MCS5 Channel 1 Error Interrupt Enable Register */
#define GTM_MCS5_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F50D4u)

/** \brief F5100, MCS5 Channel 2 General Purpose Register 0 */
#define GTM_MCS5_CH2_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5100u)

/** \brief F5104, MCS5 Channel 2 General Purpose Register 1 */
#define GTM_MCS5_CH2_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5104u)

/** \brief F5108, MCS5 Channel 2 General Purpose Register 2 */
#define GTM_MCS5_CH2_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5108u)

/** \brief F510C, MCS5 Channel 2 General Purpose Register 3 */
#define GTM_MCS5_CH2_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F510Cu)

/** \brief F5110, MCS5 Channel 2 General Purpose Register 4 */
#define GTM_MCS5_CH2_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5110u)

/** \brief F5114, MCS5 Channel 2 General Purpose Register 5 */
#define GTM_MCS5_CH2_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5114u)

/** \brief F5118, MCS5 Channel 2 General Purpose Register 6 */
#define GTM_MCS5_CH2_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5118u)

/** \brief F511C, MCS5 Channel 2 General Purpose Register 7 */
#define GTM_MCS5_CH2_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F511Cu)

/** \brief F5120, MCS5 Channel 2 Control Register */
#define GTM_MCS5_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F5120u)

/** \brief F5124, MCS5 Channel 2 ARU Control Bit Register */
#define GTM_MCS5_CH2_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F5124u)

/** \brief F513C, MCS5 Channel 2 Memory High Byte Register */
#define GTM_MCS5_CH2_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F513Cu)

/** \brief F5140, MCS5 Channel 2 Program Counter Register */
#define GTM_MCS5_CH2_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F5140u)

/** \brief F5144, MCS5 Channel 2 Interrupt Notification Register */
#define GTM_MCS5_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F5144u)

/** \brief F5148, MCS5 Channel 2 Interrupt Enable Register */
#define GTM_MCS5_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F5148u)

/** \brief F514C, MCS5 Channel 2 Force Interrupt Register */
#define GTM_MCS5_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F514Cu)

/** \brief F5150, MCS5 Channel 2 Interrupt Mode Configuration Register */
#define GTM_MCS5_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F5150u)

/** \brief F5154, MCS5 Channel 2 Error Interrupt Enable Register */
#define GTM_MCS5_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F5154u)

/** \brief F5180, MCS5 Channel 3 General Purpose Register 0 */
#define GTM_MCS5_CH3_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5180u)

/** \brief F5184, MCS5 Channel 3 General Purpose Register 1 */
#define GTM_MCS5_CH3_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5184u)

/** \brief F5188, MCS5 Channel 3 General Purpose Register 2 */
#define GTM_MCS5_CH3_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5188u)

