zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief F518C, MCS5 Channel 3 General Purpose Register 3 */
#define GTM_MCS5_CH3_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F518Cu)

/** \brief F5190, MCS5 Channel 3 General Purpose Register 4 */
#define GTM_MCS5_CH3_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5190u)

/** \brief F5194, MCS5 Channel 3 General Purpose Register 5 */
#define GTM_MCS5_CH3_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5194u)

/** \brief F5198, MCS5 Channel 3 General Purpose Register 6 */
#define GTM_MCS5_CH3_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5198u)

/** \brief F519C, MCS5 Channel 3 General Purpose Register 7 */
#define GTM_MCS5_CH3_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F519Cu)

/** \brief F51A0, MCS5 Channel 3 Control Register */
#define GTM_MCS5_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F51A0u)

/** \brief F51A4, MCS5 Channel 3 ARU Control Bit Register */
#define GTM_MCS5_CH3_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F51A4u)

/** \brief F51BC, MCS5 Channel 3 Memory High Byte Register */
#define GTM_MCS5_CH3_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F51BCu)

/** \brief F51C0, MCS5 Channel 3 Program Counter Register */
#define GTM_MCS5_CH3_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F51C0u)

/** \brief F51C4, MCS5 Channel 3 Interrupt Notification Register */
#define GTM_MCS5_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F51C4u)

/** \brief F51C8, MCS5 Channel 3 Interrupt Enable Register */
#define GTM_MCS5_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F51C8u)

/** \brief F51CC, MCS5 Channel 3 Force Interrupt Register */
#define GTM_MCS5_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F51CCu)

/** \brief F51D0, MCS5 Channel 3 Interrupt Mode Configuration Register */
#define GTM_MCS5_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F51D0u)

/** \brief F51D4, MCS5 Channel 3 Error Interrupt Enable Register */
#define GTM_MCS5_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F51D4u)

/** \brief F5200, MCS5 Channel 4 General Purpose Register 0 */
#define GTM_MCS5_CH4_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5200u)

/** \brief F5204, MCS5 Channel 4 General Purpose Register 1 */
#define GTM_MCS5_CH4_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5204u)

/** \brief F5208, MCS5 Channel 4 General Purpose Register 2 */
#define GTM_MCS5_CH4_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5208u)

/** \brief F520C, MCS5 Channel 4 General Purpose Register 3 */
#define GTM_MCS5_CH4_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F520Cu)

/** \brief F5210, MCS5 Channel 4 General Purpose Register 4 */
#define GTM_MCS5_CH4_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5210u)

/** \brief F5214, MCS5 Channel 4 General Purpose Register 5 */
#define GTM_MCS5_CH4_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5214u)

/** \brief F5218, MCS5 Channel 4 General Purpose Register 6 */
#define GTM_MCS5_CH4_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5218u)

/** \brief F521C, MCS5 Channel 4 General Purpose Register 7 */
#define GTM_MCS5_CH4_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F521Cu)

/** \brief F5220, MCS5 Channel 4 Control Register */
#define GTM_MCS5_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F5220u)

/** \brief F5224, MCS5 Channel 4 ARU Control Bit Register */
#define GTM_MCS5_CH4_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F5224u)

/** \brief F523C, MCS5 Channel 4 Memory High Byte Register */
#define GTM_MCS5_CH4_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F523Cu)

/** \brief F5240, MCS5 Channel 4 Program Counter Register */
#define GTM_MCS5_CH4_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F5240u)

/** \brief F5244, MCS5 Channel 4 Interrupt Notification Register */
#define GTM_MCS5_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F5244u)

/** \brief F5248, MCS5 Channel 4 Interrupt Enable Register */
#define GTM_MCS5_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F5248u)

/** \brief F524C, MCS5 Channel 4 Force Interrupt Register */
#define GTM_MCS5_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F524Cu)

/** \brief F5250, MCS5 Channel 4 Interrupt Mode Configuration Register */
#define GTM_MCS5_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F5250u)

/** \brief F5254, MCS5 Channel 4 Error Interrupt Enable Register */
#define GTM_MCS5_CH4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F5254u)

/** \brief F5280, MCS5 Channel 5 General Purpose Register 0 */
#define GTM_MCS5_CH5_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5280u)

/** \brief F5284, MCS5 Channel 5 General Purpose Register 1 */
#define GTM_MCS5_CH5_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5284u)

/** \brief F5288, MCS5 Channel 5 General Purpose Register 2 */
#define GTM_MCS5_CH5_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5288u)

/** \brief F528C, MCS5 Channel 5 General Purpose Register 3 */
#define GTM_MCS5_CH5_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F528Cu)

/** \brief F5290, MCS5 Channel 5 General Purpose Register 4 */
#define GTM_MCS5_CH5_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5290u)

/** \brief F5294, MCS5 Channel 5 General Purpose Register 5 */
#define GTM_MCS5_CH5_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5294u)

/** \brief F5298, MCS5 Channel 5 General Purpose Register 6 */
#define GTM_MCS5_CH5_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5298u)

/** \brief F529C, MCS5 Channel 5 General Purpose Register 7 */
#define GTM_MCS5_CH5_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F529Cu)

/** \brief F52A0, MCS5 Channel 5 Control Register */
#define GTM_MCS5_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F52A0u)

/** \brief F52A4, MCS5 Channel 5 ARU Control Bit Register */
#define GTM_MCS5_CH5_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F52A4u)

