zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief F52BC, MCS5 Channel 5 Memory High Byte Register */
#define GTM_MCS5_CH5_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F52BCu)

/** \brief F52C0, MCS5 Channel 5 Program Counter Register */
#define GTM_MCS5_CH5_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F52C0u)

/** \brief F52C4, MCS5 Channel 5 Interrupt Notification Register */
#define GTM_MCS5_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F52C4u)

/** \brief F52C8, MCS5 Channel 5 Interrupt Enable Register */
#define GTM_MCS5_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F52C8u)

/** \brief F52CC, MCS5 Channel 5 Force Interrupt Register */
#define GTM_MCS5_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F52CCu)

/** \brief F52D0, MCS5 Channel 5 Interrupt Mode Configuration Register */
#define GTM_MCS5_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F52D0u)

/** \brief F52D4, MCS5 Channel 5 Error Interrupt Enable Register */
#define GTM_MCS5_CH5_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F52D4u)

/** \brief F5300, MCS5 Channel 6 General Purpose Register 0 */
#define GTM_MCS5_CH6_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5300u)

/** \brief F5304, MCS5 Channel 6 General Purpose Register 1 */
#define GTM_MCS5_CH6_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5304u)

/** \brief F5308, MCS5 Channel 6 General Purpose Register 2 */
#define GTM_MCS5_CH6_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5308u)

/** \brief F530C, MCS5 Channel 6 General Purpose Register 3 */
#define GTM_MCS5_CH6_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F530Cu)

/** \brief F5310, MCS5 Channel 6 General Purpose Register 4 */
#define GTM_MCS5_CH6_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5310u)

/** \brief F5314, MCS5 Channel 6 General Purpose Register 5 */
#define GTM_MCS5_CH6_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5314u)

/** \brief F5318, MCS5 Channel 6 General Purpose Register 6 */
#define GTM_MCS5_CH6_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5318u)

/** \brief F531C, MCS5 Channel 6 General Purpose Register 7 */
#define GTM_MCS5_CH6_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F531Cu)

/** \brief F5320, MCS5 Channel 6 Control Register */
#define GTM_MCS5_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F5320u)

/** \brief F5324, MCS5 Channel 6 ARU Control Bit Register */
#define GTM_MCS5_CH6_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F5324u)

/** \brief F533C, MCS5 Channel 6 Memory High Byte Register */
#define GTM_MCS5_CH6_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F533Cu)

/** \brief F5340, MCS5 Channel 6 Program Counter Register */
#define GTM_MCS5_CH6_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F5340u)

/** \brief F5344, MCS5 Channel 6 Interrupt Notification Register */
#define GTM_MCS5_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F5344u)

/** \brief F5348, MCS5 Channel 6 Interrupt Enable Register */
#define GTM_MCS5_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F5348u)

/** \brief F534C, MCS5 Channel 6 Force Interrupt Register */
#define GTM_MCS5_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F534Cu)

/** \brief F5350, MCS5 Channel 6 Interrupt Mode Configuration Register */
#define GTM_MCS5_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F5350u)

/** \brief F5354, MCS5 Channel 6 Error Interrupt Enable Register */
#define GTM_MCS5_CH6_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F5354u)

/** \brief F5380, MCS5 Channel 7 General Purpose Register 0 */
#define GTM_MCS5_CH7_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5380u)

/** \brief F5384, MCS5 Channel 7 General Purpose Register 1 */
#define GTM_MCS5_CH7_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5384u)

/** \brief F5388, MCS5 Channel 7 General Purpose Register 2 */
#define GTM_MCS5_CH7_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5388u)

/** \brief F538C, MCS5 Channel 7 General Purpose Register 3 */
#define GTM_MCS5_CH7_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F538Cu)

/** \brief F5390, MCS5 Channel 7 General Purpose Register 4 */
#define GTM_MCS5_CH7_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5390u)

/** \brief F5394, MCS5 Channel 7 General Purpose Register 5 */
#define GTM_MCS5_CH7_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5394u)

/** \brief F5398, MCS5 Channel 7 General Purpose Register 6 */
#define GTM_MCS5_CH7_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F5398u)

/** \brief F539C, MCS5 Channel 7 General Purpose Register 7 */
#define GTM_MCS5_CH7_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F539Cu)

/** \brief F53A0, MCS5 Channel 7 Control Register */
#define GTM_MCS5_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F53A0u)

/** \brief F53A4, MCS5 Channel 7 ARU Control Bit Register */
#define GTM_MCS5_CH7_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F53A4u)

/** \brief F53BC, MCS5 Channel 7 Memory High Byte Register */
#define GTM_MCS5_CH7_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F53BCu)

/** \brief F53C0, MCS5 Channel 7 Program Counter Register */
#define GTM_MCS5_CH7_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F53C0u)

/** \brief F53C4, MCS5 Channel 7 Interrupt Notification Register */
#define GTM_MCS5_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F53C4u)

/** \brief F53C8, MCS5 Channel 7 Interrupt Enable Register */
#define GTM_MCS5_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F53C8u)

