zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief F53CC, MCS5 Channel 7 Force Interrupt Register */
#define GTM_MCS5_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F53CCu)

/** \brief F53D0, MCS5 Channel 7 Interrupt Mode Configuration Register */
#define GTM_MCS5_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F53D0u)

/** \brief F53D4, MCS5 Channel 7 Error Interrupt Enable Register */
#define GTM_MCS5_CH7_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F53D4u)

/** \brief F6000, MCS6 Channel 0 General Purpose Register 0 */
#define GTM_MCS6_CH0_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6000u)

/** \brief F6004, MCS6 Channel 0 General Purpose Register 1 */
#define GTM_MCS6_CH0_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6004u)

/** \brief F6008, MCS6 Channel 0 General Purpose Register 2 */
#define GTM_MCS6_CH0_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6008u)

/** \brief F600C, MCS6 Channel 0 General Purpose Register 3 */
#define GTM_MCS6_CH0_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F600Cu)

/** \brief F6010, MCS6 Channel 0 General Purpose Register 4 */
#define GTM_MCS6_CH0_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6010u)

/** \brief F6014, MCS6 Channel 0 General Purpose Register 5 */
#define GTM_MCS6_CH0_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6014u)

/** \brief F6018, MCS6 Channel 0 General Purpose Register 6 */
#define GTM_MCS6_CH0_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6018u)

/** \brief F601C, MCS6 Channel 0 General Purpose Register 7 */
#define GTM_MCS6_CH0_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F601Cu)

/** \brief F6020, MCS6 Channel 0 Control Register */
#define GTM_MCS6_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F6020u)

/** \brief F6024, MCS6 Channel 0 ARU Control Bit Register */
#define GTM_MCS6_CH0_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F6024u)

/** \brief F6028, MCS6 Clear Trigger Control Register */
#define GTM_MCS6_CH0_CTRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRG*)0xF01F6028u)
/** Alias (User Manual Name) for GTM_MCS6_CH0_CTRG.
* To use register names with standard convension, please use GTM_MCS6_CH0_CTRG.
*/
#define GTM_MCS6_CTRG (GTM_MCS6_CH0_CTRG)

/** \brief F602C, MCS6 Set Trigger Control Register */
#define GTM_MCS6_CH0_STRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_STRG*)0xF01F602Cu)
/** Alias (User Manual Name) for GTM_MCS6_CH0_STRG.
* To use register names with standard convension, please use GTM_MCS6_CH0_STRG.
*/
#define GTM_MCS6_STRG (GTM_MCS6_CH0_STRG)

/** \brief F603C, MCS6 Channel 0 Memory High Byte Register */
#define GTM_MCS6_CH0_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F603Cu)

/** \brief F6040, MCS6 Channel 0 Program Counter Register */
#define GTM_MCS6_CH0_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F6040u)

/** \brief F6044, MCS6 Channel 0 Interrupt Notification Register */
#define GTM_MCS6_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F6044u)

/** \brief F6048, MCS6 Channel 0 Interrupt Enable Register */
#define GTM_MCS6_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F6048u)

/** \brief F604C, MCS6 Channel 0 Force Interrupt Register */
#define GTM_MCS6_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F604Cu)

/** \brief F6050, MCS6 Channel 0 Interrupt Mode Configuration Register */
#define GTM_MCS6_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F6050u)

/** \brief F6054, MCS6 Channel 0 Error Interrupt Enable Register */
#define GTM_MCS6_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F6054u)

/** \brief F6060, MCS6 Write Protection Register */
#define GTM_MCS6_REG_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_REG_PROT*)0xF01F6060u)

/** \brief F6064, MCS6 Control and Status Register */
#define GTM_MCS6_CTRL_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT*)0xF01F6064u)

/** \brief F6068, MCS6 Reset Register */
#define GTM_MCS6_RESET /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_RESET*)0xF01F6068u)

/** \brief F606C, MCS6 Cancel ARU Transfer Instruction Register */
#define GTM_MCS6_CAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CAT*)0xF01F606Cu)

/** \brief F6070, MCS6 Cancel WURM Instruction Register */
#define GTM_MCS6_CWT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CWT*)0xF01F6070u)

/** \brief F607C, MCS6 error register */
#define GTM_MCS6_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_ERR*)0xF01F607Cu)

/** \brief F6080, MCS6 Channel 1 General Purpose Register 0 */
#define GTM_MCS6_CH1_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6080u)

/** \brief F6084, MCS6 Channel 1 General Purpose Register 1 */
#define GTM_MCS6_CH1_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6084u)

/** \brief F6088, MCS6 Channel 1 General Purpose Register 2 */
#define GTM_MCS6_CH1_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6088u)

/** \brief F608C, MCS6 Channel 1 General Purpose Register 3 */
#define GTM_MCS6_CH1_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F608Cu)

/** \brief F6090, MCS6 Channel 1 General Purpose Register 4 */
#define GTM_MCS6_CH1_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6090u)

/** \brief F6094, MCS6 Channel 1 General Purpose Register 5 */
#define GTM_MCS6_CH1_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6094u)

/** \brief F6098, MCS6 Channel 1 General Purpose Register 6 */
#define GTM_MCS6_CH1_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6098u)

/** \brief F609C, MCS6 Channel 1 General Purpose Register 7 */
#define GTM_MCS6_CH1_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F609Cu)

/** \brief F60A0, MCS6 Channel 1 Control Register */
#define GTM_MCS6_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F60A0u)

/** \brief F60A4, MCS6 Channel 1 ARU Control Bit Register */
#define GTM_MCS6_CH1_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F60A4u)

