zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief F7048, MCS7 Channel 0 Interrupt Enable Register */
#define GTM_MCS7_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F7048u)

/** \brief F704C, MCS7 Channel 0 Force Interrupt Register */
#define GTM_MCS7_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F704Cu)

/** \brief F7050, MCS7 Channel 0 Interrupt Mode Configuration Register */
#define GTM_MCS7_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F7050u)

/** \brief F7054, MCS7 Channel 0 Error Interrupt Enable Register */
#define GTM_MCS7_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F7054u)

/** \brief F7060, MCS7 Write Protection Register */
#define GTM_MCS7_REG_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_REG_PROT*)0xF01F7060u)

/** \brief F7064, MCS7 Control and Status Register */
#define GTM_MCS7_CTRL_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT*)0xF01F7064u)

/** \brief F7068, MCS7 Reset Register */
#define GTM_MCS7_RESET /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_RESET*)0xF01F7068u)

/** \brief F706C, MCS7 Cancel ARU Transfer Instruction Register */
#define GTM_MCS7_CAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CAT*)0xF01F706Cu)

/** \brief F7070, MCS7 Cancel WURM Instruction Register */
#define GTM_MCS7_CWT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CWT*)0xF01F7070u)

/** \brief F707C, MCS7 error register */
#define GTM_MCS7_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_ERR*)0xF01F707Cu)

/** \brief F7080, MCS7 Channel 1 General Purpose Register 0 */
#define GTM_MCS7_CH1_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7080u)

/** \brief F7084, MCS7 Channel 1 General Purpose Register 1 */
#define GTM_MCS7_CH1_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7084u)

/** \brief F7088, MCS7 Channel 1 General Purpose Register 2 */
#define GTM_MCS7_CH1_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7088u)

/** \brief F708C, MCS7 Channel 1 General Purpose Register 3 */
#define GTM_MCS7_CH1_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F708Cu)

/** \brief F7090, MCS7 Channel 1 General Purpose Register 4 */
#define GTM_MCS7_CH1_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7090u)

/** \brief F7094, MCS7 Channel 1 General Purpose Register 5 */
#define GTM_MCS7_CH1_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7094u)

/** \brief F7098, MCS7 Channel 1 General Purpose Register 6 */
#define GTM_MCS7_CH1_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7098u)

/** \brief F709C, MCS7 Channel 1 General Purpose Register 7 */
#define GTM_MCS7_CH1_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F709Cu)

/** \brief F70A0, MCS7 Channel 1 Control Register */
#define GTM_MCS7_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F70A0u)

/** \brief F70A4, MCS7 Channel 1 ARU Control Bit Register */
#define GTM_MCS7_CH1_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F70A4u)

/** \brief F70BC, MCS7 Channel 1 Memory High Byte Register */
#define GTM_MCS7_CH1_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F70BCu)

/** \brief F70C0, MCS7 Channel 1 Program Counter Register */
#define GTM_MCS7_CH1_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F70C0u)

/** \brief F70C4, MCS7 Channel 1 Interrupt Notification Register */
#define GTM_MCS7_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F70C4u)

/** \brief F70C8, MCS7 Channel 1 Interrupt Enable Register */
#define GTM_MCS7_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F70C8u)

/** \brief F70CC, MCS7 Channel 1 Force Interrupt Register */
#define GTM_MCS7_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F70CCu)

/** \brief F70D0, MCS7 Channel 1 Interrupt Mode Configuration Register */
#define GTM_MCS7_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F70D0u)

/** \brief F70D4, MCS7 Channel 1 Error Interrupt Enable Register */
#define GTM_MCS7_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F70D4u)

/** \brief F7100, MCS7 Channel 2 General Purpose Register 0 */
#define GTM_MCS7_CH2_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7100u)

/** \brief F7104, MCS7 Channel 2 General Purpose Register 1 */
#define GTM_MCS7_CH2_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7104u)

/** \brief F7108, MCS7 Channel 2 General Purpose Register 2 */
#define GTM_MCS7_CH2_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7108u)

/** \brief F710C, MCS7 Channel 2 General Purpose Register 3 */
#define GTM_MCS7_CH2_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F710Cu)

/** \brief F7110, MCS7 Channel 2 General Purpose Register 4 */
#define GTM_MCS7_CH2_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7110u)

/** \brief F7114, MCS7 Channel 2 General Purpose Register 5 */
#define GTM_MCS7_CH2_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7114u)

/** \brief F7118, MCS7 Channel 2 General Purpose Register 6 */
#define GTM_MCS7_CH2_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7118u)

/** \brief F711C, MCS7 Channel 2 General Purpose Register 7 */
#define GTM_MCS7_CH2_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F711Cu)

/** \brief F7120, MCS7 Channel 2 Control Register */
#define GTM_MCS7_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F7120u)

/** \brief F7124, MCS7 Channel 2 ARU Control Bit Register */
#define GTM_MCS7_CH2_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F7124u)

/** \brief F713C, MCS7 Channel 2 Memory High Byte Register */
#define GTM_MCS7_CH2_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F713Cu)

/** \brief F7140, MCS7 Channel 2 Program Counter Register */
#define GTM_MCS7_CH2_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F7140u)

