zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief F7144, MCS7 Channel 2 Interrupt Notification Register */
#define GTM_MCS7_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F7144u)

/** \brief F7148, MCS7 Channel 2 Interrupt Enable Register */
#define GTM_MCS7_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F7148u)

/** \brief F714C, MCS7 Channel 2 Force Interrupt Register */
#define GTM_MCS7_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F714Cu)

/** \brief F7150, MCS7 Channel 2 Interrupt Mode Configuration Register */
#define GTM_MCS7_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F7150u)

/** \brief F7154, MCS7 Channel 2 Error Interrupt Enable Register */
#define GTM_MCS7_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F7154u)

/** \brief F7180, MCS7 Channel 3 General Purpose Register 0 */
#define GTM_MCS7_CH3_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7180u)

/** \brief F7184, MCS7 Channel 3 General Purpose Register 1 */
#define GTM_MCS7_CH3_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7184u)

/** \brief F7188, MCS7 Channel 3 General Purpose Register 2 */
#define GTM_MCS7_CH3_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7188u)

/** \brief F718C, MCS7 Channel 3 General Purpose Register 3 */
#define GTM_MCS7_CH3_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F718Cu)

/** \brief F7190, MCS7 Channel 3 General Purpose Register 4 */
#define GTM_MCS7_CH3_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7190u)

/** \brief F7194, MCS7 Channel 3 General Purpose Register 5 */
#define GTM_MCS7_CH3_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7194u)

/** \brief F7198, MCS7 Channel 3 General Purpose Register 6 */
#define GTM_MCS7_CH3_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7198u)

/** \brief F719C, MCS7 Channel 3 General Purpose Register 7 */
#define GTM_MCS7_CH3_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F719Cu)

/** \brief F71A0, MCS7 Channel 3 Control Register */
#define GTM_MCS7_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F71A0u)

/** \brief F71A4, MCS7 Channel 3 ARU Control Bit Register */
#define GTM_MCS7_CH3_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F71A4u)

/** \brief F71BC, MCS7 Channel 3 Memory High Byte Register */
#define GTM_MCS7_CH3_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F71BCu)

/** \brief F71C0, MCS7 Channel 3 Program Counter Register */
#define GTM_MCS7_CH3_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F71C0u)

/** \brief F71C4, MCS7 Channel 3 Interrupt Notification Register */
#define GTM_MCS7_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F71C4u)

/** \brief F71C8, MCS7 Channel 3 Interrupt Enable Register */
#define GTM_MCS7_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F71C8u)

/** \brief F71CC, MCS7 Channel 3 Force Interrupt Register */
#define GTM_MCS7_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F71CCu)

/** \brief F71D0, MCS7 Channel 3 Interrupt Mode Configuration Register */
#define GTM_MCS7_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F71D0u)

/** \brief F71D4, MCS7 Channel 3 Error Interrupt Enable Register */
#define GTM_MCS7_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F71D4u)

/** \brief F7200, MCS7 Channel 4 General Purpose Register 0 */
#define GTM_MCS7_CH4_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7200u)

/** \brief F7204, MCS7 Channel 4 General Purpose Register 1 */
#define GTM_MCS7_CH4_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7204u)

/** \brief F7208, MCS7 Channel 4 General Purpose Register 2 */
#define GTM_MCS7_CH4_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7208u)

/** \brief F720C, MCS7 Channel 4 General Purpose Register 3 */
#define GTM_MCS7_CH4_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F720Cu)

/** \brief F7210, MCS7 Channel 4 General Purpose Register 4 */
#define GTM_MCS7_CH4_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7210u)

/** \brief F7214, MCS7 Channel 4 General Purpose Register 5 */
#define GTM_MCS7_CH4_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7214u)

/** \brief F7218, MCS7 Channel 4 General Purpose Register 6 */
#define GTM_MCS7_CH4_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7218u)

/** \brief F721C, MCS7 Channel 4 General Purpose Register 7 */
#define GTM_MCS7_CH4_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F721Cu)

/** \brief F7220, MCS7 Channel 4 Control Register */
#define GTM_MCS7_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F7220u)

/** \brief F7224, MCS7 Channel 4 ARU Control Bit Register */
#define GTM_MCS7_CH4_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F7224u)

/** \brief F723C, MCS7 Channel 4 Memory High Byte Register */
#define GTM_MCS7_CH4_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F723Cu)

/** \brief F7240, MCS7 Channel 4 Program Counter Register */
#define GTM_MCS7_CH4_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F7240u)

/** \brief F7244, MCS7 Channel 4 Interrupt Notification Register */
#define GTM_MCS7_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F7244u)

/** \brief F7248, MCS7 Channel 4 Interrupt Enable Register */
#define GTM_MCS7_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F7248u)

/** \brief F724C, MCS7 Channel 4 Force Interrupt Register */
#define GTM_MCS7_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F724Cu)

/** \brief F7250, MCS7 Channel 4 Interrupt Mode Configuration Register */
#define GTM_MCS7_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F7250u)

/** \brief F7254, MCS7 Channel 4 Error Interrupt Enable Register */
#define GTM_MCS7_CH4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F7254u)

