zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief F82C0, MCS8 Channel 5 Program Counter Register */
#define GTM_MCS8_CH5_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F82C0u)

/** \brief F82C4, MCS8 Channel 5 Interrupt Notification Register */
#define GTM_MCS8_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F82C4u)

/** \brief F82C8, MCS8 Channel 5 Interrupt Enable Register */
#define GTM_MCS8_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F82C8u)

/** \brief F82CC, MCS8 Channel 5 Force Interrupt Register */
#define GTM_MCS8_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F82CCu)

/** \brief F82D0, MCS8 Channel 5 Interrupt Mode Configuration Register */
#define GTM_MCS8_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F82D0u)

/** \brief F82D4, MCS8 Channel 5 Error Interrupt Enable Register */
#define GTM_MCS8_CH5_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F82D4u)

/** \brief F8300, MCS8 Channel 6 General Purpose Register 0 */
#define GTM_MCS8_CH6_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8300u)

/** \brief F8304, MCS8 Channel 6 General Purpose Register 1 */
#define GTM_MCS8_CH6_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8304u)

/** \brief F8308, MCS8 Channel 6 General Purpose Register 2 */
#define GTM_MCS8_CH6_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8308u)

/** \brief F830C, MCS8 Channel 6 General Purpose Register 3 */
#define GTM_MCS8_CH6_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F830Cu)

/** \brief F8310, MCS8 Channel 6 General Purpose Register 4 */
#define GTM_MCS8_CH6_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8310u)

/** \brief F8314, MCS8 Channel 6 General Purpose Register 5 */
#define GTM_MCS8_CH6_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8314u)

/** \brief F8318, MCS8 Channel 6 General Purpose Register 6 */
#define GTM_MCS8_CH6_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8318u)

/** \brief F831C, MCS8 Channel 6 General Purpose Register 7 */
#define GTM_MCS8_CH6_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F831Cu)

/** \brief F8320, MCS8 Channel 6 Control Register */
#define GTM_MCS8_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F8320u)

/** \brief F8324, MCS8 Channel 6 ARU Control Bit Register */
#define GTM_MCS8_CH6_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F8324u)

/** \brief F833C, MCS8 Channel 6 Memory High Byte Register */
#define GTM_MCS8_CH6_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F833Cu)

/** \brief F8340, MCS8 Channel 6 Program Counter Register */
#define GTM_MCS8_CH6_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F8340u)

/** \brief F8344, MCS8 Channel 6 Interrupt Notification Register */
#define GTM_MCS8_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F8344u)

/** \brief F8348, MCS8 Channel 6 Interrupt Enable Register */
#define GTM_MCS8_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F8348u)

/** \brief F834C, MCS8 Channel 6 Force Interrupt Register */
#define GTM_MCS8_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F834Cu)

/** \brief F8350, MCS8 Channel 6 Interrupt Mode Configuration Register */
#define GTM_MCS8_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F8350u)

/** \brief F8354, MCS8 Channel 6 Error Interrupt Enable Register */
#define GTM_MCS8_CH6_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F8354u)

/** \brief F8380, MCS8 Channel 7 General Purpose Register 0 */
#define GTM_MCS8_CH7_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8380u)

/** \brief F8384, MCS8 Channel 7 General Purpose Register 1 */
#define GTM_MCS8_CH7_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8384u)

/** \brief F8388, MCS8 Channel 7 General Purpose Register 2 */
#define GTM_MCS8_CH7_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8388u)

/** \brief F838C, MCS8 Channel 7 General Purpose Register 3 */
#define GTM_MCS8_CH7_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F838Cu)

/** \brief F8390, MCS8 Channel 7 General Purpose Register 4 */
#define GTM_MCS8_CH7_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8390u)

/** \brief F8394, MCS8 Channel 7 General Purpose Register 5 */
#define GTM_MCS8_CH7_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8394u)

/** \brief F8398, MCS8 Channel 7 General Purpose Register 6 */
#define GTM_MCS8_CH7_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8398u)

/** \brief F839C, MCS8 Channel 7 General Purpose Register 7 */
#define GTM_MCS8_CH7_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F839Cu)

/** \brief F83A0, MCS8 Channel 7 Control Register */
#define GTM_MCS8_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F83A0u)

/** \brief F83A4, MCS8 Channel 7 ARU Control Bit Register */
#define GTM_MCS8_CH7_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F83A4u)

/** \brief F83BC, MCS8 Channel 7 Memory High Byte Register */
#define GTM_MCS8_CH7_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F83BCu)

/** \brief F83C0, MCS8 Channel 7 Program Counter Register */
#define GTM_MCS8_CH7_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F83C0u)

/** \brief F83C4, MCS8 Channel 7 Interrupt Notification Register */
#define GTM_MCS8_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F83C4u)

/** \brief F83C8, MCS8 Channel 7 Interrupt Enable Register */
#define GTM_MCS8_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F83C8u)

/** \brief F83CC, MCS8 Channel 7 Force Interrupt Register */
#define GTM_MCS8_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F83CCu)

