zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_reg.h
/** \brief F9210, MCS9 Channel 4 General Purpose Register 4 */
#define GTM_MCS9_CH4_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9210u)

/** \brief F9214, MCS9 Channel 4 General Purpose Register 5 */
#define GTM_MCS9_CH4_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9214u)

/** \brief F9218, MCS9 Channel 4 General Purpose Register 6 */
#define GTM_MCS9_CH4_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9218u)

/** \brief F921C, MCS9 Channel 4 General Purpose Register 7 */
#define GTM_MCS9_CH4_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F921Cu)

/** \brief F9220, MCS9 Channel 4 Control Register */
#define GTM_MCS9_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F9220u)

/** \brief F9224, MCS9 Channel 4 ARU Control Bit Register */
#define GTM_MCS9_CH4_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F9224u)

/** \brief F923C, MCS9 Channel 4 Memory High Byte Register */
#define GTM_MCS9_CH4_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F923Cu)

/** \brief F9240, MCS9 Channel 4 Program Counter Register */
#define GTM_MCS9_CH4_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F9240u)

/** \brief F9244, MCS9 Channel 4 Interrupt Notification Register */
#define GTM_MCS9_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F9244u)

/** \brief F9248, MCS9 Channel 4 Interrupt Enable Register */
#define GTM_MCS9_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F9248u)

/** \brief F924C, MCS9 Channel 4 Force Interrupt Register */
#define GTM_MCS9_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F924Cu)

/** \brief F9250, MCS9 Channel 4 Interrupt Mode Configuration Register */
#define GTM_MCS9_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F9250u)

/** \brief F9254, MCS9 Channel 4 Error Interrupt Enable Register */
#define GTM_MCS9_CH4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F9254u)

/** \brief F9280, MCS9 Channel 5 General Purpose Register 0 */
#define GTM_MCS9_CH5_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9280u)

/** \brief F9284, MCS9 Channel 5 General Purpose Register 1 */
#define GTM_MCS9_CH5_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9284u)

/** \brief F9288, MCS9 Channel 5 General Purpose Register 2 */
#define GTM_MCS9_CH5_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9288u)

/** \brief F928C, MCS9 Channel 5 General Purpose Register 3 */
#define GTM_MCS9_CH5_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F928Cu)

/** \brief F9290, MCS9 Channel 5 General Purpose Register 4 */
#define GTM_MCS9_CH5_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9290u)

/** \brief F9294, MCS9 Channel 5 General Purpose Register 5 */
#define GTM_MCS9_CH5_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9294u)

/** \brief F9298, MCS9 Channel 5 General Purpose Register 6 */
#define GTM_MCS9_CH5_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9298u)

/** \brief F929C, MCS9 Channel 5 General Purpose Register 7 */
#define GTM_MCS9_CH5_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F929Cu)

/** \brief F92A0, MCS9 Channel 5 Control Register */
#define GTM_MCS9_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F92A0u)

/** \brief F92A4, MCS9 Channel 5 ARU Control Bit Register */
#define GTM_MCS9_CH5_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F92A4u)

/** \brief F92BC, MCS9 Channel 5 Memory High Byte Register */
#define GTM_MCS9_CH5_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F92BCu)

/** \brief F92C0, MCS9 Channel 5 Program Counter Register */
#define GTM_MCS9_CH5_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F92C0u)

/** \brief F92C4, MCS9 Channel 5 Interrupt Notification Register */
#define GTM_MCS9_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F92C4u)

/** \brief F92C8, MCS9 Channel 5 Interrupt Enable Register */
#define GTM_MCS9_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F92C8u)

/** \brief F92CC, MCS9 Channel 5 Force Interrupt Register */
#define GTM_MCS9_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F92CCu)

/** \brief F92D0, MCS9 Channel 5 Interrupt Mode Configuration Register */
#define GTM_MCS9_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F92D0u)

/** \brief F92D4, MCS9 Channel 5 Error Interrupt Enable Register */
#define GTM_MCS9_CH5_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F92D4u)

/** \brief F9300, MCS9 Channel 6 General Purpose Register 0 */
#define GTM_MCS9_CH6_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9300u)

/** \brief F9304, MCS9 Channel 6 General Purpose Register 1 */
#define GTM_MCS9_CH6_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9304u)

/** \brief F9308, MCS9 Channel 6 General Purpose Register 2 */
#define GTM_MCS9_CH6_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9308u)

/** \brief F930C, MCS9 Channel 6 General Purpose Register 3 */
#define GTM_MCS9_CH6_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F930Cu)

/** \brief F9310, MCS9 Channel 6 General Purpose Register 4 */
#define GTM_MCS9_CH6_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9310u)

/** \brief F9314, MCS9 Channel 6 General Purpose Register 5 */
#define GTM_MCS9_CH6_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9314u)

/** \brief F9318, MCS9 Channel 6 General Purpose Register 6 */
#define GTM_MCS9_CH6_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9318u)

/** \brief F931C, MCS9 Channel 6 General Purpose Register 7 */
#define GTM_MCS9_CH6_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F931Cu)

/** \brief F9320, MCS9 Channel 6 Control Register */
#define GTM_MCS9_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F9320u)

